{
    "channel": "AlexBeckersChannel",
    "date": "2025_01_05",
    "transcript": " No joke a lert. Very serious video. You see that warning at the start of one of our videos. You know this video is going to. And we will in this video. Look, I know why you're here. You want to see the hottest coins in 2025 that you can ape into without thinking that will just give you a bukhake of gains. And in this video, I'm going to give you coins. I'll give you a bukkake of gains like a cardano holder's wife. You're going to be very unclean after this video. But the reason why I had to put a no joke alert, a very serious video alert at the start of this video is because I had this whole song and dance. I was going to whip out the golden gun, the sunglasses, make fun of your virginity and call you a cuckold in 50 different ways. But we don't have time to do that because the market is moving too damn fast. I make a video on this channel a week later, two weeks later, the coins are up 10 15x. And no, I'm not kidding. Just the last few months, we point out neural pin link, vertical xpg PI, all up 510 15x. And this video. I have to pretty much rush up today because the movement that I'm gonna talk about and the narrative I think is gonna pump turbo hard is happening right now. So I don't have time to make a funny intro humiliating you today. You're just gonna have to go to the femdom section on pornhub and get off that way. I apologize because I don't want you to miss this move and I specifically don't want to miss out on claiming clout on Twitter. So we have to get this up now. Look, in Q1 2025, there is one narrative that is going to pump harder than anything else. The stars have alliance here. We've been talking about the past year. The this thing is happening right now. And I think the biggest move of it, the biggest gains are going to be able to be seen, are going to be in Q1 2025. That's January. For you few retards who are watching this channel, it's okay. This channel is for everybody. I'll give you a pat on the head a little. You're a special guy. You can invest in crypto too, just like the rest of us. But back on track. This is the move and there is going to be no more second chances after this. Once this moves, the sloppy seconds are just going to be way too sloppy, way too soupy. It's going to be very lobster bisky and unless you're a Cardano holder, you're really not into that. So I'm begging you, please listen because you're going to need to move with urgency. And when I say urgency, I mean it. If you've been here the last few months, you would have caught coins like neural up 10x, destro up 30x from what we pointed out. Pin link up 20x the last few months, vertical up multiplexes since we mentioned it. PI up 67x. Super up 20x. I could list more things, but I think it's pretty clear we don't around this channel. I out. Alex Becker, the most woke golden God of crypto, the Alpha Poppy Kol and simply a generational talent when it comes to picking these Ponzi scam coins. You know this, I know this, I know that you know. So what I also know is you've probably seen on Twitter that people also say I'm the most humble, family friendly Kol as well you probably see on Twitter all the time. Wow. Alex Becker is so humble. Wow. There is no Kol who relates to the common man like Alex Becker. He really knows how to put things in purple crown and really makes an investing my life savings in crypto bull so easy, so fun. How else would I possibly lose all my money without Alex Becker? How else could I possibly get into Ponzi scam coins, convince my family to get in on them, and then savagely dump on them later this year? He's a blessing. He's an icon. He's an American treasure. And thank you. I do appreciate you having those thoughts and saying those things about me. But I'm not here to brag. I'm not here to flex. I'm not here to talk myself up. What I am here to do is to get straight into this narrative right now and explain to you not just the coins that are going to pop, the coins that will make you go, oh my. But also show you how to play this narrative from the buy point to the sell point and exactly what's about to happen in the market right now. Look, before we talk about these coins, and yes, we will talk about the coin, I know you're here to ape your life savings into some scam coins, lose all your money, and then blame me six months later for it. Don't worry, I'm here for that. We want to get to the good old vintage quality content of picking coins. We will do that. And in this video, I will work my way up from larger coins, the boring ones that you don't want to invest in, but you probably should, all the way to those dirty red light gains with crazy high risk but crazy high returns that you guys absolutely don't know how to manage, don't know how to sell, but keep investing in anyways. Don't worry, we'll get into that. And also throughout this video, I'm going to spruce in a few coins that I've gone into recently, but are just a little bit too small to talk about in videos. But I'll be giving a little subtle hint throughout this whole entire video. There's about five of them, so you should look out for them. On top of that, there's another hint for our next cipher allocation for you guys who are following my meme coin drop. But what we have to talk about before that is what is the market doing? Because everything we're about to see in this narrative and things that's about to pump is related to what the market's doing. And if you don't understand the market's doing, you're not going to do very well here. So we got to talk about Bitcoin, we got to talk about Ethereum, and then we need to talk about this narrative in this sector of the industry and why it's going to pump in Q1. I don't think it's going to pump this hard the rest of the year. I think it's going to be really condensed into a Q1 super narrative and if you don't get in on this, then it's just too late. And then, yes, we will talk about the coins. Then finally I want to talk about how to play this narrative, because buying is not just the whole entire thing. You got to know how to sell, you got to know when to exit these coins and how the flow of this is probably going to work for the rest of 2025. So this is your complete toolkit. I think you could literally just nail this one move and then ret for the rest of 2025. So this is not only going to show you the coins, but to give you the understanding of the market in the industry that this is happening in. So it's your entirely armed and teeth to actually go out there and if you want to get really crazy, pick and research your own coins and not be a degenerate retard who just goes to crypto YouTube channels and thoughtlessly buys coin. But I know there's only two of you that watch this channel that actually think like that. So let's get into it. All right, so we are deep inside my computer and the first thing we need to talk about is the market because I'm going to give you the coins. I'm going to talk about this narrative in the industry. Don't worry, we'll get to the pomp pomp. Okay, but everything you're going to see in terms of the pomp pomp is going to seem very confusing. It's not going to seem like there's a pattern to it. It's going to seem like coins are popping off left and right. And they are right now if we go look at stuff like, I don't know, palm, just in the last day put in a 40% candle. If you look at rye, which we recently got into like right here just a few days ago, things already put in like another 40, actually 89% candle the last few days. So things are pumping left and right, which before we talk about anything else, why are you not following me on Twitter? You would have known about all these things. It takes me forever to make these videos. It's like an hour long video. The editing, everything. I hate doing it. I don't like interacting with you. It's the worst part of my life. But I have to keep up this channel. But Twitter, I can, I can sh t post their left and right. You would have seen all these coins and all these things way earlier. So follow me on Twitter. You're going to get notified about everything way sooner. So why are these coins moving? Why are they all pumping? And what can we expect from the future? Well, none of that's going to make sense. And all the coins and stuff I'm going to talk about are not going to make sense unless we talk about Bitcoin, Ethereum and the rest of the market. So please bear with me. I know you don't want to understand what's going on in crypto. You just want to get to the pump, pump. But this is going to make it so the few of you to have an IQ over 10 do very well in this market and actually lead with your butt intact. Okay?\nSo I'm going to force this upon you, okay? It's like a 45 year old guy at a college party. No one wants to be there. It's very creepy. No one knows what's going on. But he's paying for all of us. You just better put the up with it. So look, bitcoin, what's going on in the market right now? So last month it's been all over the place. We saw the first kind of big dip. I don't think this was a really big dip. And I think we're going to see much scarier dips coming here real soon. But if we look at bitcoin, it pulled the exact same move it did last bull run. And so where I think we're at right now is kind of like around right here. Either right here. If we zoom in a lot right here, editor, just zoom in. We're either right here in this first bear trap or this first bear trap or here, it doesn't really matter. So what you can see bitcoin doing here is very similar to what saw last run. Actually, almost exact same time frame December started moving up, or October started moving up and then kind of halted out in December and ended its big surge in January. Now, I don't like copying pasting the last bull run to see what's going to happen this run, but looks really damn similar, so we can at least be aware of it. Now, the thing we really want to be aware of from all of this is a. I think bitcoin is going to do another charge in January. But you have to understand you, if we look at the dates on this charge right here, you can see it made its big move all the way up to the top around the 7th of January. So Ethereum made its big move. Keep that 7th of January in your head. It made its first big move a little bit after. So you can see it made this big giant move and it didn't complete its move until about the 19th. So about 10, 12 days after Bitcoin made its move. So what am I trying to point out? Like this, the most important coin to all of our altcoins and everything we're doing right now is Ethereum. Why is that? Because when Ethereum moves and makes its moves and then settles right here, this is when all the other altcoins go wild. This is when Solana Cardano, Avax, Sui. I don't know how to pronounce it, so I'm just gonna pronounce it. Sui. I have absolutely no effing clue what this coin does. I need to do research. Everyone's been talking about it, but I suck at my craft, so I couldn't tell you too much about it. But we're gonna see Sue White and Polka Dot and Uni swap everything else. You just go wild. But we're not here to talk about those coins because I think we've talked about them enough in this channel. I think Avax is going to do super well because it ties in this narrative we're about to talk about. But why is this important? Okay, if you're noticing everything in crypto is correlated and so it all moves off of Bitcoin and then moves its way down, what's going to happen is after these coins move, people are going to go, all right, what's the, what's the next big thing? What's the next big narrative? So over last year it's been meme coins with a little dabble of AI and in gaming's been doing pretty well as well. Now what I think is going to be the next big move and what is the next big move is 100% going to be AI? When people get done with these top altcoins right here, we're going to see, for example, Avax or Solana Charge. After Bit or Ethereum hits its all time high, people are then going to say, what's next? It's 100 going to be AI. Now why is it going to be AI crypto? If you look in traditional markets right now, the hottest thing in the entire world is AI. If you look at SaaS, if you look at businesses, AI agents and AI functionality applied to different industries is by far the hottest thing in the entire world right now when it comes to investing, just period, bar none. And crypto is one of the hottest financial assets right now. You're combining the most hot thing in the world right now, the hottest overhyped, overvalued narrative of all time in the world right now, with the hottest new sector in finance. You combine them together, you have AI crypto. This thing is going to pump super duper hard. All of CT is watching this and all of the investing world I think is soon going to be watching it and dumping their money into it as well. Especially after Ethereum hits all time high. That's really what we're waiting for. After Ethereum hits its all time high and then this charges, you were definitely in the mid to late market at that point. So why do I think it's going to be AI? It's a few different things. A what I just laid out in front of you, the investing narrative, the Overhype narrative and stuff like that. But the thing that's coming up that I think is going to give us that huge Q1 boost I'm talking about is Binance and all the other exchanges keep hinting at AI. Binance keeps listing Destro and a ton of other AI coins. They've done it three or four times now. Now, if you don't understand how Exchanges work. They get a cut of every single trade that goes on their platform. And so there is massive, massive, massive volume going on on coins like Destroyer, for example, right now. Okay? And what Binance wants, what Coinbase wants, what all these exchanges want, is they want a chunk of that volume because it's huge amounts of money that they're missing. And this is probably going to be the pumpiest narrative in Q1. So there's no way in hell they're going to miss out on all those sweet, hot gains from us gambling on Ponzi schemes. They're just not going to do it. And so I don't foresee a fathom away that in the next month or so, Binance doesn't start listing coins like Destro and Pin Link and anyone and other coins will mention in this video. And when that happens, what we're going to see is an absolute wave of speculation on all the smaller AI coins. So we're going to see, you know, I think 0x0 will be listed. I think PAL will be definitely listed. I think that should be differently listed. But we're going to make the giant crazy gains. Yes, you can make these giant crazy gains in destro and AIs and top coins up here like this, but we're going to be making them in the smaller coins like palm hash. I think hash will actually be listed as well. That's a big one. That's been listed a lot. But if we keep going down, coins like VRA, Z, KML, etc. Are just going to go wild. And what we're going to be seeing is what we've been seeing in a lot of new AI coins in the market now. For example, vertical AI, we pointed that out about less than a month ago. Less than a month ago, as I make this video, the coin is up stupid amounts. Just stupid amounts. We're going to be seeing new coins in the market very quickly that are going to do 10, 15 X's back to back to back to back. So you can catch in on that as well. And that's what we're going to talk about when we talk about playing this narrative. So there's a lot of things that you can do right here. One, you can get into the big chunky coins and make 3, 5 x's very quickly. You can get in the lower coins and make 10X's very quickly. And if you're watching the newer coins launching, you can make 10, 15 x's very, very quick. Now, before we talk about coins and the rest of the Industry. That's my, that's my thesis. That's what I think is going to happen. The combination with the extreme hype around this in the entire investing world, the fact that all of crypto is looking at it, the fact that AI agents are the biggest narrative right now in crypto, combined with the fact that we have all these listings probably coming up, it's just a perfect storm for a big explosion as Bitcoin Goes and crosses 100k and Ethereum crosses its all time high. If we have all these things happening at once, this is going to be disgusting. And so that's what we need to keep in mind before we talk about these coins, we talk about how to play this market. Now I'm going to talk about the coins I already gave you disclaimer at the beginning of the video. I don't want to give you a two minute disclaimer right here. Please read the disclaimer in the description of this video. It is not in crazy legal speak, it is in turbo clear English. So you understand the risk that you're taking right here. And before we talk about the coins right here, there's a lot of good projects I'm going to talk about. But you have to understand when I pick projects, I'm not looking for like the text, okay, everybody's act like they're in it for the tech and they're like talk about the future of finance and tech. No, I'm looking at narratives, what things are going to pump. For example, there are plenty of coins that are pure vaporware in this industry that you can invest in that will make you a ton of money and you just need to get out of them. The difference between how a vapor war coin, a coin that does absolutely nothing and a coin that has the best technology on earth performs in a bull market is pretty similar. And the amount they crash is exactly the same. Last market in gaming crypto for example, we saw great canes or coins like super take as big as dives, as games that were completely non existent in the space. So please understand what I'm investing here. I'm not sitting here telling you to make some big long term crazy investment. I'm not sitting here telling you any of the coins I'm picking right now have the greatest tech in the entire world, are even going to be here within five years. I'm not even telling you they're going to survive the next bear market. I'm telling you this industry right here is going to pump super duper hard and we're going to see wild overvaluations in everything. And what I'm looking at is where the narrative and the hype and the behavior of the humans that are investing in crypto, how they're going to behave and what they're going to think. So I'm looking at marketing and narrative and you should be too. I don't want you to be going into any coins anywhere in crypto thinking you're making some long term tech investment unless you're in like the top 100 or something like that. So there's a lot of coins I'm going to talk about that are really great tech and everything, but I'm not focusing on that. The reason I'm picking these coins is the narrative, the hype and the focus that I see investors having on them. So please invest with that perspective. So let's talk about what's going on in AI. The place you want to get into an A in Altcoins purely and simply is just going to be AI and AI agents going into this Q1. I think a lot of other parts of the market are going to do very well later this year, but this is just where it is. So I'm just lock solid ready to take advantage of this right now. So where do we want to start at? I actually see Avax making some incredibly huge moves in AI. So if I'm picking any like really big coins to get into, first one I put the top list is going to be Avax. Now as we work in actual AI coins where I would be investing if I was a pure like dir dur dur, don't want to think too much investor, I would pick near and bit Tensor, Render, Internet, computer, virtual. These are all good too. Okay, I'm not saying any of these are bad, but if I'm looking at anyone, I'm just going to get in near and bit Tensor and keep it simple. You can invest in the top five right here and create a really good mixed portfolio that will do just fine. And I think Bittensor is probably going to be one of the leading blockchains when it comes to AI. So that's why I'd be going in with that. So on top of that, like I just did, I think Bittensor is going to probably be the leading blockchain when it comes to AI development, or at least when it comes to narrative and hype around it. So this isn't really an AI coin that I just got into, but what it is is one of the best strategies you can use is usually to go on to these chains that are up and coming and then buy the dexes, the oracles, the uni swaps, the et cetera as the radiums that go on it. Like for example, Raydium is the swap site for Solana. What I think is going to be the leading or the up and coming decks on Bittensor is going to be Taobot, which I probably just butchered the pronunciation, but this is probably going to be the Dex on Bittensor. So bet tensor being the big AI blockchain that I think is going to get a lot of hype. Thus I think, like every other chain, its dex is going to do very, very, very well. So that's why I've gone into this. Not really an AI pick, but I just had to throw that out there. So if I'm. I'm a beginner. Okay, you've been doing this. This is your first time in crypto. I really don't suggest everyone's gonna gasp in awe. I don't suggest you buy any of the coins I'm gonna talk about later on this video. I actually don't suggest you buy any coins I mention ever, because billions of people are watching this channel. You should use the thought processes and how I'm looking at coins to find your own coins. And trust me, there's a f ton of them. If you just branch outside the path, you're gonna find so much stuff early and you're gonna beat me to the punch on a lot of them. For example, a coin I recently got into that I think is gonna do really well repoi. You know, I got into it like right, like right here. So I'm already doing like really well on it. We're in like a 2x on this, you know, But I have multiple friends and stuff. We're kind of newer to crypto. They did their own research, got in like right here. And so they've made like 20x on this thing before I got into it. So that's why you want to apply the research that I'm talking about here. That's how I found stuff like pin link. And we're able to get into that when it was like way down here. So please use the theories on this channel more than just the initial coin picks. Anyways. If I was a complete beginner, I would just stop at these top five. Now actually to add to that, what I would do is I'd throw a on top of that because I think this is probably the smallest big cap coin you can see. These have market caps of 6,5 million or whatever. I think AI's is easily going to these market caps right here. So I would throw a on top of that or if I was starting a more higher risk portfolio, I would start with aas. I would also throw in a kosh network. All right, so if I'm getting into like the more middle range AI coins, AI is in a Kash network. I would also throw an echelon prime. So my top, like big mid caps, Aya's kosh echelon prime really safe ISH coins. And the tech around these is good enough that it's probably, these are probably going to be coins will be around five years from now. And all these coins I just mentioned, when the market crashes, these are going to crash 80, 70% with every other coin in the market. But these will probably come back. So if you're new to this and you hold the wrong way, worst case scenario, you just hold for a few years and you can probably get your money back. You can see, for example, near, I think it popped up last bull run you can see in the 2021 took this massive dive and now it's coming back right here. And this is what I'm referring to. So this isn't great. Trust me, you're not going to enjoy this, but your butthole will still be intact after this anal reaming right here. You'll come back from it. If you get into some of these lower coins, the butt, you're just in a wheelchair for the rest of your life. You're done, cooked. So. So let's start talking about more of the mid cap coins that I think are about to get listed. These are the coins that are going to get listed and give these big explosive gains really, really soon. So Destra, I've been saying it's a chosen child on Twitter because I think that's a fun thing to say. It's one of my favorite lines as well as making fun of cardano holders and their weird fetish with their wife dating other people. But so now what I want to do is I want to kind of dig into the more dirty coins, the ones that we really shouldn't be talking about at Thanksgiving dinner, the ones that are going to leave you with a case of hepatitis and AIDS after this bull runs on. Those are the coins we want. Those are ones we want to get into and lose all of our money in. So these are the coins that are also, I think are going to be listed here pretty soon. So where we'd start at would just be destroyed. This is the Chosen child I talk about all the time on Twitter. We got into it way down here early in the year, last year. Ish. And this thing just keeps going up. And the reason why I think this is probably one of the best bits is Binance seems to have a huge erection for it. They keep mentioning it left and right on their news posts and everything. And I can't fathom them watching the AI trend go by. Having talked about this coin three or four times, like generated tons of volume and then not listing it on top of that, they just removed all their taxes on it. So if you don't know, a lot of these coins have little taxes on the way that these companies raise money is they have a little buy sell tax on the transactions when people move in and out of them. That's how they raise money for their company. They just remove that because this company is already profitable or at least generating a lot of revenue. Thus the stars are aligned for this to be listed and just make a giant charge here very, very soon. So Destroyer would probably be the leading coin in the mid cap higher gains areas, pal. Absolutely. Right up there. We've talked about PAL a lot on this channel in the past. Yeah, easy, easy pick. All right. If this, if Destroyer gets listed, Pals getting listed, no problem. Then the other one in this area is going to be 0x0. This is a really good trifecta. These three right here would definitely be the ones to get listed. These have enough time in the market and they're old enough that they're not. Some new coin is being slapped up on Binance. And so those three right there are just going to be really solid mid cap bicts. So let's back up and round up everything we talked about so far. Again, if we're more beginner, we're going to just start with these top five right here. Maybe Chuck in Ayas. Okay. If you want a little bit more explosive gains, you have to understand that Aya's is probably going to make bigger moves than these top five right here. Everything below A is going to move harder. And as we move lower and lower down this list, the gains increase, but the risk increases. So if you want a little bit of risk but much better gains, I'd start with aos, Akash Echelon Prime. Now, my portfolio, I don't own Akash. I don't own Echelon. What I'm doing is I have AOS and I go all the way down to Destra. And Destro is one of my biggest bets in the space and then pal and 0x0. I really think a good, safe, big, chunky, high return portfolio which is going to mimic mine exactly would just be Aoz, Destra, Pal and 0x0. But there's other coins I mentioned are really good honorable mentions too that I think you should research. I don't think you should just copy and paste my portfolio. And you need to understand you don't need to have every single coin in the market because Akash will probably see similar gains to AIs. And just between the two I think as is going to do slightly better. But it's not like if you go all in on Akash, you don't get AIs. You're going to miss out on all the gains. It's not like if you buy 0x0 and don't buy Zig, you're going to miss out on like Zig gains because I think Zig will probably move very similar to 0x0. I don't own any Zig, but I think it's a good coin. So now we're kind of working our way to the sub $200 million market caps. And again as we go lower the gains are going to be here, especially if desktop gets listed. It's just going to set a huge amount of speculation we received destroyer jump to like probably the billion, multi billion dollar mark. And everyone's going to be thinking, all right, which of these coins down here are going to go next? And so we're going to see these explode off of these listings up here or just the general craziness in AI. I think these could still go absolutely nuts without any listings. The listings will just definitely help. All right, so where I'd be starting at in the more higher tier risk, but higher gains would be node AI. This one has a lot of time in the market, has a lot of trust, it has a lot of focus and narrative around it. It's one of the older, more well known coins and I think it's going to run very well. Now I've realized one thing. I was just as I'm making this, I haven't talked about any of the tech or what these coins actually do. It doesn't matter. Jokes aside, I like being a little bit hyperbolic here, but it doesn't, it doesn't. Do you care? No. You don't. You want to know what's going to pump. You don't care. If you want a good breakdown of what all these coins do, I have a very big AI video that is linked to below in the Description on this channel. It breaks down how these work, why these make money, why these have huge potential in tech in the future. It's about a 30 minute video. This video is probably already going to be 30 minutes. I don't want to make an hour long video. If you want to know exactly what these coins do and the specifics behind them, there is endless amounts of information in the video below here. I'm just getting into what I think is going to do very well. And I'm not going to spend five minutes explaining what each of these coins do because frankly, you don't care. So please keep that in mind. Long story short, Node has a ton of attention in crypto. It's been around long enough that it has a brand name which is very important with these pumps because when stuff starts pumping, pumping, people think, all right, like what's, what's next? Node has a pretty large brand name inside this and I think it's going to do very well. Now next, one of I think kind of the chosen children is Neural AI. This is a, a platform slash tool that also ties into one of the other hottest narratives in crypto, which I think is gaming crypto. I think Neural is probably one of the best mid range caps on here. You can see just on the last day it's put on a 50 candle. I mean this thing, it just shows a lot of strength when the market's been down. And the thing we've seen a lot about a lot of AI coins that is almost creepily bullish is if you look at Destro the past month or the past year, it really hasn't done too big of dips. You can, all right, look in Layman's terms, a 50% dip or a 20, 30% dip from here to here is a lot. But in mid caps this is, this is not a big dip. And you can see it's really gone and stayed sort of around its old all time high this entire year through a lot of flak and bearishness in Bitcoin. And so the second Bitcoin Ethereum take this thing just, it's desperate to run. It is so damn horny. And so you're seeing that action and a lot of AI coins. So back to where we left off. Neural is really good. Altura is something that just moved into AI and it ties NFTs and gaming with AI. And I think that's going to be a massive, huge narrative. Imagine you own assets that have their own like thoughts and agents behind them. It's going to be huge. I think Alter is another top coin that unites the AI space and NFTs and gaming altogether. And so I love these two because when the AI narrative kind of pops, which it will probably in a couple months, and then we'll go and reset and then probably go back up again, I think the gaming narrative is going to pump super hard. So I think these could carry into the gaming narrative, which is very important. Hash AI is a kind of real world asset Mining AI basically decentralizes bitcoin mining and mining of other coins. I love AIs that do this because they actually generate money in a huge investment thesis for the investors. So Hash AI is another top one. It has a really big brand name. It's been around long enough in crypto that I think is going to do exceptionally well. And in one I don't see listed here, but I don't understand why is going to be. Is it not on? There is going to be anyone. And so what this does is it decentralizes or anonymizes a lot of the things that all this AI tech that I just talked about is going to be using, which is essential because you don't want people being able to see where you're doing certain things from or track where you're doing certain things from. And so Deepin is a huge narrative in AI. And I think I don't have too many Deepin coins, but my leading Deepin coin that I'm in is going to be anyone because it just plugs into all the things we talked about. And one thing I'm looking about when I'm buying cryptos is I want to see something that has a narrative to plug into everything. I don't want something that's just a standalone thing. I want something that all these things rely on very similar, like Chainlink, for example. So that's why I'd pick anyone. So those are going to be kind of the more mid cap, higher risk, but not super crazy risk. Okay, so I'm going to start at Destra 0x0 PAL, Neural, Altura, Hash and anyone. Those are where I'm going to kind of hang out now. We're going to be getting into like the kind of dirtier ones and then that's anything below 100 mil market cap really in AI right now. And there's actually a tier lower and dirtier than that. But I really don't suggest you get into that tier unless you've been doing this for a couple years. So where I'm going to be looking at as I Get below those coins. Palm, I think is, is not underrated at all. I think there's massive hype around Palm. You can see put in a 40 candle literally in the past couple days. I think this thing is going to just keep going. I think a billion dollar market cap could be on the table for Palm. And with how it's currently moving, I think the zoom on this thing is coming. Once Destro gets listed or we start seeing destroy on Lamoom, Palm is just going to go great. And then after that, the one I'm gonna. I'm including this one in this list. Even though the market cap's a little bit higher because it's very new. All right. PIN Link is very new. It came out almost two months ago. We got in right here. We've crushed it with this one. And what Pindle also crosses into is the real world asset kind of class. It has a little bit to tie with AI. But what's being done right now is RWA is being lumped in with AI. So PIN Link technically isn't really even a AI coin. But in this next wave coming up, I think investing and storing money on blockchain in terms of just good old boring investments instead of going and investing in ETFs and indexes and having a financial manager, I think a lot of people are going to be doing this on chain in the future. PIN Link and another coin that hasn't released yet but I think is going to do very, very well called omg. These are going to catch wind with the AI narrative as well and I think they're going to keep charging. So this is kind of more of a bonus coin, but I have to include there. It's a little bit new, so it's also high risk as well. But I think that thing is going to do stupid, stupid. Well, I think that's going to get listed and everything the same way Destroyer and everything is going to get listed. Its market cap's already high enough and the volume's already high enough. And then finally, if I'm talking about any smaller cap coins, where I'm looking at would be the following. Okay, so parallel AI and these are the more advanced coins. If you haven't been doing this for a few years, I wouldn't be jumping into these ones to start with. But these ones will probably deliver the highest games. Parallel AI PI going to do phenomenal. It came out very recently. It's just been showing a lot of strength. And again, these things are just going to. It's all tied to the top Coins. Once those ones get listed and start moving, all these ones are just going to. Because people are like, these are next. And if I build in a more riskier portfolio, I'm going to have parallel AI. I'm gonna have vertical AI, which just cracked $100 million market cap from when we mentioned. You gotta follow me on Twitter, guys. You gotta follow me on Twitter. But I think this is gonna keep going up. It has massive attention around it. And one, it's kind of had the golden hand recently that I just jumped into, actually kind of FOMO'd into. It's gonna be replay, and it just will not stop. We got into it at four bucks tomorrow. This thing just isn't stopping. So that's another really good one, right? And I think this one has a massive amount of hype, and I think the marketing on is just very saucy. Very, very, very saucy. And there's a few other coins that I've got into recently, but they're just a little bit too big to be talking about video. I have hinted about them a few times in the video, if you've been paying attention, but that's why you want to be following me on Twitter. So you catch the things when we talk about right here. So those are. Those are what I'm looking at. As far as the rest of AI coins go, I really super duper, super crazy suggest that you say, all right, cool. So this Becker guy, he's got some points, but he's absolutely retarded. So what I'm gonna do is I'm gonna actually try and think on my own, because I don't want to follow an absolute. And I'm going to, like, go dig into some of these other coins and see what could possibly next and use the things that he's talking about, the narratives and how he's communicating about this space and apply that to these smaller coins out here and maybe find ones that are launching or find new coins that are launching, for example, vertical or actually, hell, let's just talk about repo came out literally, like a week and a half ago. So you should be watching for those new opportunities and what to do. So. So now the last thing I want to do in this video is talk about how we should be playing this market. Well, there's three ways we should be playing this market. All right? So first thing, you just want to have your big bag portfolio, and you just want to hold it. I think these big ones up here are going to do very well. This entire bull run. You can probably just squat in these until middle of 2025. The same applies to Destro, the same applies to Powell and all them. And the same really applies to all these coins in the market. And the time when you probably want to start thinking about selling these coins is, hey, I'm in a lot of these coins I've been in since November, so I'm consistently taking profits every week right now. That doesn't mean I'm dumping all my bags. That doesn't mean I'm selling, but I'm consistently selling about 1 to 2% of my portfolio every week as we go up. As I talked about when we got in in November of last year when all these coins were at rock bottom prices. I don't care where we on the market right now. I'm consistently taking profit and I suggest you do too. When you're making two, three X's right here, start taking a little bit of money out consistently over always. That's rule number one. But when you really want to start getting scared here is probably when we see Bitcoin crossing, 120,000 are getting in that area, is that going to be the top of the market? I don't know, but I think we're going to see this giant pump in AI and I think it'd be a huge shame if you just didn't take some money out as the market starts to get really hot. This is not stuff you want to be holding for the rest of your life. This is not investing in the S&P 500. And the next thing you want to be doing with this market is you can see, like for example, with vertical AI, there are new coins hitting the market very quickly. And what you're going to see in this space is look, vaporware coins launching left and right and making a ton of money. I'm not saying don't buy vaporware coins. In fact, in crypto, one of the best ways to make money is to buy vaporware coins and see where the narrative is going. People and scuzz bags and all sorts of people that want to make money are going to be launching coins left and right based around AI. And if they have the right marketing, they have the right narrative, they're going to do very, very well. Now, vertical AI is a great project, but you can see how fast this project shot from absolutely nothing to 100 million. That's ridiculous. I love vertical. It's great. I talk to the team all the time. But a coin going from 0 to 100 million in literally a week or two or we looked at other coins, we've seen similar. That's not sustainable in any way, but that's fine. What we're trying to do here is we're trying to move in the market and make money very, very fast. So what you want to do is you want to be in the smaller groups, you want to be on Twitter, you want to be talking to everybody, and you want to be looking out for these new coins launching while you're holding these bigger coins. One place size project I think is really undervalued in this regard right now is Cetify. Most people know it for its gaming fund, but what they've also transitioned to and started adding right now is a lot of AI agents and a lot of AI coins launching. So I think if we look at any past bull run Cetifies always had some of the best drops and launches and they have the best marketing and ran team. In my opinion, it's the only launchpad system that has been working and actually kept its market cap for years at this point. And with them bringing on AI agents and transitioning that, I think when this hype gets blown out of craziness, everybody's gonna be looking like, where's the new coins? Where's the new coins to get into? Cetify is going to have a lot of those. Thus people are going to want to have Cetify. So you can kind of gatekeep that by having a big old bag of Cetify, which I've had for years. And then when you get these coins and they go and do these two three X's like this, take half out, take 50% out, take the money at least that you put in out and then go and roll it into the bigger coins or just take it out of the market. And those are the ways I would be kind of playing this. So that all being said, I'm looking at the time in this video and we're at like 40 minutes. So I think we've made enough content on coins. Yeah, AI coins are gonna do very well in Q1 if you want to see some of those smaller coins and when they launch and see things as soon as humanly possible. Follow me on Twitter @CSS Becker. I don't have anything else to add, so goodbye."
}