{
    "channel": "AlexBeckersChannel",
    "date": "2025_01_19",
    "transcript": " All right, let's get one thing straight. We all know why you're here. You see Trump pumping, you see crypto pumping, and you're finally thinking to yourself, oh, I think it's time to get into this crypto fat. How can I go and find little Ponzi coins, tiny little coins that nobody knows about, and 5, 10, 20 x my money in them? And good news for you, this video is going to give you exactly that. And then savagely dump them on retail. Savagely dump them on grandparents, retirees, and new parents looking to just make a buck to pay off their house. And there is only one reason why you are thinking that. It's because you're a very smart, edgy, unique thinker. Just kidding. You're a piece of. You want money for nothing. You want money fast. You want to find a little leprechaun at the end of the rainbow with a pot of gold and his brains out. And I have good news for you, my hobbit friend. Serious video. This video is going to give you exactly that look. You're probably seeing Trump pump right now and you're skimming YouTube like everyone else and their dog, trying to figure out what coin should I fomo into? How can I make money fast? And there's no shortage of YouTubers giving you endless coin picks and telling you to ape into this and ape into that. But I'm gonna do something better for you. I want to show you how on your own you can find coins that have a very solid chance to 5, 10 at 20x, deliver those red hot gains that you're looking for on your own. Because I'm going to tell you one thing. If you're waiting for coins to hit YouTube, if you're waiting and searching around for everybody to talk about a coin and then find it, you're likely on already too late. And so what I'm going to do in this video is give you my research methods that have allowed us to basically money on this channel. If you've been here the past few months, you've seen us pick coins like super, like Destra, like pin link, heck, even the past few weeks, coins like PI, coins like vertical AI, coins like reploid, that have allowed us to score 5 tens and even a few 20x's cross court, three pointer style over and over and over again. And the good news here is you're not even going to have to leprechaun. You're only going to have to like maybe do it once or twice to get that juicy pot. Okay, jokes aside, we have too much to talk about in this video. And as much as, as much as you want to hear me continue on and make more jokes about banging short little plumpy magics in St. Patrick's Day apparel, we have too much to talk about. Because if you're looking at the market right now, bitcoin just hit 104,000. Trump is pumping and sunking, sucking liquidity out of all the alts in the market and the entire micro cap market, the entire alt market is po to do one of the biggest runs in the history of crypto. This is looking to be the super cycle. And if you know how to look at coins right now, you know how to research and find coins before people get to them. If you know how to read the narratives, if you know the most common movements of altcoins, there is a really good chance of making a ton of money in this market. And while everybody else is fomoing into things late, or finding coins late and pumping into them, you will be the one person who is not fomoing into things. You will be the person that already bought the coins and then selling them to people as they fomo into them. And while I might not be the world's greatest trader, in fact I suck. But over the last five years I've made an inappropriate amount in crypto. Very high eight figure numbers from relatively low investments compared to the amount put in. And what I'm going to do is show you exactly how to do that so you no longer have to be some noob or grubby little me too motherf er who's coming to YouTube and coming to Twitter, getting the sloppy fifths on coins, those lobster bisky, sweaty, stanky low level gains from coins that everybody else has already been in. You will be the person who gets the that moist, grubby little leprechaun first. So without any more jokes about penetrating little people, let's begin. We're in school mode now because I'm going to explain to you how micro cap coins work and how the movements work. And then I'm going to show you my top tactics for finding these things. I'm going to show you how to research them. I'm going to show you the most important things to look at when it comes to the stats. And I'm going to show you how people in crypto move around the markets so that you can find coins before people get into them, so that you can not fomo into pumping coins and pumping narratives. You can see what narrative is going to happen next and you can beat the herd. So let's discuss. So without further ado, let's begin. So the first thing you're probably thinking right now as you come to this video is what coins do I buy? Now look, if you're looking for individual coin pinks and what I think is going to do on the markets, there is tons of videos on this channel. I think AI is still going to be the hottest narrative coming up. There's a video I made last week that is linked below this video that covers everything. I think that's going to happen in AI and other markets. We're not here to talk about individual coins. However, if you're looking to see picks earlier and see things in the market early, I would really suggest following me on Twitter @ZSS Becker, because that's where I'm going to post any early things. I'm thinking I can only make one of these videos like once a week. That's not nearly fast enough for how fast this market is moving. So follow me there. But if you're semi new here, you're probably thinking to yourself, what coins should I buy? And while we're going to focus on the smaller coins a little bit in about five minutes in this video, we need to think about the overall market first. So you probably come to CoinMarketCap and you're thinking, all right, Bitcoin, Ethereum, Solana, all these coins right here. Should I be buying these coins? I'm not saying these coins are not going to run in this market. I think they're all going to do very, very well. But if we look at, let's say, a coin that did very well last cycle at a similar point in this cycle. All right, so let's look at Polkadot. That's sucking big donkey this cycle. But last cycle was a really good example. If we look at it from the early, early point of, let's say January 20th, that's exactly where we are right now. I went from $10 all the way up to $45. Now. I think where we're at in the market right now is very similar to this right here. And I think we're about to see this in altcoins. So this is a phenomenal return. By the way. You can see it went from $9 to $45. That being said, we're not hunting for three 4X's in this market. We're not looking for three 4X's that take the entire market to form either. We want to see much faster returns, much quicker. We want to look for the sleaziest, most scumbag, degenerate gains possible. And if we're looking to do that, these coins right here just are not the coins. They're going to do this. Now again, I'm not suggesting you don't have these in your portfolio. My largest holds in the market right now are of course like Bitcoin, Solana and Avax. I'm all about these. But if you're looking to make money really fast and quickly, which I assume that you're trying to do, this is not where you want to be, which is why we need to start looking at the smaller cap coins. Now, before I get into this, please read the disclaimer underneath this video in the description. I cannot stress enough, your chances of actually making money here are like 2% actually, probably zero. 90% of people in crypto lose money and that includes the veterans and people that actually know what they're doing. If you're just hopping into this, you've never done this before, the chances are you're probably going to lose money. In fact, I think you're going to lose money. I don't think you're going to be able to successfully do this. But you want the information, you want to know how to do it, so I'm going to tell you how. But jokes aside, I'm not going to look at you with a straight face and tell you you're likely going to get out of here alive. You're probably going to be liquidity. If you're new to this, which is the people that get dumped on at the end of the market and read things wrong, there's very little chance you win. So please, if you're getting into this, don't be putting in money that's going to hurt if you lose it. And that's all I'm going to say about that. So please read that disclaimer. It's written in normal English. You can actually read it. And it's not for funsies. It's literally a message from me to you. Please read it knowing that if we want to do very well here, we need to get into smaller coins. So I want to give you, as an example of what's happening right now is I'm going to go look at gaming coins because these are a fantastic example of how I think a lot of the smaller coins are going to run. And I think gaming coins are going to do really, really well later on this market. I don't think they're going to really have their move right now. I think it's probably more in the Q2, Q3 kind of move. So what we want to look for is we want to find narratives before they pump. So if you look right here, this is around when I just showed you once Polkadot was making its move. You can you remember it was about at 10, $9 right here. And so what happened during this time is we saw a little unknown narrative start to kind of get little pumps and stuff like this. And then sandbox, for example, right here, which was one of the top gaming coins, which is one of the top poppy pumpy micro narratives. Last cycle it went from $0.05 all the way up to $7.00, providing returns that were just insane. And so our goal in this video is, look, those three, four X's, they're great, wonderful. That beats stock market returns every day of the week. But every few years, every four or five years in crypto, we get moves like this. We get stuff rolling into narratives like this. And we see 20, 30 X's and in my opinion, semi predictable ways. Because if you looked at last cycle with NFTs and gaming and all, the thing that was shaping up, it was getting kind of pretty clear that gaming was going to be a very hot narrative. And so if you're able to think to yourself and look a little bit two, three months out in advance, what you're able to do is you're able to move into these coins right now. So as you're looking at this market, you're probably seeing, you're probably looking at Trump. This might have been what attracted you to the crypto right now. Or maybe you're just seeing the fact of all the things that this incoming administration is going to be doing in crypto, which I'll tap on here in a second. And you're thinking, okay, do I FOMO into Trump? Do I FOMO these things now with Trump coin in right here? I have to comment on it a little bit because it's the craziest thing we've seen in crypto in a long time. It's at a $12 billion market cap. The fully diluted value is $70 billion. I'm not going to make any calls here because I've seen crazy things happen in crypto. My only opinion is right here that we're going to have to see for a 2X. It's going to have to get to a $24 billion market cap. That is money and that would make it bigger than Solana. And so what we don't want to be doing right now is looking where Everybody is going nuts at. What we want to do is we need to think about what is known as beat the herd mentality. So what does that mean? It's really simple. We have to beat people before something's pumping Trump right now. And a lot of the coins, like Solana right now are pumping super hard. So what do we want to do? We have to think, all right, everybody's fomoing into these things right now. Where are they going to FOMO next? What's this market going to look like in two months? Not what does this market look like right now. What are people going to be reacting like this to in a month or two? That is how we make the big bucks here. And it takes understanding the narratives and the underlying currents of the market, which is what we're going to discuss in this video. So let's talk about where the market is right now and then what it's going to look like in a few months. The biggest thing that's happening in crypto right now is, again, Trump. We see all this stuff coming in and this is where everybody's red light focus is at right now. The herd is right here. It is sucking money out of every other coin in the market. And a lot of people are getting a little deflated because they're altcoins. For example, if you look at, like Destro1, that's done really well for us. You know, these things are dumping right now as people are moving all of their money into Trump. So the obvious statement here is don't put money where everybody else is fomoing and put money where people are exiting, out of or down on. But that would be too simple. And you won't accept that. You want some big, complicated, crazy narrative, and I'm by means happy to give it to you, but I don't think there's really a reason to be deflated here or be bearish on altcoins at all. Because what's happening is the Trump administration is coming in, and with this Trump move right here, at its most basic, like, very surface face value level, this represents that Trump is willing to do some extreme things in crypto. Doing this is. Is. It's wild, okay? If he's willing to do this basic, like, common sense things like making a bitcoin reserve, lowering capital gains taxes on crypto, these things are on the table. And the best analogy I can give you is this. It'd be like if you're talking to a girl and you're wondering if she. If you're gonna. If she's gonna let you get to second base. Lets you cop a feel. And while you're thinking about this, she uploads a video of herself sleeping with 500 guys on OnlyFans. So what does her actions tell you? She's. She's probably gonna let you get the second base. That's nothing for her. That's what this Trump, that's what this Trump move means to me. This is Trump going on only fans and showing his butthole. Of course he's probably gonna let you get the second base and he's probably going to just let crypto go wild. Because if Trump wants these coins to go nuts, which it seems like he really does, the easiest way for him to do this is to ease up regulations, lower tax on bitcoins and crypto and have the United States start buying bitcoin. As soon as that happens, every other country in the world is going to start buying bitcoin and everybody is going to start mass fomoing into crypto because it's going to become the most lucrative, best investment in the entire world. Is this a good or a bad thing? I think long term, yes, it's a very bad thing. I think we're going to see an apocalyptic nuclear crash that's going to leave our buttholes sore for years. But not today. Today we ride gentlemen. And so as he does this, this is going to cause everything to go nuts. Ethereum, Solana, Avax, all these coins are going to go crazy. I could see everything. I see Solana hitting $1,000, Cardano hitting for it guy. It's going to happen and this is going to be terrible for our society. Cardano going to four to five dollars. It's probably the worst thing that could ever happen to American society, period. It's going to make many only fans, girls, billionaires is all the ADA fans, all the ADA cucks start dumping all their money into pictures of tits and butts. The blow up doll market is going to go insane. These fat little grubby leprechaun men and invest in Cardano them getting rich. The worst things that's going to happen, but it's probably going to happen. We're going to see Avax going $150, Sui Shui going, going to a. It's, it's going to be astronomical. We're going to be seeing 20 year olds with lambos and there's me enough blow done in Miami to basically nuke the state of Florida. It's going to be terrible. But from all these gains, what is going to happen is the smaller coins and the other narratives are going to go insane. So we're going to see things that are at smaller market caps in these huge coins go absolutely crazy. So, for example, like Bittensor and AI coins. And by the way, AI is not the only narrative that's going to pump. There's going to be so many other narratives. I'm going to talk about this video that I think are going to do very well. However, it's just the easiest one to pump out. We're going to see these smaller coins, for example, like aos, it's at like a billion dollar market cap. We'll see that do a 10x to a $10 billion market cap if all those go and do the moves that we're talking about. So what is going to happen is after people make all their money on this current move, the Trump and Solana move, and then after people make all their money in these top altcoin moves, which I think is coming next, people are going to say, what's next? Where do I move the money at next? They're going to want to gamble more. And we're going to see crazy things start to happen. First, we're going to see stuff like I just point out, we're going to see the top narrative coins and the top altcoin narratives with the mid and micro caps. Those are going to go nuts. But we're also going to keep seeing stuff like this happen. So for example, if you look at pin link right here, this recently went from $0.03 all the way up to $2.37. This happened in the span of a month. And I think PIN link is going to do super duper well. And I'll talk about RWA and that's another point in this video. But we're going to keep seeing this. We're going to see a lot of new coins also hit the market and do similar moves like this. You can see replay right here went from 9 cents all the way up to $12 in the span of about 15 days. And so this is the type of plays we want to get in on. We want to be able to find these coins like this and be able to detect these coins hitting the market so we can catch these and move in and out of them. Now I think these coins are about to have their second leg and they're hitting their actual Best Buy points right now. I don't think this money going into Trump is going to stay in Trump. I think. I don't know what Trump is going to do this market. And I'm not going to sit here and call tops and bombs on Trump. I'm not doing that. I'm not touching it. I'm just watching from the sidelines right here. Of course, I'm quite jelly of everybody that got in, but if I can make any statement about it whatsoever, is when people take their profits on this, which they are, almost every single person that's bought this coin, every single person that's bought this coin is in profit right now. There isn't a single person that's down. People are going to take their profits. And with everything that's coming in with this administration, everything they're doing, they're not going to take the profits out of the market. They're going to put into something else. And so we have to be able to think to ourselves, what is that something else? And when that something else happens, coins that are already strong, like the coins I talked about right here, are going to get their second and third legs and we're going to see tons of new coins entering these narratives when they pop off. And we're going to see this stuff over and over again happening. We'll see these pops and these pops. And if you can play this, you're going to do very well in the market. So that's what I want to talk about in this video, and I want to talk to you about how to find these narratives. So the first and most powerful thing you need to be aware of in crypto is narratives. So if you've been here for a while, you're aware of this, but you're probably still not applying it correctly. This is one of the most simple things you have to. Simple mind shifts you have to have in crypto to have success. People don't grasp this and they don't apply it, and they look at every other thing other than this, and then they get blindsided. So let me explain. When you get into crypto, you're going to think to yourself, well, I need to find the best tech or the best, the best teams, the best people putting things together. Where's the next technology that's going to change the world? I have been in crypto for five years. I've been hearing about how crypto is going to be a technology that changes the world. And this coin or this project or this thing right here is going to change how the world works forever. I haven't seen it happen once. It's been five years and we still don't use this for anything other than competitive PvP gambling. Crypto for less. I think in the future, the technology is going to be very important. But you have to understand what we're actually doing right here is we're trading Ponzi schemes, we're trading vaporware Ponzi schemes that do absolutely nothing. How crypto works is people see narratives and they see stories that are being told on Twitter or YouTube or what people are thinking, and then they make coins to cash grab in. If you go and look at every single coin, even these top ones right here, nobody uses cardano. Avax is used for gaining gaming. And then when you just go down this list right here, outside of competitive gambling and trading, no one uses any of this stuff for anything right now. These are all just vaporware technologies. And most of them haven't even made a dollar in profit in their entire existence. They don't function. Their coins have no demand or use case. And so you just need to get that through your head. Am I sitting here saying crypto's going to fail and not going to be the future of financial technology? No, I think it's going to do very well in the future. But that's not right now, and that's not. Doesn't matter to us. What we're trying to do here is make money. And so just get it through your head that you're trading Ponzi schemes and you're trading basically stories. And what you're trying to do is you're trying to figure out what other people are trying to think. You're basically playing a game of poker right now. You have your stack of coins or money, everybody else has their stack, and you're trying to put money in stacks before other people put in and then pull it out before they pull out. That's what you're trying to do. And so we're really more playing poker. We're not trading technology or investing right here. We're trying to predict other people and predict when they think the top of something is in and then sell before them. And the technology underneath it, the teams underneath it, everything that's going on underneath it doesn't matter. It's what people think about the teams and a narrative and what's going to move. And so that's a very simple little shift you have to make in your mindset. So what are narratives? Narratives are what people think is going to happen in market or think is very important. So a good example of it right now is AI. Why is AI one of the biggest narratives in crypto right now? It's very simple. Look at Nvidia stock. Look at everything that's happening in technology right now. AI is by far the most overhyped thing in the entire investing world right now. Thus plays right over into crypto. Okay, so what we want to do is we want to look for certain narratives that are going on in the real world and certain narratives that are happening in crypto and narratives that are created by pumps. So, for example, if we go back and look at gaming crypto, which is a really good example, back in the day, virtual assets was the thing. You could go on the Twitter and everyone was talking about holding virtual assets and land, guess what? It's worthless now because narratives, people don't think it's important anymore. Now it's worthless, but people thought it was really important. And I mean, we saw Bored Apes launch and they made $300 million in a day selling virtual land. It is worth virtually almost like one tenth of what they charged for back then. So what we saw happen is we saw Sandbox go absolutely nuclear. And then where the money was made was all the coins underneath it. So if we go look at gaming cryptos right here, all of these went nuclear. Insane. You could hop into anything, for example, like Altura, which is a good AI and NFT coin, I think, is going to do very well as well. We'll talk about it here in a second. After Sandbox Pumped, Altura launched. And so you can ask yourself, what's the hot narrative right now? What are people talking about most? It was gaming. And so after that happened, we saw altura go from $0.01 all the way up to $0.30. Okay. We got into this pump, actually, last bull run, did very well here, made a clean 30x on Altura. And so what we want to do is we want to look at what's happening in the real world. All right? What investments are big in the stock market? What is everybody in the mainstream talking about? Because when people come over from retail or the masses, they're going to kind of mimic what they're thinking in the stock market. And what's hypey over there, AI is going through its dot com bubble right now, going to do the same thing in crypto. Next, we can look at what coins are going nuclear already in the market based on these narratives. Not all the time. Are you going to be able to pick up on a narrative before it happens? For example, I've made a lot of money in AI crypto, and that was far, far from the first person to be in on that. Far from it. Okay. This has been going on for Almost like two years. You can look at what has happened already in the market. So a really good indicator of this was for example, during the bear market, Pepe went to a multi billion dollar market cap. And so this really set the four minute mile for the rest of meme coins. Then we saw everything else like, let's just do chill guy, all right? This thing I think is in the absolute dumpster right now. But you saw this coin go from virtually nothing, it's not even tracked on coin market, it went to nothing to like a billion dollar market cap or somewhere around there, making people 100 x's or 50 x's right there. So you can look at narratives that are shaped by previous pumps and see a narrative already form and then think, alright, I need to be looking for what's next here. And if you can look at these early, you can catch the things later on. What a lot of people do is they get stuck in things so they see these things happen, but then they stick into the narratives they're already in and then they miss these and then they fomo into these late. And so you have to keep a really, really keen eye on these narratives forming. And in the final place you can really find these is having a really good X following. Not to get financial trading advice or get trading advice from people. It's so you can watch them. Because what we're doing is we're trading people's emotions and beliefs, okay? We're trading the stories that they're telling and convince themselves in their heads. And so all we want to do is we don't want to go to X to find individual coins or picks or listen to individual people. Except for me. You should follow me on Twitter at csspecker. Don't listen to anybody else, just me. Because as you probably noticed by now, I'm a generational goddamn talent who makes money from the sky. But on a serious note, you want to go and really follow just tons and tons of people on X. And then what you want to do is you want to skim through the feed and watch them, watch what the gremlins are doing, watch what they're talking about, watch what they're starting to get excited about and you're going to start seeing little trends appear, little patterns. And the way narratives are formed, they start with little, little echoes and then they get a little bit bigger and they get a little bit bigger and then they just go absolutely insane. If you can catch these little echoes and these little whispers down here, that's when you're going to win. And then you have to understand how crypto moves, specifically smaller caps, is like this. There's two movement patterns you have to understand. So first off, way crypto usually moves is bitcoin moves. Then the way it used to work in the past is Ethereum moves. Ethereum hasn't been getting a bid lately, but I think that's about the change. Everybody hates Ethereum right now, which is why I think it's going to pump. But then what happens is in eth, and I'd say eth, Solana and XRP start to move. Then the coins underneath these, which would be Avax Sui Stellar, just this coins down here, these are going to move. And then what happens is it rolls into mid and hot micro caps of the day. And so what we're seeing right now, and what we've been seeing is tons of money moving in the bitcoin. We're starting to see a move down here. I think about the form right now. And then as soon as this happens, we're really going to see these go insane. So that's what I think is going to happen. That's the first thing to understand. And what's going to happen is this pattern happens over and over again. So bitcoin goes up and then starts to decline. The coins underneath it, like eth, Solana, xrp, start to go up and then they decline and then the smaller coins go up and then they decline and it resets because people store their money back in the bitcoin and it goes like that over and over again until the cycle explodes in a ball of fire which kills everybody and puts us all back on food stamps. But we don't have to worry about that right now. The market looks totally healthy. I mean, we just saw the President United States launch a meme coin and go to a $40 billion market cap within 15 minutes. What could possibly go wrong? We don't have to worry about anything being overheated right now. This is fine. This is normal. Investing 101. Take your dick out, put in the pencil sharpener. There's no risk here. But the next thing you have to understand is that when we are looking at these mid micro cap moves, we don't want to look at them in isolation because what happens is narratives get hot and they do the same thing. So, for example, what we're probably going to see is we're going to see AI get hot and then it's going to decline and then we're probably going to see meme coins get hot again. And then that's going to decline, and then we're going to see something else get hot. I think probably RWA Robotics and gaming are going to be the next things that get hot after these. And FYI, if you. If you're interested in Meme Coins and you're really into it, you should be following me on Twitter, because I am dropping my Meme coin sometime in the next month and a half. I'm taking zero income from it. I'm not holding it. This is completely not for my profit. I just think it's funny. And I think. I think it's going to be a huge coin, and I'm just giving away all the coins. So if you're interested in that, you should follow me on Twitter @CSS Becker, because I think it's going to be hot. There's more info on the coin and everything there. That's all I'm going to mention in this video. And you can get access to the coin. You can get it for virtually nothing. Or at least that's what I'm attempting to do with the drop. It's going to be the most fair launch in all of Meme Coin history. And then I'm going to walk away and watch this nuclear bomb go off. If anything, it's going to be hilarious. But this is how the coins move. And so what we're seeing right now is we actually saw AI starting to pump really hard. And then Trump was like, here's my penis. My big, girthy, obnoxious penis. Cancel everything. Here's my penis. By the way, sir, have you seen my penis? And this is really kind of put a cramp, because everybody's exiting their AI coins to invest in his penis. All in all, when people are done investing in his penis, I think we're going to see money roll in the AI and I think it's going to pump super duper hard. Because as crazy as what we're seeing in the market is right now, I don't think the entire market's going to devolve simply into investing all of its money into the Trump Meme coin. Or at least I hope so, because I'm not going to make rent if this keeps up. But I think the money is going to roll in the AI and then we're going to see AI pump super duper hard. And then I think what's going to happen is meme coins are just like, oh, my gosh, what happened to these? This. This used to be the new way to make generational wealth. I think these are going to come screaming right back if we look at, like something like with it's down, I don't know, a zillion percent at this point. Where are we at? It's, it's not down too bad, like, I don't know, 70, 80%, which is fine in meme coins. I think it's going to roll back into meme coins. And then I think what's going to happen is people are going to be like, I'm done investing in bullshit. Let's invest in real things. Which I think is going to be RWA, real world assets, which kind of replace, like ETFs and traditional investing. It's, it's Lisa's story behind it. It's just another Ponzi scheme, like all of crypto. But the story is really good. It's provocative, it gets the people going, which, at the end of the day is all that matters here. I don't give a if the project is ran by lobsters in the ocean and is actually the source of all aids on the planet. I don't care what's going on with the coin underneath it. I just care that people think it's going to pump. So please remember, as I talk about coins in these videos, I'm not trying to find the cure for cancer or some technology that's about to win the Nobel Prize. I just want a nice, efficient Ponzi scheme, as should you. And then when the market's topped up, it's super high, I want to dump all of it and run for the hills, as should you. You should not be looking at any of these coins. Be like, who? This is a long term hold. I'm going to hold forever. That's what we tell the retards to get them to hold coins forever. In this space, all the people on Twitter like, this is a good long term hold. Just hold your bags. I only, I'm only invested in quality coins. Everybody was invested in quality coins last time, and everybody that held all their coins lost all their money. So, please, all the crypto enthusiasts watching this video are going to be hooting and hollering and booing me for saying crypto is mostly just a giant Ponzi scam. But if we're going to make money here and we're going to get on live, we have to at least look at what we're doing and the reality of what we're trading here. We're trading vaporware. We're trading the most silly of silly things. 99.8% of these coins will have no demand in the future whatsoever. They don't do anything. So again, I don't want when you guys lose all your money here in six months being like, oh, Becker told me this was the greatest investment in my lifetime. No, this is the silliest thing we'll ever see. This is Tulip Mania times a thousand. You better hope that you have sold all your flowers here in six months because these things are just. They're worth less than a flower in Tulip Mania. I can sh in my hand right now and generate more value than the things we're trading right here. At least it will have some vitamin content. And if you're on an island dying somewhere, you can eat it and live off of it for a week. And I'm going to really get off this rant because we've devolved into you eating feces. And there's only like two people out of the hundred thousand watching this video that are into that. And I'm not here to satisfy their needs. All right, there's foot fetish channels and other weird sh t you can watch on YouTube. This is this. It's not where you come for that. So back up to it. RWBA is a great investment in the future. I think it's going to roll into that. And I think we're also going to see huge uprising in robotics in the real world. And gaming is probably one of the best use cases in crypto. Of all things that like, aren't a Ponzi scam, gaming crypto is one of the best ones. That's actually not a Ponzi scam, but no one gives a shit about that, like I said. But I think gaming is going to pump very, very hard later this year. And what we want to focus on when it comes to micro cap trading is understanding this is how it's going to play out. People are going to get really crazy about A.I. they're going to say, oh, A.I. is dead. They're going to move back to this. And then what's going to happen probably in a cycle is we're going to see this reset. Everything in crypto moves in a pattern. So if you look at. Let's go look at Sandbox again, really good example. You can see it really did a huge pump from here to here. All right. It went from 0.04 cents to 6 cents. So this is a clean like 20x almost right here. People thought this was the top. Very similar what we're seeing in AI right now. They thought this is the top of gaming. It's all done, it's all out. And then it went down. And people like, gaming's a scam. You should never invest in it. I can't believe I invested it. Everyone else was a f idiot. And then it went up again and everyone's like, oh, I guess I was wrong. It was really good instead. But now it's topped out again, so now it's definitely done at the top. And then it f ed everyone in the ass. It just came in with a gorilla sized cock and left everyone with a loose butthole for years to come. And then it lost everyone's money. So I think we're going to see this in memes. I think we're seeing the same pattern in AI so understand there's rotations. It goes up and down, up and down and up, and then it kills everyone. Now let's talk about a few other tactics we can use when we're seeing these narratives pump. So if we go look at Sandbox again, we're just going to talk about Sandbox this entire video. All right, so if we look at Sandbox right here, when it pumped, you have to understand little brother trades. So one thing we can do very efficiently in crypto is we can't always catch the coin is going to pump. It's like, I don't know if I can help you find the next sandbox. You have to be kind of a fortune teller to do that or you have to be really, really deep in the market. What we can do is we're going to say, all right, so sandbox is pumping. What are the little brother trades to this? It's obviously going to be the infrastructure and the things that support this. Let me break this down. If we go and look at Axie Infinity, this is one of the hottest things was pumping. So there is a chain that Axie runs on. This is where basically it's the platform that the game runs on that then pumps super hard. So if you can see the relations between certain coins, you can predict what's going to pump super hard. So for example, when Solana was doing its initial pump a few years ago, what you wanted to do is you wanted to go and find the oracles and the dexes or the centralized exchanges on it. So when Solana pumped really hard, then radium, the decentralized exchange on it pumps super hard. So when you see the initial moves and narratives don't think, okay, how can I get on the move of this coin? You got to think to yourself, how can I get in on the move of the coins that people are going to move into next underneath the coin. So if Solana gets popular, that means as you can see, for example, Solana just pumped super hard. Radium is pumping harder. Okay, so if we look in the last seven days, it's up 63%. Solana is up, I think 47. 47 right here. So you're going to see the little brother coins moving a lot harder. Now this is kind of late stage when Solana made its main pump. Radium did a 20 30x like out of nowhere. So what we're seeing happen in AI coins right now is here's a good example. Bittensure is basically the AI chain that I think is going to do probably one of the best. Everybody knows this. This is pretty known fact near Internet computer. I'm not here to talk about AI coins. If you want to see my actual coinbase and everything, let's link below this video or just follow me on Twitter at CSS Becker. But if we look at Bittensor, this is probably going to pump super duper hard. And what I'm betting will pump is if we go and look at the decentralized exchange on it. Tao Bot, I think this thing is going to go nuclear. Going to do very well. As soon as Bittensor starts pumping, you can see Bittensor started moving pretty hard and the AI narrative got hot and this went and went up very bigly. So when Bittensor makes its much bigger move, this thing's going to go crazy. And so this is what is called a little brother trade. You need to find what people are going to think is going to pump next. When something pumps, it's going to be the decentralized exchanges of the infrastructure. It's also going to be similar assets. So for example, Akash network pumped super hard. AWAS network pumped super hard. And these are pumping on the news of near render Bittensor. And so what people are also going to do is when they saw Akash pump super hard, a coin desktop that we're really into on this channel, people saw that and what they then said is we'll look at these other AI coins that have pumped super hard. A destroyer could do the same exact thing. And so desperate went from like 02 cents all the way up to 30 cents right now or 49 cents right here. It was actually way below that. This is about when we got into it. So phenomenal Little brother trade. That's another tactic you want to keep in your back pocket. Because again, we're not always going to catch these narratives as soon as they Start. That's really hard to do. Understanding the narrative and finding the little brother trades underneath it, that's not too hard to do. And so the big trade is always catching these narratives first, but you can't consistently do that. The consistent 10 15x trades is this type of pattern right here. Now, the next thing I want to talk about is when we're researching coins that could potentially do this, we want to look at their market caps. So, for example, if we look at a coin that I still like and is in a much better state now than it was last, Burrun is Alluvium. So the best example of this is if we actually go look at Trump, I'll just catch your attention with this. I'm not saying Trump is going to dump or anything like that. I'm. I don't know what's going to happen with Trump. I don't know. But if you look at the market cap right now, it's 13 billion. There are $62 billion worth of coins locked up. This means there's almost $50 billion worth of money in the hands of seed investors or people that got in earlier, the initial people that hold this coin. So as soon as these coins are allowed to unlock and be sold in the market, they're not allowed to. Right now, do you think people are going to take that money? Likely, yes. Yes. If I put a billion dollars in your hand, said, you got to wait till Friday to sell it and then on Friday you can sell it, what are you going to do on Friday you're going to sell it. And so this has a way of smothering coins into disaster prices. So you can see a coin that pumped super hard last run, went to crazy numbers. And then as coins started getting unlocked and got smashed, was alluvium. Okay. And so I like alluvium a lot right now. I think it's gonna do really well when gaming comes around, but you have to be aware of that. And so what we want to look at in coins we're researching is coins that have the market cap dispersion, like Destro. So, for example, like, if I want to. I talked about something in gaming. If I look at a gaming coin right now, it has a really good ftv, like Super Champs is a really good coin that has an absolutely on par FDV with its market cap. If we want to see another coin, it's similar to Destro. For example, you can see hash right here. Its market cap is nearly the same as its fdv, meaning that there isn't some huge insider cabal waiting to dump on you when these coins pump. That's something you really want to look for when you're positioning earlier in these narratives. And then like I said before, and I'll mention one time, you want to look where people are absolutely not prepared for a move. So if you look at like meme coins, that is super down. People hate them. Right now, it's probably time to be buying meme coins. If you look at AI coins right now, the time to buy AI coins was when everybody was in meme coins and everybody hated utility coins. So, for example, when shell guy was pumping, AI coins weren't doing very well and everyone's like, oh, these are a scam, Becker. You should have never gotten these coins. And then all the meme coins collapsed. Everybody bought AI coins and AI coins went crazy. So right now everybody is getting super into. We haven't really even seen the coin moves yet. I think AI coins are going to move and then everyone's be like, oh, AI coins are the place to be. Meme coins suck. Gaming coins. Terrible. And then everybody's going to move in those just like they always do. And AI is going to take a little bit of dip and then reset. Like I talked about next, you need to understand where to find new launching coins. So, for example, really good coin that I still like a whole lot, vertical AI this launched very recently and it went from.02 cents all the way up to a dollar. And then like we thought would happen, the coin cooled off a little bit. So it's in a cool state right here. I'm not going to talk about vertical too much. I like it a lot. What I'm going to talk about is we want to find ways to catch these coins like this. The easiest way is to build a really good follow list on X and then go get involved in groups that are super and deep in these niches. So there's going to be discord channels, there's going to be smaller Twitter accounts that are specialized in these type of niches. And that's where you can find a lot of these coins early. Another place you can find them is, for example, there's things called launch pads like Cetify, which actually just moved into AI coins on top of gaming coins. And what they do is they launch projects. Basically projects come to them and they use it to do the initial launch of the project. I think the last few AI coins that launched on Cetify were like 2010, 20 X's. And so if you can get on these launch pads or just hold the launchpad coins because that gives people access to the launch pad. So you can kind of like leverage the launchpad coins themselves. That's another really good way to find the projects early if you're interested in, for example, like gaming, if you want to get on that. And this stuff really, Neo Tokyo, the NFT project, myself and Elliott trades lead, that's like the capital of crypto gaming. So that's where all investors projects and everybody's sharing stuff in there and there's groups like that in every single niche. I still think gaming is going to do super well. So if you're interested in that, you should join Neo Tokyo. But everybody's going to doubt gaming and fade it until it happens. So I'll just be here to tell you I told you so in a couple months. Finally, the thing I want to share with you when it comes to these coins and you have to understand is how the coins market themselves and how you can predictably get in front of the marketing. So look, you have to understand a lot of the movements and smaller micro cap coins are controlled by social media, they're controlled by influencers. And what you're going to see with these projects when they start out is they're going to launch and what they're going to do is they're going to buy very small influencers. So this is why you want to follow small accounts on Twitter. I don't follow a lot of them because I don't try and get in the I. The amount of money I invest with is 70, 100,000, $200,000 a pop. I don't invest 5k at a time, which is all you can really invest in these smaller projects. But if you're a person looking to make your first million or first couple hundred thousand, which I think is completely unlikely, I don't think you're going to be able to come into crypto and make any money at all. But me for being honest with you, right? That said, what you're going to see is these projects start off and you have to understand these are Ponzi schemes. And a Ponzi scheme starts out small, they don't have a lot of capital. And so what they do is they use that capital to get small influencers to get more people into the Ponzi scheme scheme early. And so when you follow small influencers, what you're going to do is you're going to catch a lot of these projects early. Then you do your research, you look, does the marketing look good? Does the Project look good? Does this match the narrative? Does the team and everything seem like it's good? Keyword seem. You never know. I've seen projects where the team looks doxed, amazing, and then they rug everybody. And then I've seen projects where, like, the team looks like a bunch of orcs ready to invade Middle Earth, and then it pumps the billions of dollars and turns out to be some of the best tech ever. You can't really always tell off this stuff, but what you can see consistently is the projects pay smaller influencers. And if you can catch these smaller influencers, do project, and you can enter these projects early when the very small influencers pump them. And I know what you're thinking. Wait, people are pumping and manipulating the market? Yes, you. This is the scuzziest, scammiest place you could ever invest on Earth. This is just ripe with all sorts of nonsense going on. Did you see what Trump just did? He launched a coin where he holds 85% of it. It's a Ponzi scheme. That's fine. That's what we're doing here. Accept it. Embrace in your heart. Wipe the AIDS and cancer all over your body, look yourself in the mirror and just say, hey, you know what? I didn't turn out okay. I'm a piece of. And accept it. It's fine. It's fine. Stop lying to yourself and telling yourself you're investing in the future of technology. So when you follow these small accounts, you can see, all right, which projects are buying influencers, which ones are doing this crap. And you can find influencers, or the smaller influencers are more connected to the bigger influencers. You'll start to see a pattern. And so what will happen is you'll see this. Projects buy the small influencers. You can catch them then. And then what will happen is the products will use that money to buy bigger influencers and bigger influencers and bigger influencers. And the coin will pump and pump and pump and pump, and you can kind of ride this wave over and over again. So find the smaller influencers. You can find patterns and find the smaller influencer influencers. They're constantly calling coins and shilling coins early to have done well, follow them, copy them, and at least what you can do is you can also watch the smaller influencers and the big influencers and watch what the talking heads are doing and watch what all the people following them are doing and watch the little ecosystem, watch a little goblins run around playing with their dicks and peeing on things and say, I think That I think the chimpanzees are going to move here next and then beat the chimpanzees to it. And then when they're waving their big fake money coins around and buying their Lamborghinis and whatnot, dump on all of them and run for the hills and never come back. It's a fantastic strategy. Now, a few other last things I want to talk about. I want to talk about selling and how not to get absolutely destroyed. So one thing I want you to focus on when projects are launching is if you're new, you're going to think when coins drop and launch the market, specifically if they have a lot of news and hype around them, you want to FOMO into them, like, oh, God, I'm buying it before everybody else. No, you're going to see tons of new coins hitting the market. You're probably going to see like a new Trump coin hitting the market or something like that here really soon. You're going to see a lot of copycats and you're going to think, okay, well, I missed Trump, so I'm going to get on the next one. You're so original. No one else is having that thought. God bless you and your brilliant giant big brain. That's not what's going to happen here. What you're going to see a lot of times is I want to talk about how I got chewed up on one of my actual favorite coins right now. So super is one of my favorite coins. I made a lot of money because we bought it right here in the bear market. But back in the day when Alex was a crypto virgin and all starry eyed, this was the biggest launch by far in crypto. And what happened is the thing launched and you can't see this right here, but within like a minute, like you can actually see right here, it like shot up to like three or like two, three bucks or something. And so I thought, well, you know, the coin just launched. I'm getting early, no one knows about this. So I bought it and then it dumped to like a dollar and I panic, soldier, and lost a ton of money. When you're new to this, don't be buying coins the first day they launch. I know I talked about buying coins early, but what you want to do is you want to see price action like this. Okay, let's look at like repo. It did really well recently again. I still think replay is going to do great. We saw the big initial pump right here. You're going to see coins when they launch and they Sit a few days. You can't actually. Where's. Where's a. This is so hard to see. So you're just gonna have to kind of take my word for it. This is before it hit coin market cap. But you can see it kind of hung out at a low price down here and a lower market cap. I think the market cap right here was like $1 million. And so it hung out here for like a few hours. Okay. You don't want to find stuff where it's pumped to a 50 million dollar market cap within 15 minutes, 20 minutes or something like that. Don't do it. If it's a big, giant, crazy launch, stay away. Find stuff that kind of launches and stealth and then hovers around the lower market caps for a day or two, three or four days. You're probably only going to have days, two days when good coins hit the market and are not super hyped up. That's where you're going to make the money at. So find things underneath that $5 million market cap hovering around there. If it's at a 50, $100 million market cap, could it pump more? Hell yeah, dude. I mean, you could see like so many examples of market where the coin pumped to 50, then went to 200. Everyone's like, oh, it's topped out. Then it went to 500, then a billion. Happens all the time. What we want to do though is find things we can consistently nail. For every coin that pumps at 200 million and then pumps to a billion, there's 50 coins that pump to 200 million and then go back to 100 million. Okay, we want to do and try to be as consistent as we possibly can and take as little risk as we consistently can. This is lower risk to high Reward. Buying a $200 million coin, that's higher risk to lower reward. So think about that. Now, the last thing I want to give you is how to exit these. So like I said before, we're going to see that, that bitcoin, then top 10 coins and then altcoin, our mid and low cap rotation happen over and over again in this market like we've seen in prior markets. So you're probably thinking like, how do I know when it's the top of the market? You don't. You just don't. And so what you want to do is these coins pump is you really want to. Especially as we get into later stages of the market, which we could be late stage now. Like, my best advice to you is like you got, if you're New. If you're new to this and you have invested money, one, if you get a substantial profit, take the money you invested that came from like your real money supply, your bank account out. Just, just, just take it out of the market. It's good. You won. Fine. And then leave the money in the market that you've won, leave the gambling money, leave the house money in the market. So if the market crashes, you lose all your money, which you probably will. At least you're not damaged with your actual finances. You came in the market, you didn't lose anything. Okay? Now the other thing I'm going to tell you is when you just get in substantial profit, just take the profit. Just take the profit. Let's say you put in 10k and you make 100k. Okay? Take, take the money, take this money out, okay? Take the money out, take out the 100k, put 30k back in the market. You get, you take 30k to 200 or 300k. This is all hypothetical, by the way. I don't think you're gonna be able to do any of this. Okay, that's fine. Take it, take it out, Take it out. Take the 300k out, put 100k back in and just keep resetting. Now, is this going to get you maximal financial gains in this market? No, absolutely not. It's boring. People are going to call you lettuce, hands are going to call you a pussy, offer you tampons, all sorts of sh t like that. I don't care. Everybody in this market is going to lose all their money. 95% of people are going to leave in catastrophic loss. Doing this is so much better than leaving with your dick chopped off by leaving it in the pencil sharpener way too long. Just, just do this. If you get any substantial profit in any coin, take the profit. Don't be putting on Twitter. Believe in something. Hold some money. How this f king work out for people who are posting? Chill guy non stop. How'd that go for you? How's it working out? Don't do it. If you get up with a ton of money in these Ponzi scam coins, take your money out. Just take it out. Reset, start over. Because if you keep going and going and doubling down, doubling down, doubling down, you're just going to lose all of it. You're going to get drunk and it's not going to work out. It doesn't work out for anybody. Of all the people that use that tactic and keep their money in the market and keep reinvesting in the market, like 5% of them leave without their heads chopped off. So that's my advice to you. That's how I would be doing this right now. I take profit every single week on my coins right now. I exit probably like 2, 3% of my portfolio every week. And I also, I'm always reinvesting in new coins, in new projects that are coming on the market with some of that profit that I take out. But this isn't the bear market anymore. We're not buying at lows where we want to hold for the next year and wait for the bull market. This is a cataclysmic bull market we're in right now. You got to just be protecting yourself. And I'm not saying ever leave this market completely. You want to be trading it the entire way through. So, for example, last bull market, during this last bull market, on this pump right here, I took profits right here, right here, right here, right here, right here, right here, right here. You want to be taking profits the entire time. And during this time, while I was also taking profits, I was also going back into smaller coins and investing some of the profits, not all of them in smaller coins and scoring other 5, 10 X's, which then I do the same exact thing. I take the money out, put a little bit back in, and keep doing that. And that worked very well for me. Did I make max amount of money as I could have? No, absolutely not. But I left with a lot of money in profit when most of the people I know lost all their money. So that's my selling strategy for you. So that all being said, this is, this is my thoughts on microcap trading. This is everything I put into it. Hopefully this is going to help you a lot in this coming market. This is like five years of dealing in this scuzz, muddy pool of investing. And I wish I'd known this stuff when I first got into it. So, all in all, follow me on Twitter @CSS Becker if you want to see my thoughts on coins, the market and stuff a lot earlier. We're also going to be releasing a lot of news on the meme coin that's coming up. You can get full information of that on my Twitter as well at ZSSpecker and subscribe to the channel and I will see you when I see you. Links to other videos talking about individual coins and stuff in the description. All right, bye."
}