{
    "channel": "AlexBeckersChannel",
    "date": "2025_03_11",
    "transcript": " Gentlemen and the two girls\nthat watch this channel, I'm going to get right into it. The prices that we're seeing\nright now are the best prices we've seen since the FTEX crash. Bar none. Every single altcoin indicator,\nevery oversell indicator on ETH, every fear greed thing is flashing. Bye, bye, bye, bye, bye. Everything is flashing that people have\ncompletely overreacted here and oversold. And so forgive me if I'm not going to give\nthe huge cinematic intros that I usually do with jokes and bustles and cussing and\ncalling you a cuck or something like that. I'm just going to lay out the case right\nhere about what's going on in the market. Why this buy opportunity looks ridiculous. Why the risk looks to not\nbeing exposed to market AK. If you're not supposed to market\nright now, that's the risk. And how I think the rest of\n2025 is going to play out. We got people saying that\nElon's causing recession. Trump is causing recession, all this\nfear and mass chaos and stuff like that. I think it's all kind of ridiculous. I don't think anything we're seeing\nin the price right now is reasonable. I don't think it's anywhere near the\nlevel of chaos or danger that was with the FTX crash where people's crypto\nbank accounts were literally exploding. I don't think this is like COVID\nwhere there's a pandemic that could shut down the entire world. I don't see any of that type\nof actual macro going on here. I see a bunch of stupidity. And I want to talk about why, and unlike\nother videos where I insult and call you an idiot for disagreeing with me. I don't have time to do those spiels\nright now because I don't know how long these prices are going to last. And frankly, just like everybody\nelse here, I'm down a lot too. So I'm not in the most jokey,\nhappy go lucky kind of mood. These markets are absolute garbage. Buying right now feels terrible. I just bought a F ton of crypto\nand it was not a fun experience. It was like licking a toilet seat\nat Walmart, but every single time that has happened in my life. Every time I've had that effect, I\nbought an FTX crush just a tiny bit. I bought during COVID. And every single time I did that,\nit just felt terrible, but that's when I saw the craziest gains. And right now we were able to see\nabsolutely insane returns, not on little mid, low cap gambling coins that are\nsuper risky and always go to zero. We're able to see giant gains\nright now on big giant coins that you can hold for years. You can get generational half\na decade like buys right now. And I realized the amount of vitriol\nand anger I'm going to get for saying this, but it just is what it is. That's what I see in this video. I'm going to talk about what's\nhappening in the market. What I think is going to happen for\nthe rest of 2025, what I'm buying right now and kind of address all the\nconcerns with a Trump recession or whatever the heck is going on right now. And the markets. That's it. If you want to see my views a lot quicker,\nfollow me at ZSS Becker on Twitter. Let's just dive into this. All right, gentlemen. So let's talk about the elephant\nin the room that the terrible, terrible market conditions right now. I'm sure you're sitting here right now. You're looking at your portfolio. It's super down. And if you're an altcoins and everything,\nyou're just totally wrecked right now. I'm gonna address all\nthat here in a second. What's going on in the markets? There's a whole bunch of things we\ncan say that's going on in the markets that caused this crash right here. I think we're looking at a\ntrifecta of things going on here. One. Stock markets crashing. That's the number one thing\nthat's going on right now. Two, obviously the tariff talks\nand everything is slowing down the economy and it's making stocks\nfor the first time not be up only, which is again causing all markets\nto crash right here on top of that. Crypto is falling to that as well. Three, we saw massive overextension\nwith meme coins and a lot of people were completely offsides right there. So they're having to sell and\ntake a lot of losses right now. We're also seeing tons and tons\nand tons of retail being pushed out of the market right now. This is all a little bit silly. And if you look at the underlying\nindicators, this is not like FTX. This is not like covid were whales and\nall the big major people were selling and people with bank accounts were going out. I think this is just a\nlittle bit ridiculous. But we're looking at For all intents\nand purposes, a small detox that's occurring after the four years and I'm\nnot here to blame this on Biden or Trump. I'm not here to do any of that. Obviously, this has more\nto do with trump right now. It does with Biden. Obviously, the economy we saw last\nfour years had to do with Biden because if you look at the last four\nyears, it was just endless amounts of Faking it to make it everything\nin the stock market was inflated. But if you looked at the actual underlying\ndollars and everything, uh, people were not doing well in that economy. And we basically saw a falsely\nstimulated economy under Biden for four years, just endless printing and this\nmanipulation of stuff to make things go up and make asset prices go up. Because that's what\neverybody want right there. Now, what we're seeing in the Trump\nadministration right now is they're reeling in about a lot of things,\nwhich is hurting the economy. It's taking it off the drugs and steroids. I don't think this is going to give\nus a huge, crazy long term recession. I think this is going to cause a big\ndip like we saw when Reagan took office. And I think we're going to see\na lot of up only from here. I'm going to explain why in a second. But if we're looking at everything\nright here, the real star of the show, and the thing that we really want to\ntalk about is going to be a theorem. Because what we're trying to see here is\nwe want to see, Alt season and everything that we're going to see and where we're\ngoing to get our biggest gains at is going to be in the alt coins that I'm going to\ntalk about in this video and the alt coins that we always trade on this channel. I think from these lows right here,\nAI coins, RWA coins, and potentially gaming coins later this year are\ngoing to deliver an absolute insane returns, but I'm not going to talk\nabout this in the video because they are so down low and they're such, I've\nmentioned them so much on this channel. There isn't much reason to\ntalk about them right now. I want to talk about\nthe overarching thing. That is going on here and really, if\nyou're a beginner or you're kind of new to crypto or something like that, you\ndon't need to be dabbling in those coins. You can do really well here with a\nbig giant coin like Avax or something. So everything that we need to happen\nright here depends on aetherium and what we're just seeing with aetherium and\nbitcoin in the overall market right now. Let me just bring up a few things. So the reason why I'm just stupidly\nkind of bullish here is if we look at just a few basic indicators that pop up. These are not going to be the end all\nand everything and the make or break and what's happening in the markets. And you can't always rely on these things. And that's not what\nI'm trying to say here. I'm saying I've never seen a point\nin the last couple of years where every single indicator is flashing by. So either we're at what we usually\nsee or what we've seen at the FTX lows in the COVID lows where people are\njust being ridiculous or we're about to see the next Great Depression. Yeah. I'm not thinking we see the\nnext great depression here. I'm not thinking we get world war three. That's just where my bed is right now. And if you look at, for example,\nthis chart right here, all coins are at the most ridiculous lows. This oversoldness that we've ever seen. Now, a lot of these charts that I'm\nshowing you right here, I'm going to show you were taken about a week ago\nor a couple of days ago before the crash that we're seeing right now. Most of these charts are down. Down in the dumps, like down to this\nbottom red line that we're looking at right here showing that these were\nalready flashing by like a week ago, they are flashing deep by like put your\nliver into it kind of buys right now. And if we look at another thing,\nthe fear and greed index is actually at about 15 right now. And we're seeing similar fear slash\ngreeds That we saw again during the FTX crash during the COVID crash, and\nwe're seeing the highest level of fear. That's not at 38 right now. It's about 15. We're seeing the highest level of\nfear we've seen in a couple of years. Well, every single altcoin\nindicator is flashing. Deep red oversold by. So there's only again, two things\nthat are going to happen right here. We're going to see the next great\ndepression, or this is just a really damn good time to buy. And if we go and look at what\nwas happening during FTX and COVID, this is nothing like that. If you were around during FTX,\nyour bank account got blown up. If you were invested in Luna, which\nwas one of the biggest coins in market, Luna literally went to zero. This would be like, I don't know. And if you stored all your money on\nthat chain, because it was basically a place where you could store money and\nget passive APY, all that got nuked. Then FTX, where people kept all\ntheir money, exchange money exploded. It found out it was all massive fraud. Then every other type of\nbusiness like that block fi. Celsius, just where people kept their\nsavings in crypto all got nuked. Everybody lost all their savings. This is nothing like that. People are just like, Oh, tariffs in\nthe stock market's finally topped out. This, I don't, I don't get it. So when I see these indicators right now\nwithout FTX, like apocalypse happening, I just have to, I have to buy here. I have to be like, okay, let's go in. And I know a lot of people are upset\nright now because coins aren't doing well. they've Gone off course. And you know, I'm going to\nbe frank with you right here. I definitely totally miscalculated ETH. When I saw Bitcoin going 108k and I saw\nTrump get the presidency, I really thought we were going to get an ETH all time high. That's just what it was. I did not see a world where we\nhit 110, 000 Bitcoin and not get an Ethereum all time high. If you look at every past cycle,\neverything we've ever seen. In crypto. This was just the, Hey, you know,\nBitcoin hits 110 K. Eventually ETH is going to have its run. That was prediction. We did not get that. And if we're looking at the four\nyear cycle and everything we've seen in the past, we're just\nsimply not seeing that anymore. It's, it's different now. The, the, the dynamic\nhas changed in some way. And we're in a very\nunpredictable market right here. The thing I want to point out\nthough, is I don't really get people being super duper upset here. Because of this, look, I get being\n70, 80 percent down on your coins. That sucks. But what you're going to see constantly\nin crypto is charts like this. Okay. When you get up on coins. And you're riding them to\ntheir best sell points, which I don't think we've arrived at. I don't think we're going to see\nthe best sell points on all coins until we have an ETH all time high. And I have really no interest\nin selling any alt coins, any mid caps until we do that. That's why when Trump won the\npresidency and everything, I took a little bit of profits. I sold a good chunk of my\nportfolio, but not much of it, not a huge proportion of it. And obviously the best strategy\nthere would have been to turbo dump my entire holdings. But that wasn't the thesis. And that's not what I think. I don't think we're at\nthe best sell prices yet. Again, we need to wait for a theorem to\nget to its all time high, which I think is going to happen this year still. But again, backing up to the original\npoint, if we want to get to our best sell prices, here's just a typical\nchart to just put this perspective. Uh, I stole this from Wiz on Twitter,\nbut there's a thousand and one charts encrypted to look just like this. If you want to get to the best\nsell prices, you're going to have to hold to volatility like this. You can see this coin went up and\ndumped 80%, went up, dumped 80%. And this is a big, well known coin. I'm not going to name it because\nit really doesn't matter. Cause you can see this chart\neverywhere, all over crypto. I pointed out before dumped 80\npercent then went and did it's big giant gains right here. What I think we're seeing right now with\nour coins is we got up a little bit. We are down right now, but what\nwe're really waiting for is the ETH all time high where we're\ngoing to see gains like this. And the bet, the thesis was never,\nHey, let's take profit when the market's lukewarm or we're at\nlike our middle sell prices. We want to get to the point where\nETH has an all time high and the market's looking really good. We haven't seen that. And I think right now we're at\nthese type of lows right here where people are just being ridiculous\nbefore we have a big run up. And if you want proof that this can\nhappen, just go look at the COVID dip. Go look at. The FTX crash and look at\nhow those things recovered. You have to understand. Yeah, it does suck to be down\n70 percent of your coins. We have to realize that. All right. So you can see that these coins can\nreplace those downs in a couple candles. You will, you'll see that all your losses\nwill be recovered in one to two weeks and then it will double triple from there. You can see this isn't\nuncommon at all in crypto. So I just have to remind you of that. A lot of people are just not seeing\nthe overall picture with crypto and remembering how these things can move. Now, what we're seeing. With stocks and everything right now, you\nknow, I'm not going to tell you when we reverse or we go back up and I'm not going\nto tell you this is the bottom right here. I don't see us going to 1, 000 Ethereum. I just don't. I see us going to a 6, this year, though. So to me, it's just like the risk\nto reward here looks ridiculous. But going back to what we're actually\nseeing in the markets right now. I'll see Trump. I don't know if Trump's crashing\nthe markets on purpose or not. A lot of people are saying that's what\nTrump is trying to do because they want to think that someone is up there\ncontrolling the strings at the top. For all intents and purposes, let's just\nFrickin say that what I think is happening is we're having economic detox right here. We're getting out of an economy That\nwas based on endless fluffing up On printing of dollars and government\njobs and the government throwing money at stuff to artificially pump\nthe markets and make assets go up But everybody else get very poor if you\nnotice the last four years Assets and everyone own assets got very very rich. Actually, they didn't\nget rich inflation wise. We kind of treaded water Uh, if you look\nat the stock market and everything like that, if you were just holding S and P\nand stuff like that, which was up 10, 15%, you really actually didn't make money. You just kind of went with\nthe base layer of money. Everybody didn't have assets got\nextremely poor the last few years. This wasn't really so much a bull run\nthe last couple of years in assets. It was more so assets just\nmaintaining the absolute craziness. Inflation. We're saying, and of course we saw\nbull runs in some other assets. I'm not saying we did not. Yeah. I'm saying it's not like a bull run\nwhere we saw the dollar maintain its value and then the stock market going up\nin relation to the value of the dollar. We didn't see some crazy warrant there. Now, what I think we're about\nto see is that type of bull run, because what we're looking at. If you look at inflation data right now,\ninflation is just absolutely crashed. The stock market is crashing as well. What does this mean? It means that the Federal\nReserve is going to drop rates. And I, I look at Trump and I, I see\na guy, it's pretty egocentrical. He's pretty vain. And I think takes the stock\nmarket price personally. There is absolutely no way\nonce he gets rates down and the ability to play with the money\nprinter with a low inflation US dollar, which we haven't seen since COVID. It's been almost five, six years. We're going to see the printer come on\nand we're going to see low rates and we're going to see free money return. I don't think people remember how\ncrazy pre COVID was when you could get loans for essentially for free. What this means is you\ncould just get free money. Just that was it. And not only was the money free,\nthe inflation on it was very low. So you could literally just take\na crazy ass loan and then put it or loan the money out again. And all sorts of hoopla and\nnonsense was going on right there. And it all came to a head. And if you want an example of how\nextreme it can be, look at what happened after COVID when we had\nlow inflation and then they turn the printer on the markets went insane. Of course, this led to high inflation\nagain, but I do not see Trump not. I see him just pumping the\nhell of the markets after this. There's no way he's going to let them\nstay low and people say, Oh, it looks like Trump messed up the stock market. I think what's happening right\nhere is we're going to get lower rates and he's going to be able\nto turn on the printer again. And then all hell is going to break\nloose in the markets in a good way. Yeah. And so looking at this right\nnow, here's what we see going on right now. And here's just why, like, I don't\nsee this being a bad by point. In fact, no, I see it being the best by\npoint because here's what we're seeing. Here's why I just can't\ntake this seriously. What we're seeing in crypto right\nnow is a lot of retail flooding out. We're seeing a lot of people that\nhave held for less than a year or a lot of smaller holders flooding out. Now, as we're seeing this happening,\nas we're seeing all this panic and absolute fear going on, we're seeing more\nBitcoin being acquired than ever before. And we're seeing Trump and\nBlackRock and institutions buying more ETH than ever before. So, like, it's kind of I just can't\ntake it seriously when I see people that are the typical short term traders\nthat have no business and are not very rich, uh, flipping out and people have\nheld Bitcoin for less than a year, selling all their Bitcoin right now. And then when I see BlackRock and the\ngovernment and everybody else buying it with the reserve and everything launching\nin a healthier macro than we've ever had before, I just can't take it seriously. Forgive me if everybody's\npanicking and freaking out right now, and I can't relate to you. Maybe I'm just fucking nuts or something\nlike that, but I just don't see it. So looking at what's going on right now,\nmore Bitcoin eats being accumulated while people are panicking and spazzing out\nright here, the stock market crashing, uh, in combination with the tariffs\nand everything, knocking it down and this allowing, uh, Trump to then get\nlow rates and get access to the printer again with low inflation dollars. I see a crapsolutely crazy bull market\nshaping up here and I see huge giant returns from these lows that we're at\nright here specifically in all coins. I see us getting that eth all time high. And I see everything slingshot\nand charging back because we're at prices right now. They're just too damn juicy\nto turn up or turn down. So if I'm looking at the\nmarkets right now, look guys. I think you can just take a dart and\nthrow it at any mid caps or low caps and all coins, uh, that relate to AI or RWA. Those are going to perform really well. if you want to go look at coins,\nI think are going to do like 10, 20, 30 X's realistically from here. Just go through my AI and RWA\nvideos that are on this channel. I'm not going to talk about those coins\nbecause you can just throw a fucking dart. And the only challenge there\nright now is probably being able to hold down another 30. 3040 percent from these places, which I\ndon't think is hard to do after the amount that we've been down right now I just\ndon't think that's very challenging to do but not everybody wants to do that That's\nnot their cup of tea and I don't know if this is the absolute bomb in those and if\nit's not we're probably going Down another 30 40 percent which is going to be ick. But again Like you have to come\nback and you have to look if you're in any of the smaller all coins or\nmake caps that We're in right now. You have to understand how these damn\nthings move Like, it's not, we don't get from here to here and we don't\njust go up in a straight line from the bottom of this chart to the top. What we do is we do this whole\nlollygagging where you lose 80 percent of your bag multiple times\nand unless you're swing trading it, which you're not, I'm not, you have\nto be a talented trader to do that. No one watching this channel is that. Including me, you have to be\nable to hold to this stuff. So you just have to, you have\nto just take it with this stuff. I see AI coins and RWA coins. We're using doing exactly this, especially\nif you get that ETH all time high. So speaking about ETH, let's talk\nabout the big chunky alt coins. So looking at this right now, of course we\ncould just straight up buy ETH right now. Phenomenal buy point right here. This is that the same almost\nprices that we saw during FTX. Like, let's go back to when\nFTX happened right here. Like right here is the FTX rush. Like we're not that far away from it. We saw it got down to like 1200 for a\nsecond, but we're mostly Hubbard at was about 1, 500 ridiculous, ridiculous. Okay. You have to understand inflation\nrage past this point too. So in terms of inflation, we're\nprobably almost at these points. We're looking at like eight, 6 percent inflation during\nthese time periods right here. So one, keep that in mind. Now, if we're going to go look at any\ncoins can buy guys, like the entire world is your oyster right now. We're looking at Solana, probably an\neasy four to five X from right here. We're looking at Cardano easily\nat a four to five X right here. We are looking at chain link. Going to negative. This thing will not pump. I don't get it. It is the best coin in crypto, whatever. I'm not going to tap on that. We're looking at AVEX at\nan easy 5X right here. We're looking at SUI at\nan easy 6, 7X right here. We're looking at DOT. HYPE. ONDO. Tao. I mean, Tao is an\nexcellent price right now. I'm hurting with my buys a little bit\nearlier this last few weeks, but I think this easily going to a thousand Arboretum Quant Near The most beautiful thing that's\nhappening right now, guys, is look, usually to make a lot of money in\ncrypto, you're going to have to get down into the smaller, the smaller\naltcoins, the mid caps, the low caps. And those come with a lot of risks\nbecause holding them, you're probably going to have to hold them down 60, 70\npercent to get to the all time highs. You're very rarely going to\nbuy those things and not eat 60, 70 percent dips on them. They're very hard. They're challenging. And a lot of people\naren't able to do that. A lot of people that got in during this\nlast year, this whole meme coin craze, they are down on their coins right now. And trust me guys, I'm down on my\ncoins too right now, but you have to come back to that chart I showed\nyou before of how these things move. And if you're not prepared for\nthat, which is like literally what we're going through right now,\nyou're going to be in a lot of pain. You're going to be upset all the time. You're going to end up selling\nat lows and you're just going to have a really bad time here. There's no chance, almost no\nreality where you buy those coins and you ride them to their best\nprices without some crazy turmoil. I mean, you could do that. I've seen it happen before at some\npoints, but the odds are exactly what you're going to see right now. Now, I think those coins are at\nthe craziest by points right now. And if you've watched this channel\nfor a mandatory, you know, the AI coins, you know, the RWA coins,\nyou know, the gaming coins, and you know just the general infrastructure\ncoins that we're looking at. But the cool thing that's happening\nright now is you don't even have to play in those coins right\nnow, which I don't advise anyone. It has less than a couple of\nyears experience in crypto to be playing with those because you\ndon't understand what's happening. The reason why people are so upset\nright now is they don't understand how to buy and sell those coins. And so they get into them. When I say, These are for experts. You have to be able to prepare to\nhold through these crazy things or be Comfortable selling without somebody\ntelling you when to sell That's why a lot of people got burned with meme coins\nbecause they don't know when to sell on their own They can buy just fine,\nbut they don't know how to sell coins And again, I haven't taken big sales. I'm not sitting here being like well,\nyou should have sold like me No, i'm super down with you guys because I\ndon't think we're at the best point yet that said back to my original point\nYou don't have to even do that right now because we're looking at huge giant\ncoins like Avax, Ornir, or Ondo, or Cardano, Solana, like you can just get\nfive 10x's on those coins right here. And if for some reason we don't\nget a bull market anytime soon. You can hold those coins for years. I don't think Cardano is going anywhere. I don't think Solana is going anywhere. I don't think Avax is going anywhere. Ondo near a lot of those coins. I mentioned Tao BitTensure. These coins are going to\nhave new all time highs. If it's not this year, it's\ngoing to be within years. So it's like you're looking at a free. Score here. That's what I'm looking at. And I think I, look, I'm going to catch\nmassive flack for this because I've been bullish all the way down because I don't\nthink we're at the best prices yet. I still don't think we are. I think we're going to see the\nbig bull run later this year. I think we're going to get the alt season. We all been talking about after\neveryone is absolutely given up here. But the risk right now is not\nbeing exposed to these prices. this is like you walk up to Vegas and\nI'd say there's a 60 percent chance that we have a bull run this year. Let's just take it down to 50, 50. We walk up to a table in Vegas and if\nyou lose, it's a 50, 50 bet red, black. And if you lose, you only\nlose 40, 50 percent of your cash on these bigger coins. Okay. Maybe we go down 40, 50 percent more. If you win, you get a five to 10 X and if\nyou do lose and you just hold down that 50 percent and then hold to say, okay, shit,\nI'm going to hold for two to three years. You still get that five to six X\nalmost, in my opinion, guaranteed. don't go bet your house on that. Read the disclaimer below, but\nthat's my viewpoint right here. So if I go and buy a million dollars\nworth of Solana right now, and I have to write it down to 600, 000. Or I go buy right now. I go buy a couple million dollars with\nand I have to hold it down another 50%. I don't see a thousand or\nhappening, but God forbid it does. I think we're still going to\nsee that all time high sometime in the next two to three years. I don't think you can make many\nbetter investments than that. So that's why I'm sitting at, because\nthe risk right now is that the market We covers and that we see these mid\ncaps and these higher altcoins go crazy. For example, during the FTX crash, the\nrisk was not being exposed to the market. Solana was at 12 dollars. If you just went and bought any\naltcoin during that time, you made a 10, 15 X on some of the biggest,\nchunkiest, safest coins in crypto. The risk at that time was not being. in the market, like so long at 12. So at these other prices or Cardano\nat 10 cents or wherever it was that wasn't risk right there. The risk was not owning those\nthings and being cut off sides and everybody getting rich without you. So that's where I think\nwe're at right now. Just looking at all the things we're\nlooking at every single old coin indicator is flashing bright green. It's all flashing by. We are seeing the government\nsupporting crypto. We are seeing the biggest money\nin the entire world stacking and stacking crypto right now. While the short term people on\nchain are dumping like crazy because they got overexposed and\noverexposed themselves to risk. Could we go lower at these points? Sure. I mean, I could see Bitcoin going\nall the way down to 60, 000 or something like that, but at this\npoint, like you just keep buying. I know you don't want to hear that. I know people don't like that. They're like, Oh, well, you know. Crypto influence bullish all the way down. But what you do is when the markets are\ndown and they're being scary, that's when you buy, that's how you make money here. If you're not a talented trader,\nyou're not a person who can swing in and out of this stuff. Your best bet in this market is to buy\nwhen people are losing their absolute shit and then hold for a very long time. That's where you can get the edge at. You can get the edge by\nbuying fear and being patient. And everybody's going to\nhate me for saying that. Oh, bullish. Bullish. He was bullish a week ago. I'm going to be bullish all the way down. Because I don't think these\nare the highs for crypto. I don't think this is the top for\ncrypto in the next two to three years. I think that's fucking ridiculous. I think, the recent high of a\ntheorem at like 3800 or whatever it was I don't think that's the high\nover the next two to three years. Do you? I don't think has topped out\nover the next two to three years. Do you? I don't think Cardano has topped out\nover the next two to three years. I don't think we're not going to see a\nbull run in the next two to three years. And I don't think the price\nis worth seeing right now. Are anywhere even remotely within\nthe universe of the future all time highs we're going to see. So I just I'm willing to be patient\nhere and I'm willing to buy the fear. I'm willing to be bullish during the\nfear, and I'm willing to write even a little bit lower because I think\noverall, no matter where we buy. As long as you're in this range,\nthey're going to be excellent prices over the next couple of years. So that's my two cents on it. Sorry if this isn't the most funny\nvideo, but I didn't have time to write a script or be creative with that. I just wanted to say what\nI had to fucking say. And um, I've said it. So I'll see you in the next video. Follow me on Twitter at ZSS\nBecker for faster updates. That's all I got guys. See you soon."
}