{
    "channel": "AlexBeckersChannel",
    "date": "2025_04_26",
    "transcript": " Look, I'll shoot straight. We all know you're retard. So you probably see crypto pumping right now. But what you don't see on chain is positions that blackrock, the trumps and some of the biggest whales are taking in certain coins right now that are signifying a giant, stupid Kim Kardashian ass sized pump in certain industries in crypto right now. And even scarier is the massive dump that it looks like they're going to trigger shortly after these massive gains. And I was going to make some big video, big intro showing the six pack. But I have to rush up dog today because if you have any hope of taking positions in these coins at super low 1020 realistic 20x prices from these entries, this info is going to be irrelevant in a couple days. So I have to reach deep in my nether region and just throw this at the wall because people that see this are going to be able to take positions that are nice, cozy and comfortable. Because if we bull here, these are going to get into immense profit here very quickly and then you'll just be able to ride them out through the rest of the bull run. And if you don't get into these, you're going to have to take massive risks that are just going to open you up to that massive dump I talked about earlier because they're going to pull out of these just as fast as they pull in. So I want to show you is what is happening that's going to trigger this massive pump and then where these pumps are going to be at the specific industries, the specific projects I think are going to lead this. Let's talk about it now before I show you these things. Quick warning. Subscribe like this video here is why I literally set it up so that people that subscribe to my videos see these first. Second, my meme coin is still dropping as soon as eth hits a certain point which I put on my Twitter. But the coins are going to be given to people on the white list and the be on the white list to get preferential treatment. I can see who's like these videos. I can see who subscribe. Very easy to scrape with AI these days. If you are subbed, you're a frequent liker, you're going to have preferential treatment on that white list. So do that right now. I'll give you a second. Smack the like button. Okay, let's get into it. So look, here's what you're going to get in real short order and I know you're looking for specific coin Picks the specific projects. I'll get that in a second. The first thing we need to talk about is this pump and why it's happening. You probably don't understand why I'm going to make it crystal clear and what it actually means. And then I'm going to break it down with the on chain data that is showing something way bigger here. You need to see this, because the right people are getting into the right things. All the big money's moving over here, and all the wrong stupid money that usually FOMO's in at the wrong time, they're all sidelined, setting us up for a perfect situation where this market's gonna pump super hard for us and then we can dump everything on retirees and old people and run for the hills. It's a perfect setup. Thanksgiving's gonna be awesome. This year, all of grandma's money will become your money. Grandma. She doesn't need to be going to Dubai. She doesn't have to fund six only fangirls colleges. You need it more than her. And then I'm gonna answer your what are the chances that we actually see a bull run right here? And then finally, what are the niches that are going to run the hardest? And yes, what you came for. What coins are going to run Now? I'm going to cover some coins, but there's little tiny ones, little secret ones I think are going to do crazy numbers, but I guess can't throw them out there on this video because as you know, I'm extremely famous. I am the biggest, the most widely known, the best jawline in all of crypto. So I'm going to sprinkle these throughout the video. You're just going to have to pay attention and you're going to have to actually consume the educational content I actually make to help you not absolutely lose your full D all the way down to the shaft, the balls in the pencil sharpener of Risk and fomo. That is crypto. So without further ado, why the are we pumping? What's going on here? All right, so quick review of what just happened. Going to be quick with it because we got to get into these coins. Some of them are already starting to move like Pango, which I mentioned on Twitter is why you follow me on Twitter, point it out at Lowe's. It's already 2x from here, but we'll talk about that here in a sec. So look, let's review. I'm sure we all remember this huge dump right here and everyone's been calling a new bear market or Whatever. Now look, last video when we were down here, I was telling you to buy it up. I'm not taking this seriously. But before I claim too much clout, I know you think I'm a God. I know you know I'm the alpha, Poppy. I know you literally don't make a single buying or selling decision without checking the feedback of the tri state orange eating champion. But to confirm all the haters, I've been telling you to buy every single one of these crashes all the way down. Every single one. And why? Because what I think we've seen here is extremely similar to what we saw right here. Now if you look at the chart, this is the 2020 run right here. Now if you look before the 2020 run, we saw a lot of massive run ups. We saw bitcoin do a 3, 4x right here, we saw 8. Literally do a 4 or 5x and then repeat and give back all the gains just like we just saw. And what I think is happening right here and a lot of people are going to call me crazy for is I don't think we've even seen the bull run yet. I think we saw some deformed, mutant freak, inbred retard cow get loose in the pasture and start running around. And it had like fake antlers on. And everyone's like it's a bull run. When really it was just some meme, coin circle, sweaty orgy between all the crypto traders currently in it. And then we lost all of our money to some fat kid in Argentina. I don't think that was the bull. I think it was some retard, muted, inbred cow. I think we had to put it down, take it out the pasture. And people were really disappointed because they were waiting for the fruit, the true big bald bull to come around the corner, but instead we got the cow from cow and chicken. And if you're a connoisseur of culture like I am, you remember that is one stupid looking cow. That's not a bull. That's not what we wanted. But real note, I don't think we saw the bull. And I think this little rebound we, this last month or so, couple months of chaos was exactly what we saw Pre Bull 2020. I think what we saw with the tariffs was the market looking for a reason to dump in a similar way to Covid. But unlike Covid, unlike the dumps we saw prior to 2020, what the was everybody doing? All signs are pointing to crypto having a phenomenal year. And NBC news and CNN just Started telling everybody like Trump turf's gonna cause a recession and this time we decide to all suddenly believe them. Like I was telling you this entire way through, I was buying eth Cardano everything this entire way through because I just couldn't take it seriously. This is why I was saying buy every single dip because I think if we go and look at the prices. Let's go look at bnb. This is my comparison that we're going to use for a lot of runs because it kind of shows altcoin behavior. I think any prices we buy in altcoins are going to be just like this in bnb. If you look at this chart right here, I can't zoom in far enough but you're going to see bnb taking huge 10, 20 X's right here and then dropping 80, 90% just like we've seen in altcoins. And the reason I'm saying buy, buy, buy, buy. And I've been saying buy, buy, buy in all these situations because I don't think we've seen anywhere remotely close to the alt climb. Altcoin highs. I think what we're going to see later this year is going to make the all time highs we saw last year in altcoins look like ant poop. It's going to look like a cardano holder's dick. Just very unthreatening and only operable with tweezers. But that's fine because even Cardano holders are going to get so rich in this run that even they can get laid. You 5 foot 2 neckbeards that make up the 90% viewership of this channel, you have a chance. You're not going to have to have the six pack. You're not going to have to have the big bu like the most woke. You're not gonna have to have a jawline, it cuts through steel. You're just gonna have to show chicks in Dubai your big bank account. They're gonna drop only fans immediately move on to your yacht and you're gonna spend the rest of your days watching the paying other men. It's gonna be a dream come true. A real Dubai chic royalty kind of experience. But on a flip note right here a lot of people have been giving me a lot of shit. I'm like buy eth this entire way down right here, like I don't care. I'm buying an 1800. I'm buying at sub 2000. I'm buying all these prices right here because I think it is almost a surety that we see eth return to an all time high. Here is why. If you look at the on chain data right now, the accumulation we're seeing on bitcoin from institutions and now just giant whales is ridiculous. We are seeing people buying in billion dollar almost clips. We're seeing blackrock eat this up. These are the people that control the earth. We're seeing the Trumps buying, we're seeing giant whales buying. We're seeing more whales being created than ever before. And we're seeing the exact same things on eth. Now look, riddle me this, here is what we're seeing. We are seeing the smartest money that controls the entire world buying this up. And if you look on the flip side of this, we are seeing retail completely out of the market right now. This is absolute peak lows of disinterest. This is bear market lows of interest in crypto right now. So we're seeing all the people that consistently make the wrong choices out of the market right now. And we're seeing all the right people who make all the good choices and control literally everything. And if you look at Donald Trump and the way this administration is working, they like to pump the market and they like to dump it. They like to buy it up and they like to pump it again. There is some will weird going on over there. I overall like the Trump administration but this stuff is absolute shenanigans. This is Chuck E. Cheese levels of operations. Fraud is now legal pump and dumping on grandmothers is encouraged. And if we look at all of this right here, this entire dump that was just created, it wasn't created by some crazy disease or something like we saw in Covid. Like during COVID we saw Eth go from $257 all the way down to like I think $110. At its at its lowest point right here it looked like it was over. It looked like the world was ending. What we just saw right here is like Donald Trump playing with a lever up and down. He can fix it at any time he wants. While we're seeing more money sidelined than literally ever than ever. As we are also seeing the global M2 skyrocket, aka more money entering supply. Just like we saw in Covid, everything here lines up. The little four year timing of it, the exact patterns we saw before last run, everything on chain, the people buying everything lines up with a big giant bull formation. And so your big question before we actually talk about the industries and things that are going to do well, what are the chances we bull? I don't know. Every other channel out there is going to give you certainty and some big clear picture, like they know what's going on because they want you to buy their call signals. I'm going to tell you I'm a retard. I don't know. My strategy for the last two years has been buy alts when there's fear. We did in 2023. We did it whenever we saw big dips last year we did it when we saw this big dip right here. And we just buy those alts and we hold them until we see that E ethereum all time high. Because what is going to happen? It's just like 2023, it's shaping up right now, but I think this is the big one. Let me explain. See, in 2023, end of it, what we waited for near the end of the year was bitcoin to confirm its run. Okay? So if you remember right here, I was being a real jackass during this time and being bearish as hell, saying, I'm going to wait till bitcoin confirms and then I'm going to buy alts. And everyone's like, you're stupid. You're stupid. Yes, I know that. That's why I use stupid retarded people strategies that work for retarded people. I don't want the advanced trading strategies. I don't want the Black diamond advanced trader calls. I want to be able to buy and comfortably hold it and then sell it at huge prices without thinking too much. That's what I'm trying to do here. So if you're looking for the big brain tactics, this ain't the channel for you. And frankly, let's be straight, are you really that talented to make those type of moves? You're not. We're all not. This is the channel for the 95% of us that needed a purple crown. We need the Patrick Starr type strategies. And so when bitcoin confirmed right here, okay, this is when I started going, all right, let's buy all the alts. Okay, so you can see we have this confirmation right here around November. But if we went and looked at alts, for example, super, which we made an insane amount of money in, you can see during this November period right here, they were still at their lows. These were the lows on alts. Now I'm just using super right here as an example because I love super. I think it's the best coin in gaming right now. But the point I'm going to make is you're going to see the same exact pattern in almost every single mid cap or altcoin outside salon in this time period. So we got in right here. Here we wait for bitcoin to confirm. Bitcoin was pumping, pumping, pumping right now. I said, okay, time to buy alts. Vroom. We made crazy amounts of money in this time period. Now we've given a lot of it back, but we're still up a lot on these buys right here. Because our goal here is to buy from these lows in these lows and then hold till ethereum all time high. And what we're going to see then is a formation like this. So I'm using BNB as an example for alts right here because this was kind of like the trademark behavior of all old. Last run you saw the same exact thing. We saw BNB go from like almost $30 all the way down to $10. An 80%, 70% loss, like massive. You're holding it right now. Everyone's like why on earth are you still holding that stupid coin? That's because when we see the ETH all time high, we're going to see this crap happen in alts. All the stuff we saw before this. Any buy point you probably made in the last year or so, especially at fear lows like right now in 2023 and some of the dips we saw in 2024. It doesn't fall matter if they're in loss right now, it doesn't matter what they're doing because this is the future that we're going to see. If ETH breaks all time high, which it looks like it's going to do, everyone, all the big money is buying eth, all the banks and everything's moving over to it. Stablecoins are being adopted, NFT technology is starting to be used. What the are you thinking being bearish at any point during these tariffs or anything like that, it's insane to me. So to answer your question, do I think we bull? I don't know. If I had to give you betting odds, I'd say 60, 40. You think, well that's not very sure. Yes, but here's the bet. Gentlemen, before we talk about these industries and niches, here's the big pornographic fantasy I want you to envision. If we go, if we go and we do bull here we see a bull run, we're going to see these types of gains on our altcoins. These are 5, 10, 15, 20 X's. Realistically, please, for the love of God, read the disclaimer. This is financial suicide. I don't Know what I'm talking about? You should not invest in crypto ever. Don't even invest more when you're willing to lose. You're going to lose all your money. Everybody loses all their money here and then gets really angry. Don't do it. Just don't do it. Please read the disclaimer. I put it in perfect English. There is phenomenal risk you are taking here doing this. This is financial gambling. This is not investing. If you want good responsible advice, there's plenty of good investing channels on here. You are looking at a guy sitting in a gay bar dressed like a pink Japanese schoolgirl who has mentioned masturbation in the word retardation at least 52 times in this video so far. I am not at fault right here. If you lose your money, it's your fault. I put it completely in purple crown below this video in a very well written disclaimer. Please read it now. If we do both, we're going to see these type of move on alts. Now if we don't bull, here's what's going to happen. You can see the worst case scenario right here is already played out in a lot of these altcoins. We are already down 60, 70, 80% on altcoins from the recent highs last year. If we do not and we go bearish right here, you could expect to lose another 50%. I think if we're going up to a roulette table in Vegas and there's a red black betting situation but red pays out 30x and if you lose you only lose 50%. I think that's a phenomenal bet. So I am taking that bet. I'm letting the roulette ball spin. I don't know where it's going to land but I know the bet returns are ridiculous. That's why I'm taking the bet. Please understand it. I don't want anybody quoting me Saying Becker said 100% we're going to bowl from here. No, Becker said he doesn't know what the is going to happen but he thinks if we do bowl we're going to see phenomenal returns. So that in mind, where are we going to see the phenomenal return? I'm going to get into some big chunky coins right now and at the end of this video I'm going to give you a list of all the really small juicy coins that are going to do the crazy numbers. But they're really high risk. I want to get into the things that most people should be looking at by most people. No One should. You should never buy crypto under any circumstance. But I'm speaking to an audience of heroin addicts right here, telling you not to try the latest new form of crack cocaine. I know you're gonna go do it, so like it. You know, here's the best drug dealer in town. That's what we're doing right here. But I'm gonna try and give you the drugs that are least likely to make you od so that when all you newcomers right here come and shove this crap up your ass trying to get highest foot, the death toll is like, I don't know, not as bad as it could be. But I'll give you the stuff that will help you OD at the end of this video. So stay tuned as we get through that. So where do we start at? Right here. So the one thing I do want to point out before we talk about this is if you look at the search volumes, the views on crypto, YouTube, not just my channel, but all channels are around, everything is basically a bear market lows right now. Like this is. This is probably the hardest time to be releasing content in crypto.1 because releasing content in crypto is the equivalent to rubbing battery acid in your eyes. Dealing with you people and the crypto audience as a whole. I'd rather stick a cucumber covered in sandpaper up my butt. But as you know, this is a very gay channel, so that's technically something I enjoy doing in my free time anyways. I don't stick cucumbers up my butt. Not. Not since I was like, not at least for years. I haven't done that. Not. Not ever. All right, so look, crypto has no attention right now. And usually you can gauge crypto markets by the attention that's going on on YouTube, Twitter and everywhere else pretty accurately, for example. So when you start seeing these videos getting millions of views, you better just start running for the hills. Like the second I start to get popular, it's the number one indicator. You should just dump everything immediately. So the second we're busting out 800,000 views a video, you should sepuko you bags, sell them to your grandmother, move to Dubai, because your grandmother is going to kill you afterwards. So what's going to blow up? What industries are going to blow up overall? Decentralized finance is going to go crazy. Now, what is the centralized finance? It's really just all the big coins. Like, so, for example, I really like eth. Everybody else hates Ethan. I get why people hate eth right now, and I don't think you're going to see the biggest returns on ETH. I think seeing a 6,000, $8,000 ETH is totally possible here, but woohoo, that's like a 3.4x. With that being said, I think ETH is a pretty sure bet, but I think we can have a bull run even if ETH doesn't perform well. If we see Solana take off, we see Cardano take off, XRP take off, and Ethereum really starts to fall behind, which I don't think is going to happen. We're still going to see an alt run. Okay. We're going to see Bitcoin, I think probably charging to 150, $200,000. I think we're going to see massive FOMO in it with everything that's happened in the world. So myself, if you're just like a big giant investor, I have a huge amount of my net worth in Bitcoin. I have a lot of money in eth, but I'm not looking to make giant returns on it. I'm looking to double hold those for a long time. So those are how we treat those things. If we're looking for the big gains, here's where we go. So I think Solana probably could do a 5x from here. I don't like Solana that much because I think the coins about to mention are just going to outperform it. I think Solana is going to do great. I don't think you're going to go wrong holding Solana. I think Meme coins are going to do stupid crazy returns on Solana and that's going to drive the price up really high on Solana just like we saw before. I'm not really in the meme coins because they are hard to trade despite their appearance of being easy beginner friendly things. It's by far the hardest, most riskiest form of crypto to get into, the hardest to read, the hardest predict, and the most dangerous when it crashes because the coins don't come back. A lot of the times we want to find coins that if they crash, they're only going to crash like 50, 60% which sounds like a lot, but that's not a lot in crypto and coins that will be here four or five years from now if we want to be safer gamblers, safer drug addicts here. So where I would start at and perhaps one of my biggest altcoin bags is unfortunately this makes me want to pour battery acid in my eyes again. But it's going to be Cardano. Look it breaks my soul to give the tip of the hat to these 5 foot 2 neckbeard cuck McFluffs live under their staircase while other men bang their wife. Harry Potter motherf ers the Cardano community. But I think this is probably gonna be probably one of the top performers. I think this is probably gonna go to like 4 or $5 and we're going to see a clean 5, 8, maybe even 10x on Cardano. I think we're going to see crazy numbers on sui. I don't really own any SUI because I don't really actually understand what it does. I don't care. But everybody's talking about and it has crazy hype behind it. You can see this thing is always doing the biggest moves. And so if I was a wise investor I'd probably be buying sui. I am not. But I think it's going to do really well. I think Avax is going to chase up with Cardano. I think you could probably see similar Cardano like gains on Avax. I think it's going to be the leader for crypto gaming which I think is going to be a massive narrative later this year which I'll talk about here in a second. I think Dogecoin is going to do very well. I think Hype is going to do very well and I think Ondo is going to do very well. That's kind of falls into the RWA niche that we'll talk about here in a second. That's what I would be kind of building my portfolio with. If we want to get really basic just get a bag ol big ol bag of Ethereum, Solana, Cardano, maybe some Sui. If you're feeling risky Avax, you're going to do well there. If you, if you're just like brand new to this and you don't know what the is going on. I don't see you going massively in loss if we don't bull right here from that bag. But I also see you making some really solid returns from these because these are still near their lows. For example, if we go look at Avax right here over the last year we we bought them at $9 when we were buying in 2023. So this one we got a lot of Avax on this channel. Got all the way up here, got up to about 450 bucks, about a 5x. Now we're down again the $22. I think we're going to go well past this all time high to 100 bucks. 150 maybe even $200 on avax if we get really thirsty. So that's the kind of game we're playing with these coins right here. If we don't bull, we're probably going right back to like $9, $12 on this thing if some something crazy happens. So that's kind of the same exact story with all these, these kind of coins right here. You're not going to go bankrupt investing these things, but you're not going to make like the crazy fortune teller gains on there. It's a good place to be. So what places are going to do very well? I think the best places to be looking at right now outside of Meme coins, like, I think Meme coins are going to do the biggest returns. If you're looking for the crazy X's, those crazy dream chain crypto stories, those 30 x's in a day kind of stuff that's going to be in meme coins, but those are so wildly unpredictable and they crash super hard. So for example, like we're going to look at Shill Guy right here. So if we go look at Shill Guy, this thing went up to like a market cap of a billion buck or $700 million, and I was down to $31 million. And I don't know if it's gonna come back. The reason why Meme coins are so dangerous is yes, you're gonna see these type of returns or these type of gains on Meme coins, but it's so hard to predict which ones are gonna do that because one, it's a lot of just insider massive trading. So you have to be on the insider club to even know that. And even if you can predict them, it's wildly hard. Like you pick 20 of them and like one of them does this, other ones don't. And then if you don't sell at the right time, you lose all your money. And I don't think Chill Guy is coming back. It could. Someone could quote me on this channel, make a video when this pumps to a billion dollars and say, look how stupid Alex is. I know he's incredibly handsome. I know he's extremely famous. I know his six pack has made me have gay fantasies despite myself assuming that I'm straight, which you're not. You watch this channel, there's a tinge of gay in you. Just admit it. But I don't know if Chill Guy's coming back. And this situation right here was really bad. And so if you're like anywhere near beginner, are you just like, this is not where I want to Play at this is too hard. So that's why I'm not really getting into meme coins. I will mention two in this video, but that's where I'm going to stop. So where I think you need to be looking, if you're finding a middle ground of gains and risk is it's going to be AI, it's going to be rwa, and I think if you're being clever, it's going to be NFTs and community coins. I think gaming coins are going to do very well. But later this year and I'm not going to get into that narrative so much in this video, I'll get into the top gaming coins that I think are going to do great. I do think that's going to be one of the top return narratives. But it's a little bit more of a think about it. It's kind of more of an active trade. So I'll talk about those, but let's just get into this for a second. So where would I be starting at? And again, at the end of this video, I'm going to get into the really dirty coins again. Give those crazy gains in these niches. Just hold tight. Okay, so where would I start at? If we're getting into AI, here's where we want to be looking at. All right, Top bitcoins. So I would go, I really like near, but I think the top performing coin is going to be tao. And here's what's going to happen. AI, I can give you the entire narrative, but at the end of this video, there's going to be a link to an AI video that breaks down everything going on on AI, the tech behind it and why it's going to pump. I'm not going to do this in this video because we're in a hurry and frankly, I know you don't give a shit. Like, you just want to see what's going to go pumpy, pumpy big bags, pump and dump on grandma and run for the hills. I get that you're not here for the tech, neither am I. I don't give a shit. I just want to get rich really quickly. Actually. Keyword rich. Er, very quickly. At the moment I'm like yacht rich. But I'm not spaceship rich. I'm trying to get spaceship rich here. What I think is going to happen in AI is I think Tao is going to do a crazy move to like a 10 billion, 8 billion something crazy. It's going to join the top 15 cryptos and that's going to create this narrative throughout all of AI for all these coins below it, driving them to crazy numbers. And AI is by far the hottest narrative in all investing right now outside of crypto. And I think it's about to get 10 times hotter because what I'm seeing, I work in tech, I built software companies. That's where I make most of my money. This is my immature 16 year old side job. This is my embarrassing degenerate habit that I enjoy partaking on on the weekends. And first off, why the is fart coin listed as an AI Big data coin on coin what the coin market cap. What the f. What does a coin about farts have to do with AI? We're gonna see people come on here like, oh, I went in with a AI application of ass gases. What are you doing? What intern is running your f. Cking list. All right. You combine all together the things in the narrative I've talked about AI. I think that's going to drive Tao to crazy numbers and I think it's going to drag everything up with it. So where I'd be building my portfolio would be Tao. By the way, the last couple months I've been telling you to just buy all of this right here. And you can see the crazy gains we've seen on Tao from these points right here. I was also buying, telling you to buy 2023 so like you'd be sitting really fat if you just put your dick in the pencil sharpener just a little bit. But whatever. I think this is going to thousand dollar market cap. I think it's going to do great. So if I'm building a big kind of lower risk, this is all massive risk, but a lower risk, massive risk bag and AI. I'm going to start at Tao and then I'm going to go and grab aos. This is some. This is probably one of the bigger chunky coins on here. And then I'm probably going to grab. If I'm looking for the really high returns with like Russia roulette, like Risk, I'm going to go for Destro. Now there's a lot of other really good ones on there like Pal Oxo. I think zigchain is really phenomenal. But that's also kind of ties into the RWA list. Echelon prime. Really great these prices right here. But if I'm building a bag, that's where I'm going to start at with AI. If y'all want the juicy ones, they're going to do those 2030 X's that's going to Be at the end of this video now RWA coins. So we recently saw ALM go and commit massive seppuku. Now that wasn't like a big bag of mine or anything like that, but it is a little bit irking seeing one of the top RWA coins just completely rug. Fair warning to you. Like if you're in crypto and you have a bag of 20 coins, three, four of them are going to just go to absolute zero and turn out to be run by goblins from Mordor in Middle Earth. They're going to look all professional and great and then they're going to unveil the back room and there's a bunch of like one foot tall dudes with neckbeards that go down to their crotch, just mouth breathing, all sweaty, covered in Axe body spray, running the project. Everyone's gonna go f and it's gonna go to hell. So just be prepared for that. That's just part of it. This is the biggest space of scammers, bullsh tters and degenerates and none of the coins actually do anything. It's essentially just all Ponzi schemes. This is what happens when you go and bang 20 hookers in the back Red light district of Amsterdam. You're not gonna walk away with a clean bill of health. Health on every. It's just how it is. All right, if you don't want to catch a big flaming case of herpes, maybe don't prostitutes. If you don't want to see coins get rugged. If you don't want to see investments go to zero, maybe you shouldn't be in crypto. You so please understand that. So where I would start an rwa, I think anno is going to do super duper well. Especially because people are a little bit hesitant on these top RWA coins because of om. I don't think Ondo is a scam. I hold a lot of ando. But I'm going to tell you right here, there, there's. You never know. But you can see even I'm a little bit irked off by aam. I think on those gonna do super duper well now if I'm continually going down right here, there are so many good RWA coins that are open right now. The reason why RWA is gonna pump is because it's basically taking everything in the real world like houses, stocks, real world assets. That's why it's called Real World Assets Coin and converting them and putting them on chain. This is a massive narrative for BlackRock and every major investment Institution almost as pumpy dumpy as AI. So where I would then also be going is RWA coins are really down right now. I really like Clearpool. I think Maker and Vechain will go great. Those are, those are kind of where I would be hanging out if I want to be safe. And if I want like the, the best kind of destro like coin on here, I would pick pin link and then I would go with zigchain. It's not listed right here. But Zigchain really ties into AI. It really ties into rwa. And so I think Zigchain is, is probably one of like the secret winners right here in rwa. I think it's going to do phenomenally well. So that's where I'd be doing if I'm doing RWA coins. Now the other place I want to talk about is blue chip memes and community coins. So what are blue chip memes? I'll tell you what I mean by that because it's really simple. I think fart coin is going to do stupid. Well, I don't look, don't, don't buy off of this. I am so bad at picking meme coins. Like, don't do it, don't do it. Don't listen to me on this. But I think fart coin is going to do stupid well. I think it's going right back up to its old market cap and I think this is like the chosen meme. I think Dogecoin is going to do stupid well. And my leading bag in memes and communities and NFTs is actually going to be Penguin. Okay, I told you guys to check this out and I realized it took a big dump from the top right here. Okay? That's what happens when you have the biggest brand in NFTs. Go and drop a coin. It's going to do this kind of stuff right here. But I think Pudgy Penguins has so much potential for a lot of different reasons. First off, the branding behind it is generally like it's the new Mickey Mouse. I think this is going to be like the hello Kitty. In the real world, you're seeing Pudgy Penguins, massive penetration, deep, girthy, moist penetration all over the world right now and actual toys and stuff like that. It's so damn well run. Luca, the founder of it, I think he's probably one of the best project runners and all of crypto right now. Very impressive young man. They just know what they're doing. He took this balls to earth, bought it and has turned it into a giant thing. And I don't think that's going to stop because he's a psycho. I bet on him all day. Third, I think it's probably going to be one of the best NFT collections to own. And so it's just wonderful. And then Pengu ties into communities, it ties in the video games, it ties in the memes. I think we're going to be going back. I don't maybe not to the all time highs right here because they are pretty large, but I think we're going to see some really, really good returns on Pango. So that's probably my top meme coin. If I'm going by what I hold, I also hold Fart Coin. I think it's going to do stupid well. Buy, buy the Ask Gas coin. It's obviously an AI now. I mean, according to Coin Market Cap, this is a leader in AI. We got to get Jensen Huang from Nvidia on stage to talk about his Taco Bell farts because apparently it ties, it ties into this. Now that's what I think is gonna do really well. And this is gonna be my last crazy call. I think NFTs are gonna make a huge comeback now with me mentioning Pudgy. I think, I think Apecoin has a chance of doing something really good right here. Apes are still very powerful and they still got so much money in the bank. I think we see really good returns on Apecoin. I'd pick Pengu over Apecoin, but if we want to hold both, there we go. And if I'm looking at NFT assets, if you're rich, okay, don't. If you're not rich, don't. Don't go buy a $73,000 pixelated picture of a person, okay? But if you are man, cryptopunks, get a cryptopunk. Get a pudgy penguin. I think our NFTs at Neo Tokyo are going to do stupid well because gaming is going to pick up. And that's the only NFT projects that's leading the way in gaming right now. Like the only one, the only community that's tied into all that I would get in Neo Tokyo. But I'm not trying to pump my project too much right here. I think, I think it'll just speak for itself in classics like Fidenzas and to some extent maybe Beeples. And I think Apes are going to make a comeback as well. I would be grabbing those. I would be grabbing at least some small pudgy penguins. They're lower version on these and if you're a smaller investor, you can grab the S2 NFTs from Neo Toki. You can grab the smaller versions of the pudgies. You can grab the mutant apes and dog pound NFTs from apes. Those are going to also I think do very well. Are they going to give the 30x's you're going to see on on some of these coins and some of the juicy things I'm about to talk about in the smaller projects? No, but I think long term, I think punks and like penguins definitely some of the best long term investments you can make in crypto, especially from these prices. Now onto the really juicy stuff. The crazy dumpy crazy pumpy dumpy oopy doopy retire your entire entire family AI coins and RWA coins. Those are gonna be in this video right here. That's about the pop up. Will pop up here in a second second. On top of that, before you go and watch that video like and subscribe. If you are subscribed to this channel, I set it up so subscribers see these videos first. Obviously crypto is a zero sum game. You need to be first to the information that's this is how you're going to see it. On top of that, subscribe and like, because I can see everybody subscribed and the people that are liking the most, you are going to get preferential treatment and early access. Because I'm rewarding my most engaged followers with white less access to my meme coin. Again, I'm not making any money from it. We're just releasing chaos. I'm taking zero of the coins. Finally. Follow me on Twitter CSS Becker. Because I can only make one of these videos once a week. Usually once every two weeks. It takes a while to make them. You don't want to be getting content exclusively from this video. Follow me on Twitter because that's where you get the moment to moment updates. That would have gotten you in the Pengu, that would have gotten you in a Tau. That would have alerted you with a lot of things that I've done that have done very well. Super duper early to the minute. Okay. Check out these AI coins and everything if you want to get really high. This is the crystal meth, the jacked 3D, the axe body spray. Sweaty game earners that you've been probably looking for this entire video. I will see you next video. Actually this is the last video as this thing pops up. Little real, real moment. This is our last video in this studio. Never again. The Jiu Jitsu Gay Bar studio is being retired because I am moving. So take it. Take it in. I guess the studio where we've been delivering you that low quality shit, terrible content, it's being retired. So take it in and I'll see you around. Bye, candy people."
}