{
    "channel": "CBinthegame",
    "date": "2025_05_15",
    "title": "Crypto Gaming Woke Up… These Altcoins Are Next!",
    "video_id": "cJdUGOwGbbg",
    "video_url": "https://www.youtube.com/watch?v=cJdUGOwGbbg",
    "transcript": " had the biggest crypto gaming token launch of the cycle by far with the Maple Story token going live and currently trading at about $2.5 billion. Now, it's been a long time since we could fairly say that the crypto gaming niche had a catalyst that could potentially send certain coins higher. But I do think that this valuation could potentially repric a couple of strong gaming assets as we see Maple Story trading at 2.5 billion. I do think there are a lot of undervalued gaming projects that we can take a look at for potential gains during this time period as today specifically crypto gaming has the ball in their court. And I think these few tokens in this video have a good chance to pump if this thesis does play out. So, let's go over everything you need to know in this video about Maple Story as well as the token launch and then I'm going to give you guys four tokens that I think benefit the most from this launch. So, without further ado, let's jump into it. And as always guys, drop down, hit that like button, and subscribe to the channel for more. Every single day and every week here on In the Game, we have you covered from all the latest news and alpha in crypto gaming, AI, memecoins, and more. And of course, you can check out our sponsors down below in the description. And if you need a place to potentially trade the new Maple Story token, Blofin has already listed this down below in the description. And you get a sign up bonus whenever you sign up for Blofin. 100% no KYC, very good track record on deposits and withdrawals. Definitely check out Blofin down below and you can get a sign up bonus whenever you sign up with the link in the description. Let's just jump right into it as obviously we are looking at the next space token which is the official token of the Maple Story ecosystem. This today is currently launched and now sitting at a $2.6 billion valuation whereas you know I I think a lot of people underestimated how big this token and IP actually was moving into web 3. We recently saw the token launch and it trended down to a close to like $500 million FTV. But this is such a big IP in Asia and we're going to go over the team's track record and there's no surprise that this has done so well. We're going to go over everything you need to know about Maple Story and then we're going to get into some coins that I think could repric higher due to where this token is currently sitting. So, let's just jump right into it. Obviously, this could be the beginning of a little bit of a surge in the crypto gaming space. I think there's no secret about it that crypto gaming has been a little bit disappointing this cycle. And if we said anything otherwise, it would be a lie. We have a few outstanding winners. You know, stuff like Off the Grid and a few others have really done well this cycle, captivated a lot of attention, but we just haven't seen that run into gaming tokens that we saw 15 months ago whenever Mavia and Pixels came to market or when Big Time came to market. Obviously, nothing compares to the gaming run of 2021. But right now could be the time where the president has now been set where a quality game comes through the market. $2.5 billion fully diluted market cap. It is genuinely one of the biggest launches of the entire cycle. I mean, this is Maple Story has just made history for this cycle as far as gaming launches, sitting as an individual games IP with Maple Story at $2.5 billion FTV. And the fact that it's sitting above that $2 billion level, it is safe to say that this is the biggest crypto gaming launch of the cycle. Let's just kind of move into it. If you're not familiar with Maple Story, they have over a 100red million players lifetime. This IP has been running since 2003 and this is operating on the Avalanche blockchain. They did give a really big airdrop to gamers which I think is really strong. Like actually the play to airdrop here ended up being pretty lucrative. A lot of players got between 3,000 and 5,000 tokens which at these current prices is upwards of $10,000 which is a pretty crazy airdrop just for getting involved early and playing this game. And just some backstory, if you haven't seen, they released in 20 uh 2003. They are 22 years old. 250 million registered players, 5 million plus monthly players, and 5 billion lifetime revenue, which is just absolutely insane. You can see their revenue numbers over the last decade have just continued to grow. And then on top of that, we just see the fact that you can jump into the game. The game is now live. And I've always thought this recipe works, right? you come out with your token on the same day that you come out with the game. I think that that is a recipe for success. You can play the game, earn Nesso and convert it into the next space token or you can play the game, grind items, sell your items in the marketplace and earn the next space tokens. And if you've played some play tests, you are eligible potentially for the airdrop which has currently gone out as of today. And I believe you have three months to claim your airdrop tokens. So, right now, like this is proving to be one of the biggest events that we've seen in crypto gaming in quite some time. And I do think this could cause some waves and bring some money into the gaming market. We see Maple Story was on CNBC and I believe this was um in Asia, but they were on CNBC Singapore yesterday talking about blockchain games and how their company is entering blockchain. And it's a president because they're not a company that needs blockchain. If you looked at those revenue numbers, I mean, they're just steadily increasing over the course of time. This is a company that did not need to come to blockchain, but they see blockchain as a powerful enabling technology in the background to elevate player experiences. So, this is absolutely bullish. And over this weekend, I'm also going to put together everything you need to know about playing the game as well as potentially earning tokens inside of the Maple Story ecosystem. But, we're going to get right into it. I mean, in this video, I don't want to sugarcoat anything. I want to keep it very straight to the point, short and sweet. And I think that's what you guys are looking for. As look, once I come out with this full game guide and how to get in, how to earn, and all that good stuff. I think there's going to be a lot to dig in as far as the intricacies of the economy, the gameplay, how the token fits in. That's going to be some fun stuff. But as of right now, we are seeing a lot of attention on the timeline and liquidity. Look, 2 billion in trading volume today alone on the next base token. And it did start off really high. Like at some points there was a wick up to a crazy valuation, but it's been hovering pretty healthily around this $2.5 billion level all day. And given the fact of how many airdrops went out, how much potential sell pressure could be out there, this token is holding up quite nicely. And on day one, there's already 17% of the token which is trading live, which I absolutely love. And if you go in, you can see here the next unlock isn't until February 14th of 2026. So there is a 9month cliff. You can see where these tokens got distributed. And you can see all of this information by the way guys on Nexus Nexace Nexus. And actually later today we should have a pretty big update regarding our trading. You will be able to potentially as of today start trading on a decentralized exchange leverage on crypto and stocks which is going to be absolutely revolutionary as far as onchain equities and stock trading. So you can check out Nexus down below. We have all the latest information as you can see here as far as token unlocks, vesting, everything you need to know to see that this token could make it through the bull run and even go higher if the valuation holds here. And then on top of that, if the sentiment around gaming picks up, clearly Nexpace has been one of the biggest winners, it's going to be one of the biggest attention grabbers as well. And the Asia markets gravitate towards this IP quite heavily. So definitely something to keep our eyes on that this could be a category leader heading into the peak bull of this cycle. But right now, I think there are four high cap tokens and two low cap tokens that I'm most heavily isolated on right now. Now, I want to preface this. I this does not mean that I'm not bullish on other things, okay? When we look through the gaming market right now, Ronin I still have very high conviction in, but Ronin's not associated with this current launch, right? This is operating on the Avalanche chain. For example, Beam, like it has AVAC ties, but I don't necessarily think Beam's going to just rocket because of Maple Story. like I I think that there are tighter plays and then there's also individual gaming ecosystems out there that I just think are going to have a really good run if that money does trickle into other products. Now we can look at some coins and be like, \"Okay, this is undervalued versus what Maple Story is valued at.\" So, let's jump into it. Number one, pretty simple, Avalanche. Now, it's not that Avalanche is undervalued, but Avalanche has literally been one of the biggest winners of this entire cycle. And you can't really argue that, but the price action hasn't followed suit, which is kind of annoying. Like, we have called out all year that the network effect on Avalanche was going to be super strong, but sitting at 23 bucks, we haven't really seen that big move yet. It was at 25 as of yesterday. Little bit of a dip today, but nonetheless, Avalanche has literally dominated 2025. They are the home of the two biggest gaming projects in all of crypto right now, Off the Grid and Mapletory. their L1 activity as far as individual L1s continues to climb. The culture around Avalanche is massive this year. It's just taken so many steps forward and I think the price will catch up sooner or later. So number one to me is Avalanche. It's just the host of so much activity and then with off the grid going into mainet their L1 activity is going to surge whenever you see off the grid and Mapletory operating on an Avalanche L1 at the exact same time. So number one first and foremost is Avalanche and maybe Avalanche Eco. So I would stick Beam as like an honorable mention here as it also is an Avac L1. Number two, this is a simple one and I mentioned this at the beginning of this video. So if you caught that, you already know this will be one of the tokens, but Guns from Gunzilla. I I think the offthegrid token is massively undervalued. And then we just look at the scope of look, it's 5x undervalued Maple Stories token right now. Now, not to say that that's not justified. Look, Nexon and Nexpace and what they've done in the gaming space for the last 20 years definitely warrants the fact, okay, they do so much revenue. That token deserves to be trading at about a $2 billion valuation. I am so shocked though that right now we see the second biggest game in the space trading at 20% of the valuation of this token. So I think personally that guns deserves to trend up towards that billion dollar level. So absolutely the Gunzilla token is my number two bet here behind Avalanche. I think this reprices higher. That's just simple. It's the second biggest game in crypto and they launched at a pretty bleak time in the market. And so if money comes into the gaming space, I think they're going to see Godzilla as a great catch-up trade potentially to eat into some of that market cap and inch a little bit closer to the valuation of something like a next space. Now moving into the next two, two very established individual game ecosystems that have taken pretty good dips and I think the opportunity now on these coins is pretty heavy. So number one is Echelon Prime. You guys know I love Prime. It powers the parallel universe from everything from Parallel Colony trading card game, their blockchain with B uh yeah with B3 and then we also have their upcoming firstperson shooter. So they're tied into so many different elements. I think that Prime is so undervalued here and at a market cap of 456 million on the fully diluted. It's another one that I wouldn't be surprised to see this start trending back up and towards that billiondoll fully diluted level whenever the market does start kicking money into these other gaming tokens. And then last but not least on the high and really we can get into low caps here. There are three low market cap tokens that I'm really isolated on right now. Number one is Pirate from Pirate Nation. Now we don't talk enough about this token. I do think that Pirate Nation is by far with the proofof play ecosystem. They're one of the best overall teams and games in crypto gaming and it's sitting at a $19 million circulating and a $62 million fully diluted. This by far deserves to be trading over a hundred million fully diluted market cap and I would not be surprised to see this trend up towards those levels. The next one here would be Xorg. I think that Xorg as an infrastructure play that's tied into so many levels of web 2 gaming on top of the fact that they have the Swissborg backing. We see here they just recently announced this 15,000 uh dollar tournament with my pet hooligan and that circulating market cap at 17 million is absolutely criminally low. And then if we look at the yearly chart we're looking at a token that in December was trading at 40 cents currently at 10 cents. I do like Xorg and Pirate as far as low market cap tokens. And then last but not least, you guys know I love Moon Tropica and they have a big catalyst coming up on the 31st. Now, usually some of these things have buy the rumor, sell the news and leading into the game launch, you might start to see Moon Tropica pump and then have a little bit of a pullback. However, look, this token at $9 million fully diluted or at and a fully diluted of 15 million. They have such a culture. The token is so hot and whenever this token heats up, it does like a 100% in a week, no problem. So, to me, those are the seven tokens I am most focused on. That does not mean that I've gone and sold my Superverse for these. Like, I'm still holding my entire gaming positions because overall, if the gaming space gets a little bit of a stimulus here and a little pump, our bags are going to be looking good. But at the same time, those are the plays I'm isolating. I like Gun, I like Avac, Prime, and then the low market cap stuff. I like Pirate, Moon Tropica, and Xborg. I think those are the six tokens that I am most closely eyeing with an honorable mention of Beam because it is also an Avalanche L1 product. But monumental day in crypto gaming today as we do see the next space token trading at over a $2 billion valuation. I want to know your guys' thoughts. Do you think this could bring a little attention back into the gaming space? And then on top of this later this month we have off the grid going to mainet. people are going to start speculating and we see here some of these asset prices $800 360 $381 and these are just over the last 24 hours. So people are starting to make money on their assets in off the grid. So I think all this stuff coming together at the same time could be a recipe for success finally for some gaming tokens. So let me know y'all's thoughts down below in the description. And as always, I will see youall on the next one. Like the video, subscribe down below. I will see y'all on the next video. As always, play well, my friends.",
    "transcript_method": "api"
}