{
    "channel": "CBinthegame",
    "date": "2025_05_03",
    "transcript": " The grid nodes are officially live. People are now able to earn within the ecosystem, earning gun tokens as well off of decoding hex's. And I'm going to go over all of the data things you need to know if you are a offthegrid node investor, but also what if you want to get involved with offthegrid nodes. Is there a way to do so? How can you get your hands on some of these nodes? because I do think this is going to be one of the most lucrative node opportunities since we have seen since the original days of blockchain gaming with Gala nodes. I just think this is a very sustainable model. We'll talk about everything you need to know about offthegrid nodes going live in this video. So without further ado, let's jump over to the screen and get into it. And let's jump into it. Guys, if you enjoy the content on this channel, be sure to drop down, hit that like button, and subscribe to the channel for more every single day and week here on In the Game. We have you covered from everything from crypto gaming, AI coins, RWA, memecoins, and more. Just like and subscribe down below for more. As well, a big shout out to our sponsors here on the channel. We have some incredible sponsors ranging from games to AI agents to exchanges, from Voltisig, Cradle Games, as well as our exchange partners. down below, you can check out Blowofin. That's the place I would highly advise to check out as far as centralized exchange leverage trading. No KYC, very friendly for people here in the United States. So, check out Blofin in the link down below in the description. And it has been a monumental week in crypto gaming as the biggest crypto gaming project probably to date as far as individual games and ecosystems with Gunzilla's Off the Grid. Obviously, Off the Grid has really become the most popular web 3 game by every standard. You know, last cycle, everyone knows Axi Infinity, but it was more so from the investment perspective. It wasn't because of the fact that, wow, this game is just mindblowing. Like, it wasn't because the game was sweeping people off of their feet, but Off the Grid has genuinely attracted the likes of mainstream gamers, streamers, and tons of daily active transactions. And we are talking about that in this video. as far as the nodes which have now gone live and in this ecosystem they are termed as validators. So you have heard many many times over the course of this industry about you know Gala nodes myria nodes all these different ecosystems with nodes but most the time it's a sexy way of them selling you tokens that are vested over a long-term time period that really just emit daily. Like when I look at some of the nodes in the ecosystems that I've bought previously, it just doesn't really make sense. I'm getting a standardized amount of tokens every single day, but that's actually not what's going on in the offthegrid ecosystem. This is purely based off of in-game activity and the amount of onchain activity that is being transacted. So this morning, and I'm going to walk you guys through this in this video, I went ahead I got my nodes up and running. The test net rewards I will show as well for a couple of my nodes in this video. What you could potentially expect to be earning in the background here if you have guns nodes as well. I will talk about if you are sidelined on these and you maybe are looking for some exposure. There are some potential ways now and in the future to get your hands on these nodes. So, I'm going to be talking about that and breaking down how these nodes make sense and how you can earn with offthegrid nodes. Let's jump into it. So, first and foremost, let's go over the nodes. What do they do exactly? How do they acrue value and why do they, in my opinion, make a lot more sense as far as sustainability than other things we have seen? Well, you can come over here to gunsbyguns.com and head over to the earn tab at the top. Scroll down here and you can get a look at what the validator NFTs and I'll read what they describe it as and then I'll translate it for those who maybe aren't aware of some of the terminologies in this ecosystem. So validator NFTs are the nodes and they mint in-game items in off the grid and other upcoming games that will be built on the guns network. There are five rarity levels each with a power level determine its chance to be selected for decoding a transaction. So every transaction in this ecosystem for the most part is going to run through a node and specifically the hex's every hex that is opening aka decoded they are using that terminology. So every loot box that is opened that is the way to translate that if you aren't very privy to the terms in this ecosystem. When a player opens a hex validator NFTts the nodes are chosen at random to process this transaction. The player pays gun fees which go to directly to the node owner and a new in-game item is minted. Some of the guns tokens are also burned during the decoding. Validator NFTts also earn additional resale commission when these items are traded. So, as you can see here, there's about 10,000 of these nodes here in the entire ecosystem. It's it's exactly 10,000. There's 6,000 commons, 3,000 rares, 900 epics, 93 legendaries, as well as seven ancient nodes. So, from what I understand, the legendary and ancients were sold to big entities. like I'm pretty sure the the big boys in crypto, the big, you know, exchanges and and VC investors were able to get their hands on this, but you know, there was a lot of uh, you know, community VCs and small rounds that were able to get their hands on common rares and epics. One of those actually being our launchpad over at Nexus. Uh, we were actually able to get our investors their hands on these Gunzilla nodes a little over a year ago at this point in time. We we sold the uh I believe we just had allocation into the common nodes. But look, I think these are going to do very well and I'll go over that as to why. As you can see here, each of these rarities has a different resale commission rate. 1% 2% 3% 4% 5% and the hash power that goes into it. And all of this can be tracked on the hacker platform hacker.gunschain.io. You can see here ever since mainet went live and this is just a week. Uh you can see total decoded at 3,331. This is the ones that have been decoded by nodes. So every node has attributed to these transactions. As you can see here about 416 of these have been allocated to the common tier, 813 to the rare, 432 to the legendary, and 1670 to the epics. So you can see owning an epic node as of right now the data is skewed to show that epic nodes are probably going to get some of the most value in this ecosystem. You can see the amount of hex's being decoded on mainet every single day. The active hash power and then literally by live stats you can see the amount of activity going through the chain like you can see the hacker address the different rarities the amount of hex's the hex distribution that this has gotten at this point in time. So, there's a lot of data that you can sift through here. And if you are an investor into these nodes, how do you get these set up? Recorded earlier on my other PC here on one of my wallets when I was activating some of these nodes. This is for my Epic node actually. And we'll go over how to get this set up if you are a node owner currently. So, you can start earning. And in this little recording that I did, I also jumped into my test net nodes so we can do a little bit of math on the ROI on these types of things. So, let's jump into it. The first thing you're going to want to do is go to hacker.gunschain.io and you're going to see the public and private dashboard. If you are a node owner, you are going to want to hop over, connect your wallet, and you will get right on to this private dashboard. The private dashboard is going to show your NFTts that you have as far as the nodes. So, on this wallet, I have an epic node. the as you can see here on the layout, it is the third most rare node in the ecosystem. So earlier this morning, I jumped on the platform and I started getting this thing set up. You're just going to need a little bit of guns. So you can send literally five guns tokens, which is it's just a dollar or two at this point in time. You can just send that over and you're going to be able to process the gas fee on the transaction and all of a sudden your node is up and running. As you can see here now, there's no activate button. You can see earned gun at this point was zero. Hex's opened were zero cuz I just got this thing running. You can jump in and check out the node license details. All of these nodes actually come with pretty cool NFT characters there on the left. You can see this is where all of your data for your individual nodes are going to be shown. So, what I did is I hopped over. I haven't had these migrated to mainet yet. my epic node is on this wallet. But you can see I have two rare nodes that we're running on testn net. So we're kind of able to do a little bit of math here. The rare nodes are the second uh or actually the fourth most rare in the ecosystem from ancient, legendary, epic, and then to rare. So it is the second tier up, right? Common and then rare. So you can kind of do some guesswork here based off the dashboard. you know, rares are getting about half uh the the hex decodings that the epics are. So, you know, with that in mind, we go back over here to the test net dashboard. These two nodes over a few months time, like I haven't been running these the entirety of test net, but I've been running them for quite some time at this point, and they had acred me about 2300 gun token. And you can see here with about 8,000 hex's opened. So you could probably wager that just given the data right now that that would be about double with that epic node. So you know right now at this point in time these 2,000 guns tokens are worth, you know, a little over $100. That same epic node would probably have printed the same amount because there's two rare nodes here. So, you could probably speculate that the ROI on this over the course of time is going to be pretty solid. Like, and there's a lot of transactions going on in this ecosystem every single day. So, because of the amount of hex's being decoded, you could probably wager that a rare node, you would just multiply it by two and that's what an epic node would be earning. But that's just based off of the current information that we have. And the same kind of thing, you can hop right into your nodes. You can see okay this node has earned me 1,00 gun token. I've decoded 800 or 8,500 hex's and you can see on a daily basis your earnings which I think is really cool. So you're able to see it's a pretty stable you know flow here you're on a rare node able to decode anywhere from typically based off of this graph down here about 3 to six hex's on any given basis. And you can see here the items and transactions that are being run through your nodes. As you scroll down here, you're actually able to see the different commons and different transactions that are flowing through your nodes like a Terracon Epic, the different limbs, the M4 rares, etc. So, it's a pretty cool system they've built out for you to be able to track your earnings. But, this is all based off in-game activity, which I love. This is not a Ponzi fund raise scheme where they've simply just gaslit you to buy nodes and basically give you an allocation of tokens over a six-year time period. Cuz honestly, there's tons of ecosystems in crypto gaming that have used nodes as basically a fundraising mechanism. And yes, while Off the Grid definitely made a good amount of fundraising on these nodes, they just make sense, right? you're actually being paid and being rewarded based off the network effect of the game, the amount of players, the amount of transactions. You can literally see tangibly that this node has contributed to all of these items being minted onto the blockchain. So, I love this format and I just really do think that if off the grid and guns continue to crush it. I do think nodeunners are going to be made whole here pretty quickly, especially if we go into a bull run over the next 6 to 7 months, which to me I think we see a lateear run into big-time Bitcoin all-time highs, probably an alt season as well. And that would catapult a token like Gun. And if you aren't familiar, you know, we've talked about this a lot on this channel. I do think that gun is undervalued at this point in time. We go look at the token sitting at about 570 million FDV, right around 5 1/2 cents. You can actually trade this on most major exchanges as well as on the AVAC network. So to me, this model just makes sense. I love the platform where you can actually see the amount of transactions flowing through not only the entire ecosystem but to your nodes directly. And now for the milliondoll question that you're probably all asking. Well, Hustle, it's awesome. There's 10,000 NFTts in this ecosystem, but unfortunately, I don't have one, right? Maybe that's what you're sitting there. Like, I would love to get involved with this ecosystem. It does seem like a model that works, but I want to get involved. How can I do that? So, right now, there is not an open marketplace to go buy these nodes within a lot of individual groups. There are OTC's, but you have to really trust, you know, the person on the other side. I know a lot of people within our community are also going to be looking to maybe sell their nodes, so you can get it secondhand, but there are rumblings and rumors that you will be able to trade these nodes on secondary markets very soon. So, you know, all of these do have not a lot of people especially were able to get their hands on an epic node. like you have a top 9% node in this ecosystem based off of the supply. I think those resales will be very lucrative for Epic node holders, but I have heard rumors there will be an open marketplace right on this platform where you're going to be able to eventually transact and actually trade your nodes. For now, you would probably have to go OTC. You could hop in the offthegrid discord. You could hop into some of the VCs that have gotten involved. Check out their Discords as well. We have ours over at Nexus and I know a few people that are I think looking to potentially see if they could sell at OTC. But if you want to be safe, you could simply just wait until this goes to actual marketplace on the hacker or guns by guns platform. So that's really it guys. I do think these are going to be very lucrative for the people who do get involved and have a chance to own a node in this ecosystem. And I just love how sustainable it really is because it's literally based off of the amount of activity inside the game, whereas most projects are just selling you nodes off of hopes and dreams to raise some money on the back end. So really excited and I'll keep you guys updated how this ROI plays out, how sustainable this really is, and if it is something that I would recommend getting involved with whenever these are tradable on the secondary marketplace. So guys, like the video down below, subscribe to the channel. What do you think about nodes in general? Does this node model make sense? Cuz to me it does. Just let me know in the comments down below. And I'll see youall on the next one. As always, like and subscribe and play well, my friends. And stay bullish, my"
}