{
    "channel": "CBinthegame",
    "date": "2025_05_14",
    "transcript": " Recent success of Launchcoin, which went up over 15x over a 36-hour period, has sparked a lot of DGEN activity in altcoins, and everyone is wondering what is the next altcoin narrative that you should be eyeing for major gains similar to Launchcoin. Now, there are three narratives in this video that I am going to go through. One of them is extremely high risk. One of them I think is the safest bet of the cycle and one is definitely a risk on play, but I think will hit during this cycle as well. So, we're going to go over these three narratives in this video that I think could end up playing out over the short term and especially over the long term. So, let's go ahead and jump right into it. And first and foremost, guys, drop down, hit that like button if you enjoy the content, as well as subscribe to the channel for more. Every single day and every week here on In the Game, we have you covered from all the top narratives from crypto gaming, AI, RWA, memecoins, and more. And of course, drop down in the description and check out our sponsors down below. You can check out our top sponsors, Voltaic Sig, as well as Blowfin and Cradle Games in the description down below. If you still need a place to place your trades in this market, I would highly advise to check out Blofin. You can see their logo up at the top of the screen and you can check out the link down below in the description to get a sign up bonus for a centralized exchange. No KYC, all the top pairs. So you can check out Blowofin down below in the description and let's just take a look at this market. Obviously, you know, Bitcoin's in this middle ground of 103 or so uh,000 on the price point, but that is actually a good thing for altcoins. Usually whenever we're ranging like this on Bitcoin, it does mean that more money is simply circulating through altcoins. And we have seen that 100% play out over the course of this week. Today we see stuff like Grass, which I know uh on Ran's show yesterday or two days ago, he was mentioning Grass was definitely due to make a move. It is up 34% here on the daily time frame. We see stuff like Creo up 8%. We see WagMe Games up 74% on the weekly. We see one of our top picks here on this channel, Guns from Gunzilla, which is up 48% over the weekly time period now trading around that $700 million level. So, there's been some pretty good action across the board here. We see Echelon Prime up 56% on the weekly. Xorg, one of our portfolio plays as well, which is up 52% on the weekly. So, there's a lot of good stuff going on. not only in AI or RWA or you know gaming but we're seeing the pure onchain degeneracy come to life this week as we see launchcoin now this had been live in the market for actually quite some time if you look at this chart right this thing is not like it was a new launch so uh as much as you know you might have feel like oh you missed it this was a coin that sat in the market and really didn't do anything for quite some time and now this has kind of become the talk of the week. Obviously, whenever you see this chart, this thing moved over the course of literally three days up to as high as a $6,000% gainer uh from literally a $4 million market cap earlier this week all the way up to where it is now at a $218 million market cap. Now, if you missed this, I wouldn't really be concerned. Most people missed this and to be honest, this was kind of an unprecedented coin to have done what it did at the time that it made this move. But before we jump in to the three sectors that I think you need to be eyeing if you missed Launchcoin, I do want to talk about some big news today because JP Morgan partnered up with Ono and Chainlink to literally create a bank infrastructure to Onondo Chain. Now, this is basically a test net cross-chain style blockchain that is working directly with the institution of JP Morgan. So, this is pretty big news and I did want to highlight this. There's not a lot of news today as far as uh Bitcoin news or strategic uh you know, states doing strategic reserves or whatever the case is. But this was definitely noteworthy and I wanted to mention this aso is the only portfolio project that we have listed currently in our last portfolio video in RWA. Obviously, Mantra had a big fallout. So, I think that is the clear-cut number one in the market and this just further proves that at this point in time. So, let's jump back over to Launchcoin. We can see that this wasn't just driven by like degeneracy. Obviously onchain dgens are back in full in this market. I mean the trenches are back alive. So that is something to be considered. But at the same time you can see here you know launchcoin aka the believe app has literally done $913 million in lifetime volume with 7,000 coins launched. So this is internet capital markets as they call it right. Retail is funding builders at scale and attention is the new venture capital. We are only just getting started. So this narrative is definitely one to pay attention to things that come out of the Believe app or the Launchcoin ecosystem. But for me, I want to go from a top-down perspective. Three narratives that I think you have to be clued in on at this point in time. And I think all of them can have a legitimate run over the next 30 days. Let's go ahead and take a look at it. First and foremost is the virtuals ecosystem. So, this right now is ongoing and if you aren't in this ecosystem right now, I think you have to start paying attention. The participants that are in the Genesis program are literally killing it at this point in time. Today, Virtual's Axel Rod, the AI native hedge fund, is live on Genesis. The massive surprise for early stakers, is that the first Genesis airdrop has been sent. Check your wallets. And there are tons of these Genesis launches going live every single day. And what you do, you come through here and you can see how much subscribed to token is. You can get in early on these and then when they launch, you are allocated a certain amount of tokens for participating in these early launches. They also have staking which gets you access to different things like you just saw with the airdrop of the uh Axel, you know, hedge fund token that they were mentioning here. Uh the Axel Rod AI, yeah, like Bobby Axelrod, the AI native hedge fund is live on Genesis. So you got access to this if you are simply staking inside this ecosystem on their new genesis launch platform. Now if this is a little complicated I mean holding you know virtual is going to pay off long term. And if we actually just go look at the all-time highs on something like virtual you may be a little scared if you're looking at this coin cuz it's up so much over the course of the last month. And to be honest, like I wouldn't be chasing this coin necessarily, but this is nowhere near its all-time highs of $4 that we saw back in January. So there's still is opportunity here, but more so I think the opportunity in participating with virtuals is inside the ecosystem. So for me, I would just be simply getting involved with the staking, getting involved on the Genesis launch platform even. So just give it a shot. like get involved with some of these Genesis launches and you can start to see how it works. So you can start to kind of establish a little bit of a strategy on these because there have been some that have popped off gone to you know $10 million market cap and they have paid off very well for the early contributors as well as stakers. So that is number one. Number two is 100% AI. Now, the last one I'm going to talk about is going to be the highest risk and and we'll get there in just a second, but along the lines of what virtuals is doing, AI is the narrative that is going to be in at all times. Like honestly, AI infrastructure now virtuals is kind of uh we've we've seen it over the course of time. It comes and it goes, right, with the AI agent fad and all that stuff. So right now I would be isolated on the virtuals ecosystem but also with that I would include AI agents. You guys know I really like Limbo. Uh just as the last one on virtuals/AI agents. I think that Limbo is the number one most undervalued AI agent play in the entire market. If we go look here still sitting at a $4.2 million market cap. Uh, this has moved a little bit since we first introduced it to the channel last week, but I think this easily goes back up to 10 plus million dollar market cap, especially if the AI run does continue, which I simply just foresee that happening very, very easily. Moving on down the line, I've mentioned this one quite a bit, but neural AI, this is the low cap project that simply continues to deliver. Now, we're into AI infrastructure. So number one was virtuals genesis as well as AI agents overall but number two here is AI infrastructure. So neural AI we've talked about this one quite a bit. As you can see here this is some of their rendering capabilities inside of gaming ecosystem. So you can see this is their world engine trailer. Generate full scale maps, scenes and entire worlds in collaboration with the world engine the ultimate AI powered game engine. So, of all the low market cap projects in the AI space, Neural AI has delivered by far 10x what anyone else has, to me, it's Neural AI and GPU. Those are the only two that I would be looking at in those middle cap ranges. So, if we go all the way up here, let's swap over to the AI watch list. And by the way, guys, if you're not using Nexus, it is by far and away the best all-in-one platform in crypto. Have your watch list all in one place. You can attach all your different wallets, no connection needed. You can track over 20 chains right here on your native portfolio on Nexus. And we do have onchain trading coming live very soon. So, let's just scroll down here. As we can see, those middle cap projects, Node AI and Neural AI, both sitting at a $49 million market cap today. These had made all-time highs around $150 million market cap. And I really wouldn't be surprised to see these run up to those levels during this cycle. So for me, low to midcap AI projects that have proven themselves. Now, of course, like these are projects I've had conviction in long-term, but that is the point. I'm really trying to hammer down on my conviction plays here, and I do think that GPU and Nural are great opportunities still at these market cap levels. And to be honest, they haven't really moved as aggressively as some of the other things we've seen in the market like Hash AI up 220%. Uh, Solidus AI up 228%, AIXBT up 163%. You see Virtuals up 250%. So, I think there's a lot of opportunity for those two specific altcoins in this market. The next narrative that I think does legitimately have legs over the next month. Now, it's obviously been a tricky one. Gaming has not been friendly to a lot of investors during this cycle. But right now, there are a lot of catalysts coming around the corner that actually could potentially bring attention to the gaming sector and bring liquidity to gaming tokens. And not only that, if we just go look back at the main watch list here, we actually are starting to see money flow into quality gaming projects. We see Immutable up 73% this month. We go down here, even Sandbox is up 37% on the monthly, AXI up 50% on the monthly. Beam's up 53% on the monthly. We see Superverse up 47% on the monthly. 45% for Ronin. So money is starting to trickle back in. 67% for one of our favorite plays in Echelon Prime. So, you're seeing the money and attention is starting to swing back into gaming just a little bit. But literally over the next two weeks tomorrow, we have Maple Story, which is going live with their game and their token. And to me, I think that this one, whether legit or not, will be propped up. I think the market cap on this one is going to launch pretty good in this market. It's one of the most dominant gaming IPs over in Asia. And this will launch on Binance Alpha. I would not be surprised to see this get enough attention on the Binance Alpha app that this actually goes live on Binance. So, I would be looking at this and once people see, okay, the game's live, you can jump in, you can make some money and the token just launched and maybe it launches at a $700 million FTV or something like that. That's going to bring some attention into that gaming ecosystem, but also into the broader gaming landscape. And we also have the off-thegrid mainet which is going live this month and we're seeing people trade their assets for over $1,000. This is another one. Uh earlier this week we showed another trade for like $1,500. This asset right here sold for $1,268. So it's about to be this type of a market where yes, you can win in the trenches, right? Whether you're trading meme coins, AI coins, whatever the case is, you can win doing that. But it is a very very high risk game because you're risking capital. 99% of these things on even on like virtuals which has been crushing it. A lot of these are going to do absolutely nothing. Like they're for the most part going to be garbage. But whenever you're looking at the gaming side, you jump in, you spend some time in these ecosystems, all of a sudden you earn some of these items and boom, you can sell them for thousands of dollars potentially. And people are going to lean into that. And the best times in gaming have come from when people are making money. Okay, as much as the games do matter in some sort of fashion, people really just want to make money inside of these ecosystems. And I do think if the economies here are healthy on Maple Story and off the grid, this could definitely bring some attention into the gaming sector. We see Avalanche, which has just got Pixelmon to join and build their own L1. We have Mythical Games building out the FIFA Rivals IP. Now, this is awesome. They killed it with NFL Rivals. It's one of the best NFL mobile games that's currently on the app store right now. We see Moon Tropica coming up with their launch on March 31st. It's up over a 100% on the weekly. We have Zy, which has made a really good recovery, up 120% on the weekly, and they've already distributed $100,000 to people playing web 2 games. Now, this is pretty cool. So, you might be a person out there who hates web 3 games. Okay, whatever. But you can go sign up for Ryen and this actually distributes rewards based on activity on your Steam account. So, playing regular web 2 games. This is incredible. You go earn points, earn credits, and you can get paid out just to play regular games. So, to me, the gaming narrative is loading up for a pretty strong move given all of these catalysts. Now, what would be the tokens that I'm looking at in the gaming space that really haven't made major moves yet? Well, for me, number one by far is Gun. I think that Gun deserves to be trading around that billion dollar level and we're still, you know, at 680. We've been calling this one since $400 million market cap. This launched on day one at a billion. So, it took a 60% downturn due to sales and all this stuff. the Binance launchpool sales. Now, there's no tokens going into dilution for quite some time. To me, this deserves to be trading around a billion dollar market cap. So, I do think that Godzilla continues to trend up. And then whenever I look at the gaming sector, I think Zentry, this is very closely tied to Ronin. Ronin's been making a pretty strong move, and Zentree hasn't really made those moves. And I've heard rumblings that some pretty big news is around the corner for a token like Zentry. So I do love Zentry at those levels. And to me, I'm just sticking true to the top plays like Ronin, Beam, Prime, Superverse, etc. But for me, I'm most isolated right now on Gun. I think that Gun will continue to trend up, especially leading into mainet. And if that speculation is strong, I think it does catapult a little bit of a gaming run. And we haven't seen gaming move in a strong fashion in 15 months. So when that happens, it will be a major major move. So that's what I'm looking at right now. And of course, the last thing I will say is the trenches are back. Okay, so this is what I was talking about. The highest risk thing you could probably do in this market is go back to your Bullex Photon and start getting involved with these launches. Now, this is working right now actually. Like, there are a lot of people making money in the trenches. A lot of these runners now are coming back. They're going to 10, 15, 20 million in a single day. So, the riskiest thing would be to jump into the memecoin trenches, but they are alive. Now, we might all hate to see that and it might not be a fun time at that point, but it is what it is. People are always going to flock to memecoins as much as people on this channel potentially really want to see AI RWA meme coin or uh gaming coins really lead the forefront because they actually do something in the market. Look, memes are always going to be a thing and if you embrace it, you can make a lot of money on it. And if you fade it and you just hate them so much, you're going to watch other people randomly win on these absolutely terrible, ridiculous coins. Okay, so my strategy is don't lean in specifically to the full-blown memecoin trenches. However, I would be holding some quality meme coins in my portfolio. So, let's jump into the few that I am holding and then you can let me know down below. Are you embracing memes? Are you holding memes still? I do want to see the opinion because memecoins are by far the most hated, but they do have some of the highest performing moves whenever the market is looking good like we're in right now. And also one side note on gaming, I am not the only one that sees this narrative playing out. There's a lot of people on the timeline that see gaming heating up in the background. And even meme coiners like we were just talking about like Crash, he's bullish on stuff like Mavia at these levels. And I do think Mavia is pretty primed to pump. We've actually seen that token particularly pump 100% in a single day. So, look, it's not just me, the the long-term gaming bull. We actually do see people that are in the memecoin space and just strictly traders actually really isolating on certain gaming tokens at these levels. Now, let's jump into the memecoin sector. I'm going to move over to the memecoin watch list here. And look, if we just look at the 30 days here, chill guys up 400%, back over 100 mil. Uh we see Goat up 296%. Obviously, we see Peanut up 210% which is absolutely dead meme. Like, you know, Peanut, chill guy, those aren't relevant memes anymore, but these moves are absolutely ridiculous that we are seeing on meme coins. Whiff is up 150%. Fog is up 149%. And look, our two top conviction plays. Y'all might have thought we were crazy during the the, you know, three weeks ago, you couldn't ask someone to buy an altcoin, let alone a memecoin. Okay, this narrative was just not there. But we're seeing right now, whenever the market's hot, meme coins play out better than anything. So for us, we held Brett and Mog the whole time. Brett's up 126%, Mog's up 118%. So I think those are absolutely killer plays to just continue holding. I would not be surprised to see both of these get back over a billion dollar market cap, especially if this market does continue to trend upwards. Now, the other one that I would be looking at at these levels is going to be Calvin. So, you guys know I really like Calvin. We introduced this one to you guys at 800K. It went all the way up to 4 million uh a couple months ago and then the Trump coin launch sucked all the liquidity out of the market and it did take a dip with along with everything else during that time period. Right now we're seeing this at 1.5 million. I know they have some really big catalyst coming through the door here very very soon. I do like Calvin at this $ 1.5 million level. AI agent memecoin trading narrative everything you need in one. And that is a high-risk one but to me like I'm holding strong meme coins. you know, Brett, Mog, Pangu, etc. And then I have a risky play with Calvin. And I do think that could get back up to that $510 million level during this run. And that would pay off massively for anyone who has been convicted at these $ 1.5 million levels. So that's it for today, guys. I think that if you are looking for where the next opportunities are from Launchcoin, I would look at the Virtuals Genesis ecosystem. Maybe get involved with some staking, test out some launches, see if it's for you. Okay? And then also I would tally that up with the trenches. The memecoin trenches are back. But those are both going to be pretty high risk. If you want to dumb down your risk a little bit into a certain narrative, I would look at AI. AI infrastructure I think is going to be hot for the duration of this bull run. So AI by far and away the number one opportunity. Next up would be gaming. We see massive influx into gaming over the last month. Big catalyst coming at the end of this month. And look, if gaming altcoins do catch a bid, you're gonna see some of these coins go 100 plus percent literally in a single day. So, gaming would be the third one there. And then last, but certainly not least, is holding quality memes. Okay, meme coins move most aggressively in the entire market. Love it or hate it, it just what it is. Don't hate the player, hate the game. I'm still holding some of the top memes. And I want to know what you guys are most isolated on in the comments down below. And I will see you guys on the next video. As always, like the video, subscribe down below, and I'll see youall on the next one."
}