{
    "channel": "CBinthegame",
    "date": "2025_05_09",
    "transcript": " The bull run is officially back. And while I really don't think the bull run ever stopped, I think we just saw a bull market pullback, we are now back over 100K. Even Ethereum is now up 25% on the 7 days and altcoins are beginning to move. I don't necessarily think that this is alt season, but there is a narrative right now that is super undervalued just based on world and global trends that I am doubling down on at this point in time. So, in this video, I'm going to go over which altcoins in this specific narrative that I am absolutely hammering during these time periods for upside, as well as some news across gaming, AI, and more. So, let's go ahead and jump right into it, guys. Like the video down below, and subscribe to the channel for more every single day and every week here on In the Game. We have you covered from crypto gaming, AI, memecoins, and more. And of course, check out our official sponsors down below in the description. You can check out our sponsors, Volultic and Cradle Games, as well as Blowfin, our premier exchange partner. And if you didn't see Doodles launch their token today, the, you know, OG NFT collection, if you are looking for a place to trade this coin, even short this coin, as NFT coins typically don't do that well off the start with all the airdrop sell pressure, you can go check it out on Blow Fin right now. zero maker fees, 50% off taker fees, and you can get a sign up bonus in the description down below. You can check that out and start trading with Blowin today. So, let's go ahead and hop right into it. Guys, as mentioned, we're looking at a market that is just really exploding at this point in time. We're starting to see some coins really start to move to the upside. We're seeing meme coins honestly dominate and a lot of them, there's no reason for Fog or Chill Guy to be moving, but that's just the market that we're in. We're also seeing some small AI agent coins as well as some gaming tokens start to move to the upside. So that is obviously amazing to see. We're seeing a lot of strength out of coins like Sooie and Hyperliquid. So right now is the time period to be kind of looking and see a what hasn't really moved yet in the market? Which narratives are still undervalued? Because I think there's a specific narrative and I'll just go ahead and say I think AI coins right now are the one place you need to be looking. and we're going to jump into that here in this video as far as AI coins that I am doubling down on in this market. But I do think right now we're going to continue to see Bitcoin run up. We're seeing a more risk on environment as right now, you know, Bitcoin is officially surpassing Amazon as the fifth largest asset in the world by market cap. We see asset entities which became a Bitcoin treasury company now up over a,000% in the last 5 days. And what better adoption curve and bull market effect than stake and shake now accepting Bitcoin payments. Obviously, that's a little bit of a joke there, but they literally are now claiming to be stake to Toshi as they are accepting Bitcoin payments. And we are seeing Trump saying it is not as bad as they are telling you basically. And my ideology, everyone's trying to say we're heading into a recession or this this this. I think when we're talking recession, we're already in one. So, at that point, it's priced in. That's just the way I've been approaching this market. And we told you guys over the last few weeks, I would expect over a 100K in the very short term. And here we are. I think we do still see some upside from here. So, let's jump into some news and then we'll talk about specifically the handful of tokens that I really want more exposure to during this time period. So, let's jump right into it, guys. We see Avalanche. Obviously, you guys know I love Avalanche and Avac is making a little bit of a nice move today. Uh up 7% and I believe over the month we are looking at up 32% on Avalanche. So sitting around $23. Active addresses are climbing like no other and especially on their L1 networks. And these are being driven by off the grid as well as stuff like beam. And if you have Beam nodes, the season 1 rewards are now claimable. You can go check that out. Honestly, I thought the rewards were a little underwhelming. However, I think they will get stronger as the market continues to progress and it is a work in progress as that is just node season 1. But right now with this L1 growth, it's really being driven off of the backs of things like off the grid, which is also about to fully go into mainet. So, it's confirmed that this month during the month of May, we're going to be able to trade our items on OpenC, buy and sell different types of weapons and stuff like that. So, this is going to be a big catalyst and it could drive FOMO into the gaming space and also drive volume into the guns token. I just still think that the gun token is very undervalued at this $500 million level. I mean, this is the number one crypto game by quality purposes that has ever touched the surface. I think once people start dejing, people start seeing how much money you can make on this game. If you kind of sift through the blockchain, as Meatport did here, you can see these real transactions on the mainet. So, there's a few participants that are already kind of grandfathered into the mainet. And we're seeing assets trade for 300, 160, 50, 79, 25, $54. And these are just from the minimal users that are on mainet currently. So, very bullish. And I think once people start seeing the earning potential from just jumping in, earning assets and going to the marketplace, I really do think that Avac Network effect will go up. But also, I think off the grid's gun token is a very good buy near these levels. Moving on, I mean, and also just have to wake up to the fact that gaming is so large that if we have a hit really smash through like we did AXI in 2021, something like Off the Grid or whatever the case is, then this is going to be massive. As you know, Roblox is doing 7.2 billion hours of engagement, which is about 43% of all of Netflix and just with 97.8 million daily active users. We also see Sony investing 69 million in a web 3 platform. Obviously, Sony is the PlayStation manufacturer, so this is a really bullish sign. They also have their blockchain, which right now is more tailored to like music, but they have mentioned that gaming is in the fold for that. So that is their sonium chain and they are really buying into web 3 as they are pushing $69 million into the industry. We see stuff like Pirate Nation, you know, and their esports and their revenue model is pretty insane. They yielded $600,000 plus in a single month of gameplay at current value. And these are the users within Pirate Nation. And they are saying that esports could be disrupted by web 3. I do think personally the gaming space has been beaten down so hard by the failures but we do need to celebrate the few wins and if you look at the stuff like pirate like gun these types of gaming tokens that are still really going strong I think that's where you would want to place your bets in these teams that are making revenue and making waves in the space and then also we do see some innovation going on here you guys know I love Xorg and if you don't already they are running a trading competition so on Xorg's native platform. You can jump into this. I'll actually leave a link down below in the description. A 12,000 or a $1,250 buy places you in 20th currently. And this would be a reward of 15,000 Xorg, which right now is about $1,000. And if you're in the top 250 in this competition, you will share the 2 million Xorg prize pool. There's 9 days left to jump into this. I will leave a link down below in the description. So, a lot of cool things going on in the gaming space and I do think we have some great catalysts like Off the Grid going to mainet and just pushing the successes forward like Pirate Nation. We have Maple Story launching in the middle of this month. So, really good horizons for the gaming space. But which tokens was I alluding to that I would really want to be stacking at this point in time? Let's jump into it. First of all, I would double down on the stance on off the grid. I think around 500 million FDV, which is this 5 cent level. I just think that is way too low for a game that could catapult itself into the multi-billion dollar market cap in the real full-blown alt season and bull run. So, at 500 mil, I do still love Gun, but I talk about that quite consistently and I have alluded to some big things coming around the corner for Superverse. Now, I know a lot of you in the comments always ask me, well, what does Super do? What what is the platform? Do they even have a product? And I can tell you this from speaking with IEO over the last couple of years. They are working on something that's really universally going to unify a lot of things under the gaming and trading sector to really make things easy to acquire gaming assets. Let's just say that. And kind of bring them all into one place. So for me, this update that IO is alluding to in this tweet, I guess we release it this month. Super cycle. So, if we go look at Super, it has reacted quite well to this. I do think there's a lot more upside to come as we did see Super trading at about $2 just some months back whenever the bull like really the altcoins and meme coins were really going crazy at that time. We're still sitting at 80 cents here on this token at $800 million fully diluted market cap. I think once this goes live, people will see that, you know, Super is really making waves and a lot of gaming projects want to be a part of what Super is doing. So, for me, this is a buy. I know it's up on the daily, but we've been screaming to buy this ever since, you know, let's look at the lows here. We were talking to buy this at 40 cents just a month ago. And that's the thing. You have to have conviction. This coin right here has gone up a 100% over the course of the last 30 days. It it is undoubtedly you have to have a little bit of conviction and I hate to say it but you have to have a little bit of balls and jump into the market when everyone's so fearful talking about recessions, talking about market crashes. Oh no, the tariffs. But at the end of the day, that is the best time to buy because no one else is going to stick their leg out there and be the one to jump into the sharkinfested waters that are those low times. But now everyone's chasing, everyone's having FOMO. And I think over the next couple of weeks, if LEO and Superverse do release this update, I think this coin will easily be trading back above a dollar, which would be a 2 and 1/2x here just based off those lows that we were scooping up at the 40 level. So, I do love Superverse, especially if this update does come to fruition. But, as mentioned earlier in this video, I'm dialed in on AI coins. I just think right now AI coins given what is happening in the AI sectors and the AI realms of business and innovation it is the most advanced quickest moving industry that I have maybe ever seen and I think you guys would agree. So AI in crypto you have to have exposure but you want to make sure you have exposure to quality projects. I think if you were to just look through an AI watch list which I have a list here of like 50 coins yeah 49 coins here. So, when we're going through this, let's just be real. A lot of these are just vaporware or or chat GPT wrapped um you know, AI agents or whatever the case is. So, for the most part, you're going to want to leave out 90% of anything that is in the AI sector. But if you stack the quality and really just dig deep, you see stuff like TA up 104% over the month. This is a $3.7 billion token, eight billion dollar fully diluted market cap and this thing is up over a hundred% on the 30 days. This shows you the strength that AI has. Fetch artificial super intelligence is up 107%. Virtuals, the AI agent launchpad is up 327% over the month. So you're seeing this is the industry and this is the sector that is going to get the most heat and the most activity. Even if altcoins just move slightly to the upside, AI is where it is at for this cycle. So for me obviously I wouldn't go chase TOA up 100% on a month. Do I still think it has upside? Absolutely. But we bought this tremendously lower at this point in time. And we were also calling to buy this when it was in those low $200 levels. Render up 62%. I do think Render is a nice catch-up trade as far as uh kind of at least eating up a little market cap and trending up at least higher than Near Protocol and probably closer to where Bit Tins or Tao is. But moving down the ladder here, you guys know I love Neural AI and just going back to my tweet here, uh my low cap, my top low cap play is Nural. They've integrated so much in the gaming space and Minecraft and all these different things. So just looking at what these low market cap AI coins have done in the past, a lot of them just underdel and oversell how good their product is, but neural AI is actually the most quality low market cap AI token that I have seen in the market. And over this last month, I mean, it has been a tremendous move. Like buying sub $2 or around that $3 level, you're up quite nicely. And I think this will continue. If we look at all-time highs here on Neural AI, this thing was trading at $15. I do think that that's realistic to get back up there, especially if we actually see alt season play out. I like GPU as well as mentioned in this tweet. GPU is just I love that their product is it's as simple as possible. You want to rent out your GPU capability to their network and you can earn tokens and there's a lot more things you can do in the ecosystem, but I love GPU and I like desync quite a I just think that's a very very quality mid to mid to low cap AI altcoin. But for me right now, I don't have a lot of AI agent exposure. So when I'm looking across the board, I don't want to buy something like uh AI6Z or any of these like AVA or AI tech or any of these like high market cap mainstream AI agents. For me, I'm digging a little deeper and I'm going to go a little more niche as a project that has been building in the AI gaming sector for quite some time. And their team is actually veterans from Nintendo, Sega, Epic Games, Unity. This is today the game and actually now Yumo. This is their official AI agent. And whenever I look at their tech and their game, a lot of their game runs off this exact technology. AI agents in this world that you run through. It is one of the most advanced AI games that I have seen in this industry. And their AI agent token limbo is sitting at $3.8 million FTV when this is one of the most fully fleshed out AI ecosystems in all of crypto. They've been building an AI since before it was even a hot topic. And to me, from the lows, if we just look here at like the 4hour chart and we go back to see where this token has traded during the AI agent fiasco, I mean, this thing's got up to almost 30, yeah, $30 million market cap. That we've took a 90% dip on this token. And we didn't buy up here. We actually just recently put in our buy on this token. I think this could easily get back up to 10 $15 million market cap if AI and AI agents as well as gaming even gets a little bit of love. So, I think it's very low risk around this $3 million market cap level. And this is definitely my top buy today as a low market cap. And I know you guys love this because I'm going a little more risk on. Whereas in those slow market time periods, yes, I'm going to stack up my high conviction coins, the supers, the primes, the avaxes, whatever the case is. But right now, we're digging a little deeper. And I think that based off where these coins were trading 90% higher than what we're looking at now, a 10x from this current price level. I think this is a fantastic buy at this level, especially whenever Yumo does their official roll out and you actually see their main token come out and the AI in the game and you get to jump into it. I just think that this is a fantastic play at this price. So, my number one low market cap buy right now is Yumo or not Yumo it in the Yumo ecosystem. It is their limbo token and it also gives me an official AI agent to try to run up in this market because I don't have an individual AI agent in my portfolio. So, I am adding this to my portfolio and we will see how this plays out. I think easily can get back up to 10 to$15 million market cap. So that is what I am looking at in this market right now. So guys, I think AI is the place to be personally and I think if you're in the gaming sector, you just have to be patient. And if we look at the trends last cycle, gaming popped off at the very end of the bull run. It's not comfortable. It's not fun. And even last year whenever we had a run in February of 2024, that was the end of alts at that time. Like gaming pumped at the very back end of when alts were really hot. And then from there to the end of the summer leading into Trump's election, things really slowed down. So if you're in gaming, you have to be patient. But I would definitely be jumping into other sectors like AI. So guys, like the video down below, subscribe to the channel. Do you think we continue this uptrend? Do you think we're going to see a big dip after this recession talks? Do you think we're already in one? Let me know all your thoughts in the comment section down below. And I'll see youall on the next one. Like the video, subscribe, and as always, play well, my friends. And of course, stay bullish, my friends."
}