{
    "channel": "CryptoBanterGroup",
    "date": "2025_05_13",
    "transcript": " We got the inflation numbers and believe it or not they were better than expected. US CPI was projected at 2.4%. Came in at 2.3% and core CPI came in exactly as predicted and that basically just gives us license for this rally to continue. And that's exactly what I think is going to happen. I think we're going to continue this rally in the stock market. I think we're going to continue this rally in Bitcoin. And I wouldn't be worried about red days like this. And I'm going to show you exactly why I'm not worried about great days like this. And then I'm also going to show you exactly when we're going to know how when this rally is going to end because I'm going to show you three indicators that are going to show us exactly when this particular rally is going to end. And at the end end of the show, I'm going to show you exactly when Bitcoin is going to hit an all-time high. So if that sounds good to you, another beautiful day. CPI beat. The doubles don't yet reflect the beauty of the day. But let's get the show on the road. Subscribe to the channel and let's get going, guys. This Ranjet thing has become a thing in the chat. This Ranjet thing has has become a thing in the chat. Uh I see it. It is happening. Anyway, guys, another great day today. Even though the bubbles don't reflect how beautiful the day is. We did get a beat on CPI. More affirmation that this rally might continue. I'll show you why I'm so excited about this particular CPI beat and why I think that this CPI beat is actually licensed for the rally to continue. Going to show you exactly which indicators are going to show us when this rally is going to end. And I'm also going to show you why you shouldn't be worried about uh these red bubbles. So, if that sounds good to you, obliterate the like button. I see we got our mojo back here. I see a lot of our friends are back here today. I see everybody in the chat. I see David B. I see her all the time. Ryan Ut back. He says, \"Ran Pete, Ran Jeet, bro.\" I see Nick Gasson's in the chat. Old school's in the chat. All All the good friends are back. All the good friends are back. All right, let's get the show on the road. Let me give you guys some alpha. Let me show you guys why I'm not worried about the red bubbles. Let me show you exactly what is going on. I mean, let's just quickly quickly quickly analyze the CPI. So, we expected 2.4%, we got 2.3%. So, a slight slight slight beat. core CPI was exactly exactly exactly in line with expectation. It was actually exactly in line with the true inflation report which I saw yesterday which came out yesterday. Uh they predicted CPI 2.3%. We got CPI 2.3%. Um I mean it's I think it's pretty inconsequential what the increases in prices actually were. Gas and utilities was the biggest shelter. Uh housing prices, pay attention to housing prices cuz we're going to talk about that. Food away from home 3.9% up. Electricity and medical care. remember that Trump is now addressing this medical care thing with the biggest announcement that he's actually ever made. Those this medical care adjustment should actually come in in the next two to three months. So, that's uh pretty much where it is. Let's quickly talk about the red bubbles because I I really I look we had some moves down on the altcoins. Some of the big old coins that have run quite a bit like like all the big ones, Curve, Fcoin, uh Arbitrum, pretty much all of these down seven to eight%. I see a lot of people actually stressing about the fact that uh that that these bubbles are down. As I said yesterday in in this tweet over here, I said, \"Guys, this is a a healthy leverage flush.\" And I think you need to have a little bit of perspective. So, we had a a leverage flush. And the reason why I say you need to you need to have some perspective around this leverage flush is because guys, we just had a 40% move up in a month. When you have a 40% move up in a month, it's normal to get some kind of dip to shake out the weak hands. And specifically, I'm talking about a 40% move up in Bitcoin. I don't want to talk about some of the old coins that have actually doubled. So, to get some kind of shake of the weak hands, to get some kind of leverage shake, to get some kind of exchange market maker liquidation, you know, you know what I'm talking about. I don't have to spell it out here. I really I really, really, really don't have to spell it out here. Uh, hold on. There's someone sending me messages. Um, okay. We'll we'll we'll talk about that in a second. All right. Um, you you have to take a view, right? You have to you have to have a view. You have to, you know, in in markets, if you take a view and your view is correct, you get rewarded. If you take a view and your view is not correct, but you're smart enough to understand when to invalidate your view, and you change your thesis fast enough when new data comes out, you will get rewarded. like you know we on this channel specifically we bought the bottom and if you did buy the bottom on the stock market just look at how amazing the returns are on the stock markets right we told you guys that it's that that it's that it's pretty much it's pretty much over but then like I think I I actually share the same view as Ra Paul and the reason why I say I share the same view as Ral Paul I really think that from now until August the trajectory is going to be up I don't think it's going to be straight up but I think it's going to be up and I think it's going to be up until August and I until August. Um, we can actually we can actually not relax, but we can actually celebrate a little bit and we can actually have some fun. When it comes to August, there's a lot of indicators that are telling me that August may actually be uh when we when we take a slight pullback. So, I think this year sell in May is garbage. It's not going to work. It's exactly what I said when I made the sell in May video. I think this year we're going to run until August and I'm going to show you exactly what's going to happen in August. So, my I've taken a view. My view is that Trump is on a mission to push up the stock markets and you saw that yesterday. The S&P had its third best day in the last 5 years. I mean, he's literally come out and he said, \"Guys, buy the market.\" You heard that, right? You better go out and buy stock now. Let me tell you, this this country will will be like a rocket ship that goes straight up. This is not President's pretty much told you buy the market. I'm not I'm not going to fade the president. They say never trade against the Fed and never trade against the president. Also, you can see that he's on a bit of a roll. There's there's the China deal. The way that they announced the China deal, you can see they want to make they announced the China deal like China and the US had had had reached a trade deal. They haven't reached a trade deal. They've reached a a deal a trade deal around a 90-day pause. But the way they announced it was almost like they wanted to hype up the markets for some reason. I'll show you what I think that that reason could be. Russia and Ukraine meeting in uh in Tur in Turkey on Thursday. India Pakistan ceasefire that Trump said he brokered. The last American hostage was released and the executive order that's going to return reduce medical bills. Trump is on a mission with good news which is very very very different from the mission that he was on when he was breaking the tariff news and trying to obliterate the market and hopefully reduce the Treasury bill rates. Right? I also think that from now for the next 30, 60, 90 days, we're going to get a lot of trade deals announced. And every time that we get a trade deal announced, that's going to be good for certain stocks in the market. Like when when a when a trade deal is done with Vietnam, I think I think Nike is going to run. I think when a trade deal is done with India, a whole lot of India related stocks are going to run. So I think for the next 30, 60, 90 days, we're going to get a lot of trade deals in the market and that's going to get the markets to run. Then I look at the charts and I mean let's just go simplistically S&P 500 yesterday first daily close over the 200 SMA. So I mean that's just from a technical point of view uh uh uh the S&P 500 is back over the 200 SMA. On top of that more than 50% of the stocks in the S&P 500 are now above their 200 day uh moving average. Looks like a big level and another reminder that we aren't going back to new lows. So that's another another another thing that you want to look at. Uh from a structural point of view, you have a higher higher high here. There's your first higher high and there's your first higher low. So from a structural point of view, the charts look structurally correct. So that's that's another thing that that is worth looking at. Then I want to turn your attention to the VIX chart. So this is the VIX chart. It's the volatility index chart. I'm actually going to take it onto the weekly just to show you to make my point here. when the VIX goes above a certain point and in this case you can see the VIX doesn't go above 50 very often but when it does and it goes below 20 if you look at the data what you'll realize is that if the VIX closes goes above 50 and closes below 20 generally that means that the worst is over. So if you want to look at those things those things are all telling you that that the worst is over. So if you take a view you will be you will be rewarded. Now, I'm not saying take a blind view and just say that the market's going to go up forever. There's a couple of validations that you want. The first validation that I want is I want the S&P to put in a higher high. I want the S&P to trade above the 6155. It's not very far from that, but I want to see I want it to to get back into price discovery. That's the first thing that I want to see. The second thing that that I want to see is I want this yields problem to be solved because we have a problem. The problem is that no matter what Trump Trump does, the yields are increasing and by virtue of the fact that the yields are increasing, Trump has a massive massive massive problem. He cannot refinance the debt whilst the yields are increasing. Just look at this. Just I want to show you the the US 10-year Treasury yield. So that's the US 10ear. If you go to the US 30-year Treasury yield, now this is a 30-year uh debt, US 30-year debt. So, I read this tweet and it said the 30-year yield jumps to 4.89. It's currently sitting at 4.9. So, even even higher than that, right? The 30-year yield jumps to 4.89, sitting at the sitting near the highest levels of the last 18 years. So, this is like it's sitting, if you look at the last 18 years, the the the the 30-year Treasury yield is sitting at those levels. Why why is this such a problem? Well, let's go back to our inflation readings over here and let's look at at shelter which is a which went up 4%. Now, shelter going up 4% says people cannot buy houses and cannot sell houses when they financing their houses at at uh 4.9%. If the financing on a house costs it doesn't it's much higher than that because remember the banks mark that up with a risk premium. So, you're talking about financing houses on a 30-year on a 30-year mortgage, right? If you take a 30-year mortgage in the US, if you can get a 30-year mortgage, the 30-year mortgage rate must be at like eight or 9% at the moment, right? Let's actually quickly uh just Google it and just see uh what is the actually chat GP. Just one sec. Let me let me log into chat GPT and and let's see if we can get chat chat GPT. Let me see. Am I logged in? Uh okay, I am logged in. Uh what is the uh 30year mortgage mortgage rate in the in the USA today? I mean I would hate I would hate to I would hate to be financing a house now in the US with these numbers. Okay, it's searching the web. 6.76. I think it's slightly higher than that. 7%. I think it's slightly higher than that. So I think it's probably 8%. The more realistic number is is 8%. Now if the if the mortgage rates are 8%. That means that the cost of rentals and the cost of living in becomes very very very high. So Trump needs this down. He needs to refinance the debt. And that's the one thing that we got to look at. So let's keep watching the the Treasury yields. Let's keep watching the levels on on on the charts. And that will tell us whether to invalidate our thesis or not invalidate that our thesis. But until further notice and until we get more information right now, you have to take a view. If you take a view, that is when you land up making money because then you place your chips on the table. If you don't take a view, then you're basically a spectator. You know, when you're playing, let's say you're playing related or you're playing blackjack, there's some when you're playing roulette, there's the guys that actually put their chips on the numbers and then there's the people that spectate and like they're always like, \"Ah, you should have put on number eight, bro. take your chips, put them on number eight. But if you do take your chips and you do put them on the table and your your your the roulette goes to where you where you where you land, then you make 36 35 times yours money or 36 times your money, right? So you have to take a view and and my view is similar to Ra Paul's view which says that um we do get a a run between now and August. I'm not blind about it. Uh, and I'll show you when I think we're going to top and I'm going to show you exactly when I think we're going to top and what the indicators are going to tell us this. But don't be blind about about this. There will be corrections along the way. There will be issues with the trade talks. It's not going to be smooth sailing like the China trade talk. There will be bad numbers that are coming out. But ultimately between now, so we are in May. So you got May, June, July, you got the next for the next three months 90 days. I think we can pump 90 days. I start to worry and I'll tell you why I start to worry in 90 days. So the first thing is remember that right now the US has a debt ceiling and they've hit the debt ceiling. They cannot go above this 36 or 37 billion. And so what they're doing is they're actually spending money from the TGA, the Treasury General account. There it's like a different pocket. They're spending money from this account. Now, they're going to spend money from this account and then they're going to have to replenish the money in this account. Now, that will happen sometime around August, right? And that will suck like a trillion dollars of liquidity out of the system because they're going to have to replenish this account. That's the first thing. The second thing is if you read the Truflation report over here, I agree with Truflation, there's a page in the report that basically says signs that inflation will worsen in the coming months. And specifically they talk about inflation worsening because of the tariffs right because of tariffs in the coming months the inflation is going to go up and they say that in Q2 the inflation is going to increase from 2.8 to 3.1 so I think we were saved this time I think we'll be saved the next time but I think around July August inflation is going to creep back. Now, when inflation increase back, the Fed is not going to be able to reduce interest rates and then it's going to kick the can down the road with these interest rate cuts even further. Now, right now, if you look at when the the Fed is expecting interest rate cuts, I looked at this earlier. It was in September only. So, let's have a look here. What's going to happen? So, it's only in September, 17th of September. What's going to happen when in when inflation actually goes up? And I think inflation will actually creep back at the system because of Trump's because of Trump's announcement. This the third thing is we're going to get a slowdown in the in the US economy. So we're going to have high inflation and a slowdown in the US economy because of the tariffs because the economy is going to have to slow down because a lot of people were laid off. A lot of machines weren't invested in because of the tariffs uncertainty. And so I think this will creep in and we'll start getting those readings around July August and that'll bring the market down around July August. And so, um, and so what I think is going to happen is I think for the next 30, 60, 90 days, the music's on. So, it's almost like, let's go back to our party analogy. You're at a party, it's about 10:00 p.m., the club closes at 2, your favorite DJs just come on, you got to dance, bro. You know, you have to leave before 2 because if you leave too close to 2:00, then you know you're going to struggle to get an Uber. Um, then also the the the beautiful girls that you're seeing inside the club, they're going to come, they're going to go outside the club, they're going to look different. So, you need to make sure that you leave the club a little bit earlier. So, for now, we're here. We're dancing. We're having the time of our lives. We will I'll tell you when I'm leaving the club and then hopefully you guys can leave the club with me and we can go maybe maybe there'll be an afterparty. I don't know. Who knows? Maybe we can go home and party again the next day. So, that is what we're going to be that is uh what we're going to do. I also think that if you're if you're on the sidelines and you're waiting to get in, the longer you wait to get in, the more of the of of the the music and the good DJ, you're actually going to land up missing. Because I think what a lot of people forget, and I I understand why they forget this, because the market came down and hit us all so hard now that you're starting that you that you have this like PTSD. And so you you you know, they talk about the disbelief in the in the Wall Street cheat sheet. They talk about like disbelief. You just cannot believe that this run is real. You cannot believe that the run is real. You cannot believe that this run is real. But if you zoom out and you look at where we're at, like Anom said the same. He says also don't believe there is much reason to panic if that you've missed the move until now. If you believe that we are shifting into a bullish environment, then none of the coins have made all-time highs yet. And most of them haven't even left the accumulation range. And so generally, I would say that you're pretty early. Also, I mean, I think this is the this is the chart that I was looking at. I think we're in this disbelief stage where most people are just saying we don't believe it. We don't believe it. We don't believe it. I do believe it. I'm fully deploy I'm fully deployed at the moment. And as I tweeted the other day, I said I'm pretty comfortable with a with a portfolio that I'm holding. My portfolio looks something like this. This is pretty much more or less what my portfolio actually looks like. And by the way, I don't know if you guys saw the news on Coinbase today. So the actually the news came out yesterday. So, Coinbase is up 15% today. And the reason why Coinbase is up 15% today, it's the first crypto company in history to actually become part of the S&P 500, which is massive. Do you know how many SNP index tracking funds are now going to have to buy Coinbase? Uh, if they want to really track the S&P, when you get into a big index like the NASDAQ, the QQQ, the NASDAQ, um, if you get into the the S&P 500, you you're really into this elite club. And regardless, every single pension fund, every single provident fund, every single big fund who tracks the S&P 500 or wants exposure to the S&P 500 effectively has to buy Coinbase going forward. Whether they like crypto, don't like crypto, they're buying uh Coinbase. And it's the first crypto company in the world to actually do it. So, I think it's a massive, massive, massive achievement. Brian Armstrong says, \"Crypto is about to be in everyone's 401ks. Everyone, everyone's 401ks. My goal is that in five to 10 years getting into the coin 50 index will feel as good as this. Coin 50 means probably the the the the crypto coins. Um yeah. So this is this is a massive massive massive story. Anyway, now let's talk about so we said that you got to take a view and I think the view is that all coins are going to run. Uh I mean if you want to invalidate this view this is probably the only chart that I'd look at which is total 3 minus USDT. So you're actually looking at the real market cap of alts removing USDT divided by Bitcoin and you look at the bull market support bands. So this is the bull market support bands of total 3 USDT divided by BTCUSD. Ben Khan actually brought this to my attention. He says I think we will see old BTC pairs getting rejected at their bull market support band. If you want one final confirmation then this would be it right. If you want a second like confirmation, then wait for Bitcoin to break the alltime high. We're not far. I know it sounds like a wow, let's break the alltime high. Bitcoin's at 103 and the alltime high is at 109. Like it's 5%. If we break the alltime high, we're back in price discovery. And I think we could actually get there. I think we could actually get there. Otherwise, we have to be on on defense that maybe Ben Cowin was right and we actually do get we actually do go back and sweep the lows. But for now, my view is we're going bullish. I don't know if it's because I want to be bullish or because the data is actually telling me that that everything's bullish, but I'm bullish and I'm going to be bullish until two indicators or three indicators, but mainly two the top two indicators tell me that I must stop being bullish. Now, I I did say to you that I'm going to show you two things at the end of three things at the end of the show. One is I'm going to show you two indicators that are going to show you when this market feels toppy and then I'm going to show you exactly when Bitcoin is going to achieve its all-time high. And hint hint, it's very very close. It's like in the next couple of days. Literally, I'm I'm just looking at the date. Uh hold on. Let's just I want to phone the guy who told me about this. Hold on. Guy never answers his phone, though. One, everyone has that one friend that never answers his phone. This is the guy. Let's put him on speaker so you can hear doesn't answer the phone. [Music] He was on the beach, bro. I told you never. This guy, you know, like there's some people, you know, do you know that if you phone them, they'll never answer the phone. If you got that one phone call when you go to prison, I don't phone this guy. He's not going to answer. All right. He He answered. Yo. Bro. Yo. Yo. You're You're live on my show. Oh, no. Really? I took people a $10,000 bet that you wouldn't answer my phone call, but you did answer. Well done, bro. You lost me $10,000. No, I get $10,000. No, you lost you lost me. Uh, what date is Bitcoin going to hit the alltime high? Um, about uh was it 20 28thish of May to the 6th June? Okay. Two weeks from now. So, two weeks two and a half weeks from now, Bitcoin hits alltime high, right? Yeah. I mean, based on the M2, it's okay. Good. The data says I'm I'm not saying it. The data says it. The data says it. All right. I'm going to show you the data, guys. I'm going to show you the data. All right. Thank you, bro. All right. Thanks. Okay. So, let's talk about the indicators that are going to show us when this market actually gets toppy. Okay. So, first indicator is actually based on this chart over here. Now, you may look at this chart and think, what the hell is this chart? This is a chart of the open interest by coin. Open interest means the amount of leverage taken by coin. Blue is bitcoin. Uh orange is is is is others and green is e. There's the ether over here. Now when the others goes above bitcoin, you see so the bitcoin open interest is generally the biggest. There's the most appetite for risk in Bitcoin until a certain point here and here where the leverage open interest in altcoins in terms of size gets bigger than the leverage in in in in Bitcoin. You see like so all this time over here from July 23, September 23, November 23, let's actually go to altcoins and let's actually call up the altcoins. So here's a chart of the altcoins. Let's go back to 2023. Let's go back to 2023 and let's follow the date so that you guys can see it. So you can see that from July to November 23 until until March 24, the Bitcoin open interest was higher than the altcoin open interest. Now here in March 24, something actually happened. So let's go and see the total three. March 24, Feb, March 24, bang the top. Okay, the whole time this whole 2023, nothing happened here. We got here and it was the top. You can see that that corresponds beautifully with this chart over here. Here the altcoin open interest was higher than the Bitcoin open interest. Next one over here you can see for the period from 2024, September, October, November until December 9th, 2024. Let's go look at the old coin chart until I mean I don't even have to go there. can see December 9th, 2024 marked the top. What happened? What happened? What happened? Pretty simply, the altcoin open interest went above the Bitcoin open interest and that signaled the end of the altcoin cycle. Now, let's look at the pattern in this chart. You see, this chart does this like woo woo. Okay, wave 1, wave two. Oh, look at that. We're halfway through wave three. Let's look at what happened halfway through wave three every other time. Okay, look why bang bang without the AMG. Okay, you see that? So that's the first indicator that's going to tell us when this run becomes overextended. It's quite accurate. I mean, look here. Bang. Bang. See, stuck halfway. See, look here. There it is. Bang to there. Bang to there. And the last one, we're in the middle of a cycle. Let's watch this chart. You can get this chart um on uh coinalize uh futures data. And when you look at the chart, it looks something like this. Bang. You see it's the dominance by open interest. It's this chart over here. Okay. So again, we're going to watch when the altcoin open interest increases the Bitcoin above Bitcoin open interest. that will give us a time when the when the thing someone says, \"So alts are the are the indicator.\" Yes, when the froth gets too big on alts, that's when the market's generally going to crash. This has been quite a reliable indicator of when to sell. And if you this data doesn't go further back, but if it did if it did go further back, you'd see it's exactly exactly exactly the same chart. First thing that is the first thing that's going to give us an all-time high. Now, let's just for for fun, let's just follow these cycles. Would you agree with me that we're about here in the cycle? So like there we go. Like I would say we're about here in the cycle. So that was September 24 and then we had three months. So October, November, and December, right? And when did I say that the old coin cycle was going to peak? May, June, July, bang, in August. So this lines up with exactly the same thing about August. Okay. Next indicator which actually aligns beautifully to exactly the same thing. Okay. Now, so this is aligning to August more or less. It also it also tells you that we're not at the top yet. Now, let's look at another indicator. Here's an indicator. This is the chart of the USDT market dominance, right? So, it measures how dominant USDT is in the market relative to the rest of the market. Right? So, what is the percentage of USDT in the market? Let me just delete that that line. Very, very, very interesting. When you look at this chart and I'm going to put on the weekly fast just so that you can see it over here. You can see that this chart has a bit of a level and that level over here shows you that around when the USDT dominance hits a certain point. Usually that marks the all-time high or the top of the cycle. Usually okay usually can I mean we can be wrong here. It happened over here at 73,000. It happened over here. It happened over here and it happened over here. The the point here is at around 3.7 to 3.8%. So, let me just show you on the chart here at around 3.7 to 3.8% usually that marks the top of the cycle. Now, where are we now? We're at 4.5%. We're clearly clearly clearly in a downtrend. Now, how long is it going to take us to get from 4.5% all the way down to 3.7%. So, I'm going to draw a little scenario over here. I I mean I'm not I'm not an artist. So please don't uh don't don't think I am an artist. Um so let's just say that it does like like this like this like this like this like this. Uh something like that. Okay. Just like she very bad very bad. Where does it take us to? Takes us to around July August. So that shows us that it that if we carry on on this trajectory and of course things can happen and there could be bounces along the way. We could hit the 3.7 to 3.8% 8% which would mark the top of the cycle if we carry on a downtrend. I mean it can also just shoot higher but for now that shows us that we could get there somewhere around August, July, August which gives us another one. Next one is there's another indicator. It's called the GMI indicator. I'm not a big fan of the GMI indicator but it also lines up. It says so what is this GMI indicator? GMI indicator aims to pinpoint when Bitcoin is approaching a market top by evaluating various indicators. So there's this GMI indicator. Um it looks onchain metrics, macroeconomic indicators and stuff like that. And right now you can see that this GMI indicator al also hasn't topped. I don't know when it's going to top. I I don't really really really follow. But when three indicators are showing you the same thing, you kind of have to listen, right? You kind of have to listen. So to me, I'm taking my I'm taking a view right now. What would invalidate my thesis here? A breakdown on the charts. If we started to break down on the chart and we didn't put in a higher high and we didn't go onto um onto a price discovery, then I think there's going to be then I think we need to revalue. But for now, my chips are on up or down. My chips are on up uh in the long term and I'm placed I'm fully placed. All all my chips are down and I'll take some chips off the table if my thesis becomes slightly invalidated. Now, I also told you that I would show you exactly when the Bitcoin all-time high would happen. So, on that note, I was a little bit dishonest because I'm not going to show you. I'm just going to show you where you can find it. It's here in the Good Morning Crypto Newsletter. You can get this newsletter for free over here. You see, it's free over here. It's free. If you go and read that newsletter, uh maybe is there a news? There we go. Daily candle that gives you five trades every day. And Good Morning Crypto gives you a little bit more of a fundamental thing. everything that I talk about in the show before the show actually happens. Now, here in the newsletter, the guy that we phoned, his name is AZ. Um, not ass, bro. A as a AZ. Azreel. It's not ass. Azreel. Azreel. Cuz I say as you guys you guys you guys rip him off. That's not fair. Um, so as breaks down, why uh why when exactly Bitcoin is going to break a new alltime high? As you heard, it's going to be in the next two weeks. I think he's being a little bit conservative, but I'll give it to him. Read his analysis. It's all broken down exactly all over here in the free newsletter. Free. Free. Anyone can sign up no matter where you are in the world. All right. Look guys, another thing I promised you the Blofen for those people who signed up with Blowfin. I promised you that I'd choose a $5,000 winner yesterday and I completely forgot about it cuz we were moving so fast. So, have no fear because Ran is here. I have the list of all the UIDs that actually signed up. I'm going to randomly select. See, I mean, it's impossible to unrandomly select this. And I'm going to select this one over here. This one over here wins $5,000. So, if you sign up for Blofen, your username is 1 198271200061. Email us at giveaways@cryptobanter.com on the same email that you signed up for. Otherwise, we don't know that it's you and therefore we can't give you the prize. For those of you who haven't signed up, I'm going to give you until tomorrow to try again. Sign up to Blofen. Put any put just put $5 in the account, $10 in the account. Why? Because people are opening like multiple thousands of accounts cuz it's a nonkyc exchange and then uh if you win then you then then you you will I'll give $5,000 on Wednesday, Thursday, and Friday. Okay, I'll do that to So, you got three more chances to win. So, let's have one quick last look at the markets. I see Bitcoin is at 103783. I see Ethereum at 25 holding beautifully strong. I mean, you've got to give it to Ethereum that this this ETH move can actually take us higher. This is the move that's actually going to take us higher. This is the move. And I actually think I think ETH actually explodes next to be honest. Again, I think there's going to be like one little one more little explosion in ETH like a and that's going to take us to the next level. Anyway, let's we a look at the bubbles. Uh, still all red. Let's look at the stock bubbles. Oh, the stock bubbles look much better. On that note, Josh, who has also lost two games of table tennis in a row today. Um, Josh, when are you launching the new Bubbles, bro? Today. This afternoon. Today. Okay. This afternoon. Today. Uh, let's quickly just look. I see the researchers are sending me um uh how to play ICM. What is ICM? Okay, we have to talk about ICM. Um okay. All right. I will see you guys again tomorrow. It's been amazing being with you guys today. Until tomorrow, trade well, my friends. [Music]"
}