{
    "channel": "CryptoBanterGroup",
    "date": "2025_05_05",
    "transcript": " [Music] Okay, it's a massive week for Bitcoin. It's really decision time now. Uh either we're going to play out the Ben Cowan thesis and then start dropping and maybe even sweep the lows or we've got to get past this point. Not only on Bitcoin, it's actually on the S&P 500. We really are at a massive massive massive decision time, right? Either we go up from here and we break out or we're going to go down and we're going to test the low. So, I'm going to show you the argument in favor of both sides. I'm going to show you the argument in favor of going up and I'm going to show you what factors may actually cause the market to go down. And then we'll make a call as to whether we think Bitcoin's next move is going to be up or down. So, if that sounds good to you guys, I'm back. I'm back. I'm back. Obliterate the like button. Let people know I'm back. And let's get the show on the road, guys. Someone says, \"Yeah, we we're timing it with the New York open.\" Of course, that's why we come to you at this time because we know that the New York open actually opened. So, how did the New York Oh, there's 3 minutes till the New York opening, guys. Come on. There's 3 minutes till the New York opening. Currently, we are looking at8% down, which is not bad. And the reason why it's not bad is because if you look at what happened last week, we had eight or nine days in a row. 1 2 3 4 5 6 7 eight eight days in a row of massive upward movement. That is, if I'm not mistaken, let me just get you Let's just make sure I get you the right the right stats here. Uh it is Okay, so nine winning day streak. That's the first time since 2004 that this actually happened that we got a nine winning day streak. And so now the question becomes whether we're going to be going up or down this week. And uh um yeah, I'll show you I'll show you the two arguments. I'll show you the two arguments. The first argument is if you look at the Ben Khan argument. Basically, what he says is he says because every time that you get a death cross, and for those of you who don't know what a death cross is, it's when the 50 and the 200 moving averages cross, every time that you get the death cross, what he basically says is that the market actually rips up, but it never makes a higher high. So, you can kind of see it over here. Like you can see we had the death cross over here. market made a high went up from the time of the death cross got to this level here but never landed up making a higher high and it actually it's a it's a phenomena that keeps happening you can kind of see it over here if we go to this death cross over here you had a death cross over here and then you see we went up again but then we came down again we didn't quite sweep the lows uh on that one um here again we had the death cross we went up again didn't manage to make a higher high and then we went down and went way way way before the lows so if the Ben Cowan thesis is through then what you're going to be getting you what you're going to be getting at is you're going to start getting the breakdown. If you get a breakdown, we could start sweeping the lows. That's what Ben says. He says he also says that now this is the level at which Bitcoin needs to make a decision. So he says now that Bitcoin has rallied to where the initial breakdown began, I think there's a good chance we'll actually see a pullback soon. And you can see if you look at the chart, this is where the massive breakdown began. We went from 964 all the way down to 70. It was it was about 78 to about 78. Right? So that is the thesis for the breakdown. Right? So he's saying look his thesis this whole pump was put it a fake out or one of these golden one of these death cross uh fake pumps and now we're going to start going back down. And if we go back down he kind of said he said we'd probably sweep the lows again. The other thesis is the more broad thesis and and specifically I don't know if you guys watched this episode that I dropped yesterday. This is the episode that we shot at the um token 2049 event. And I must say the one thing that got me at the token 2049 event uh this for those of you who don't know which video that is. It's this one over here. I interviewed Arthur, I interviewed Railpool and I interviewed Joe Macccan. And they hadn't it wasn't like they spoke to each other or they pre-planned it or or something like that. But the interesting thing was I said to them, \"Guys, are you bullish? Are you bearish?\" And they said to me, \"We're bullish.\" And I was like, \"Okay, cool. How bullish are you?\" And they all said this unprompted. Like it's not like I prompted them or they spoke late or or whatever else. But but they said max bullish. They used the words max bullish. So all three of those guys, all three of those guys all came out and said, \"Not only are we bullish, we are actually max bullish.\" Arthur Hay said they are max allocated. Uh Joe McCann said they're max allocated also. So now you've got like three of the in my mind three of the biggest minds in the space. So three of the best minds in the space that are all max bullish. On the other side you've got Joe M you've got Ben K from into the cryptoverse who says look he hasn't bought this thing yet. Um that was there was there was a video that I made with him not so long ago. I don't know if you remember that video where he where he actually broke down uh that thesis. It was actually if I if I if I remember correctly it was this video over here. Bad news this crypto pump won't last. So that is that that's the the two different thesis. One is that this is a death cross relief bounce. And the other one is that we're actually now catching up to the M2 money supply. Now generally the M2 money supply has between a 90 and 108 day lag between the time that the M2 money supply starts going up and the time that Bitcoin starts going up. And if you take a closer look at this chart, I'm going to make a I'm going to make a video this week specifically around this uh thesis around the M2 money supply because I've actually taken some time to study the M2 money supply and I'll make a video this week. It'll be a very special video and I'll actually show you I'll actually show you what it is. Anyway, let's quickly look at how we finished April because remember when I left here, we had 8 days of a of a NASDAQ market pump. So on Bitcoin, actually, if you look at the monthly analysis, Bitcoin actually had a decent month in April. It was 14% up in April. I can't say the same for ETH. I I I can't say the same for ETH. If you look at ETH, 1 2 3 four bad months in a row. Um it's very rare that it's that that ETH has had four bad months in a row. I think that 2018 was the last time that that actually happened. It had four bad months in a row. Um so far in May, it's obviously 75% up. There is a little bit of a little bit of actual of actual strength strength in ETH. What we saw though was towards the end of April we saw massive buying which actually pushed the numbers up. So if you look at the Bitcoin chart and you go to the end of April. So you can go about here. So here you can see from the 18th of April we got these massive pumps in Bitcoin and those pumps were mainly spurred by um the ETFs. So the ETFs had the biggest inflows of 2025. You can see those are the the the ETF flows. If you look at the numbers around the ETF flows, I think about 2.9 billion actually flowed in last month. So 2.9 billion actually flowed in last month, which was the biggest month that we've had since January. So the biggest month in January, we had a 5.25 billion inflow. So it looks like people last month actually started coming back to crypto and to Bitcoin. And the reason why people started coming back to crypto and Bitcoin is because they actually started going back into traditional markets. after Trump's tariff fears and tariff wars and whatever else, people actually started going back into traditional markets. And you can kind of see that over here, right? So, we had a 9-day winning streak, which is the first time since 2004 that we had a a winning streak, uh, a 9-day winning streak in in in the S&P. Um, not only that, like I said, the ET the Bitcoin ETFs had one of the biggest months of the year. the ETFs, the the the S&P ETFs saw inflows of 21 billion last month, which is the largest in history and the fifth largest for any ETF ever. So, it does look like people scrambled out the markets and now are scrambling back into the markets. Uh specifically, uh retail investors, but the S&P is actually also at a decision point, right? So, we had we've got Bitcoin at at some kind of decision point now, but the S&P also at a decision point. Why? because we have gone over the 50-day moving average. Now, we got to try and get over the 200 day moving average. When you look at the NASDAQ, that chart is actually even better because what you can see when you look at the NASDAQ is that the NASDAQ is over the 50-day and now challenging the 200 day moving average. And so, both on the S&P and on crypto, we've got decision points. Bitcoin is it going to play out into Ben Kong thesis or is the Ral Paul Joe McCann and Arthur Hast thesis going to going to take take uh take the winning the winning run here or uh and for the stock markets are we going to get over and close over the 200 day moving average both for the NASDAQ and the S&P and there's of of course there's a big event this week you all know that there's the massive event this week and that is the FOMC uh meeting this week it's happening obviously on Wednesday night uh Wednesday night we at Pal talking about whether or not he's going to increase interest rates. So, it's going to be super interesting to understand what what what PAL actually says. The market is pretty much saying that there's going to be no rate cut. There's a 1.8 1.8% chance of a rate cut and obviously a 98.2% chance that there's going to be no rate cuts. So, I I reckon no rate cuts for sure, right? Why? because well at least going into the FOMC we have Trump saying that he's not going to try and and cut Trump's uh pal's pal's time as chairman and I think that that's one of the questions which will actually start coming up you know that that how power will answer he'll just say oh you know we are we are completely independent we are completely independent you you know how it is anyway so um uh Wednesday night big night probably no rate cuts I think also probably no news around quantitative tightening you'll remember that last month they slowed down quantitative tightening quite a bit. Why? Because they were scared that because the US has reached their debt ceiling and they can't borrow anymore unless they get the Senate the Senate approval. Then the Senate and the House need to approve it. by the way. Um so they are now in a position where they have um where where um they probably can't reduce quantitative tightening anymore and they probably won't reduce uh interest rates right unless they come up with a crazy surprise. I mean the one thing that you can say about interest rates is if you look at trueflation trueflation is saying that the US inflation index is now 1.45%. So you got inflation which is very very low. At the same time you've got the oil price. I don't know if you guys have been following the oil price but the oil price is a very good predictor of recessions and also a very good predictor of CPI. And if you look at the oil price now oil price is down at $57. Now to give you some perspective the last time that oil was at $57 was just after CO. It was in April 2021. That is the last time that oil got to $57 a barrel. Oil is the great predictor of the economy because oil prices trade up when economies are are going to be stimulated or when markets believe that that economies are going to be stimulated. So it's a very very very good sign and right now this is telling you that that a slowdown is coming and because so many products actually land up using oil either to deliver or to produce in the factories and stuff like that when the oil price is at at 57 and the inflation is at 1.45%. you kind of say to yourself, well, Pal doesn't really have any excuse not to reduce rates. And probably on the day of, Trump's going to basically reach out to Pal through Twitter and saying, you know, Pal has to start dropping rates now. This is uh this is terrible. How can he keep how can he keep doing rates like this? So, look out for for what's going to happen. I don't believe there's going to be any fireworks. Obviously, we'll be live with you guys uh doing the FOMC. Um, and I think the reason I think now Trump shot himself in the foot. And the reason why why Trump shot himself in the foot is because if he hadn't threatened with these tariffs, Pal would probably have some kind of of stability or or ability to to forecast prices going forward. But now Pal cannot forecast prices going forward because he doesn't know what the tariffs are going to be tomorrow. And the tariff situation keeps changing. I must say I saw this one today and like it absolutely blew my mind. Like Trump is now imposing a 100% tariff on all movies produced outside the USA. I mean like that like like I get I get this trade war but he says the movie industry in the US is dying a very fast death. Other countries are offering all sorts of incentives to draw our filmmakers and studios away from the United States. Hollywood and many many others areas within the United States are being devastated. This is a concerted effort by by other nations and therefore a national security threat in addition to everything else messaging and propaganda. Therefore, I'm authorizing the Department of Commerce and the United States Trade Representative to immediately begin the process of instituting a 100% tariff on all movies coming into our country that are produced in foreign lands. We want movies to be made again in America. Now, look, let me tell you the reality of making movies in America. Movies in America are made in Hollywood. Hollywood is in California. California is owned by the Democrats or or or run by the Democrats. When you make movies in California, there are things like uh unions and minimum basic hours and minimum expenses and it's a very very very costly process. And what people are realizing is that they can go to other places like Cape Town, like Europe, and they can actually make movies as good much much much cheaper even when you include flying out the talent and the directors and everything else to make the movie. So, I mean, if you want to instead of imposing a tariff, just make yourself competitive again. And so, I think that this is like like really what Josh, what do you think? Like tariffs on watching movies, movie made in China or half made in in in the UK. Okay, those movie tickets cost double. It's crazy. What? You going to go to you're going to go to a theater and like if you want to watch like Mission Impossible, which is made in the United States, you paid like $20 a ticket. And then you're going to want to watch like a your kids are going to want to watch some cartoon which was produced in India and that one cost you double to watch. I mean I think I think that that's that that this is a bit too far. Anyway, another reason why we could actually have some action this week is because the I'm hearing I'm hearing things. I'm hearing that um I'm hearing that SQD will be listed on a European on an American exchange. I'm not telling you which exchange, but it's a it's a nice big blue American, proudly Americanamean exchange. Also, I'm hearing that the first tariff deal will be announced this week. So, sometime this week, we're going to get a a huge tariff deal. And I wonder if Trump is holding out for FOMC to announce the tariff deal because I I I've heard through people close to the source. I won't say exactly which source, but I've heard through people that are close to the source that um that there is going to be some kind of announcement this week uh around some trade deals. Apparently, one it's one of the major countries and apparently it's already been done. It's already been done. So, it's already been done. Um also, we heard this morning that the Japanese who are the biggest holders of T- bills basically said that they're not going to be dumping US T bills as part of this trade war. So that that's quite a good thing cuz it'll keep the the T- bill rate up. Anyway, all of this was actually written in our newsletter today which is a free newsletter which comes out before the show. So imagine like you can get all the information or everything that that I'm speaking about here. You can actually get it before the show. All you do you go to the show and you go to here and you click on the icon that says good morning crypto. So you go here and there's an icon that says good morning crypto. So here it is daily candle and good morning crypto. Daily candle has five charts. I saw today was Athena, Hyperlquid. Uh let's just quickly see what the five charts were. Trading five old coins today. Athena, Hyperlquid, Pudgy Penguins, Fcoin, Vigils, Protocol, and Uber. So you can go and look at those charts. You can see if they're buys or if they're sells. And good morning crypto is just the the general good morning what's happening in crypto world. So when you wake up in the morning in the United States, you have this thing waiting in your mailbox. And it's free, by the way. It's free. Anyway, let's to let's look at another decision point in the market. The other decision point in the market is actually altcoins, right? So, we had a a very big month for some altcoins. So, you can look at like last month if this is on the monthly on bubbles. This is why we had quickly look. Oh, the stock market looks like it. Oh, no. That's that's that's the monthly. You see Warren Buffett announced that he's going to resign as CEO of Berkshire. Obviously, he's 95 years old and you can see what's happened to the Burkshire share today. Such a stupid I mean, what did they think? he was just going to stay at Berkshire Haway till he's if the market is truly forward-looking, right? Surely they could look to the future and say the guy's 95 years old. He's going to retire at some point if he doesn't die. Like I mean he's going to I mean I'm not I'm not being horrible, but you know what I'm saying like like he's 90s something. When you're 90ome you can't be running a company. So effectively you let me let's just see how the S&P's opened. So S&P is down8. Dow is the Nasdaq is down 86. Dow Jones is down42. The new bubbles is launching in five days, Josh. Five days. We're launching the brand new bubbles. Even though we've already got stocks, we got crypto. Everything's going up. So, crypto, when you look at the last month, big month, good recoveries. I mean, a lot of these are [ __ ] coins. Pingu, fcoin went up. But Hyperlid went up a lot. It really is showing a lot of strength now. Uh, Radium went up a lot because they launched that pump fund competitor and because Salana's up 20%. Virtual Protocol did very well. Sooie did very well. As I told you, it was going to dump after the event. Let's just quickly see what happened after the event. So, there was a Sooie event last week. Quite a good event, I must be honest. They announced that that handheld um um you know what I'm talking about. Um handheld gaming console. So, you see SUI went up. It dumped after the event. Let's see if they can actually keep if they can actually keep this momentum. I also told you last week that Trump would go down. The Trump coin would go down. Why? because they've yeah you see the Trump coin has gone down from 16 to 19 because on the 12th I think is the cut off for people who want to go and have lunch with um with with Trump. So the decision time on altcoins is pretty clear. So you got Bitcoin dominance now um Bitcoin dominance now is at a cycle high 64.7% which means that this whole run has actually just been Bitcoin and not altcoins. Altcoins haven't actually been following and you can see it's decision time. Either we're going to smash through this line or it's going to come down again back into the channel. And even if it just goes back down to 62, we'll take it. We'll take it. So, I mean, you can see that even though we had some alts moving last month, you can see that that most of the coins um only 20 20 coins outperform Bitcoin. 24 coins outperform Bitcoin. Is it 24? No, it's not. It's it's not 24 coins. It's three coins. XMR, which is Monero, Tron, and FTN, those are the ones that outperformed. Oh, no, these also outperformed Bitcoin over the last 90 days. So, TOAO, I'm sure Hyperlid also performed. You can kind of see that over here. You can see the best performers. So, uh AI, Tao had a run, Hyperlquid had a run, Suie had a run, SE had quite a good run, Slan had quite a good run, and then obviously Bitcoin. Um, so it it is decision time now. So either we break we go through this line and we carry on going to cycle highs or we break down below this line. I think a lot will happen this week even though I'm not expecting much from the FOMC. Um, I do see a lot of charts actually pointing to the fact that something's going to happen this week. Um, the the other chart which I saw which is actually quite interesting was this chart over here. It's the gold miners ETF versus Bitcoin. So, so it's when the gold miners peak, Bitcoin generally starts, Bitcoin dominance starts to break down afterwards. So, the question is whether this last move in gold was actually a peak. That's what we got to look at. Was this last move in gold actually a peak? So far, that 3,400 range on gold was actually the top. Like, I think it's like you can see it's it's 35 or whatever it was, 3480. Um, that was actually a top and now we're back at 3316. So again, I think it's decision time here. Is gold going to break down or carry on going up? And is Bitcoin going to follow or is Bitcoin not going to follow? That's this is what we have to um this is what we have to decide. So I mean do we print this wedge here over here. So that is I think what's going to happen um this week. I also want to talk about something else. Um I see a lot of people are posting only 6% of the world's population actually own crypto. And the numbers are are more or less true. Like the last analysis that I did, there were 560 million wallets. I think that if you just quickly ask chat GPT, let me just see if I can open up a chat GPT and we can ask chat. Chat GPT. Let's see what chat GPT says. Um, how many people in the world today? Let's see what chat GPT says. Chat GPT is searching the web. I mean, I could have searched the web much quicker than Chat GPT. Lots of pictures. 8.2 billion. Which means that I've been seeing these tweets that say like only six only 6% of the world's population own crypto. You're still early. I saw it a few times and I you know, like one thing I hate is I hate these sensationalists tweet like you're you're you're still early. you're you're still early, which are not backed by data. The data actually shows that you're actually not that early anymore into Bitcoin. So, I look to see what is the the population that own crypto and it's between 6.8% and 8.2%. So, the numbers are more or less right. But if you do the same thing for stocks, only 10 to 15% of the world's population actually own um equities, right? So if you say like the number of or the the percentage of crypto investors is going to be one day equal to percentage of stock investors then there's only about 100% upside in terms of of the the the size of the population. If you say that Bitcoin is going to become like money and I don't think it is going to become like money. I think it's going to become something like gold or equities then you know 15% of the world population own gold in some shape or form. So, it's not that early anymore. I think specifically when it comes to Bitcoin, I think when it comes to altcoins, you may be uh you may be a little bit early. You may be a little bit early. All right. So, that's that for today. Also, I was quite proud to read this. Um was quite proud to read this. You know, our partners, we're partners with Kebras and um there's a scam that's going around. I don't know if you guys have seen it, but a lot of the influencers are getting caught out in this in the spam. How this the scam how this scam actually works is they send you this thing saying, \"We're lining up guests for a new podcast. we'd love to feature you on up and cominging episode. It's an exclusive editorial invite and then what they do is they send you a Zoom link and you join the Zoom link and then they take control of your computer and they drain your wallet, right? And the founder of Kebras, his name's Alec, Alex Catz, he actually picked this up and the way that they pick it up is that they've got this piece of software which is called KBas. You can download it here. And what it does is while you are surfing, it searches the code in websites to see if they're likely to drain your wallet. if it's got wallet draining code. So, it doesn't come off a list that's that's that's uh not updated and whatever else. It actually looks at the code of websites that you're surfing and sees if there's wallet drainers on there. So, now this product is free. You download it for free. Basically, they do take like a a tiny a tiny percentage commission when you do trades through certain derivatives exchanges, but well worth actually being protected. Again, there's a link below if you if you want to try it. I I would definitely definitely definitely use this. Um yeah, for sure. All righty. Um lastly, um so a lot of people are talking about selling May and go away and whether or not um selling in May is a good idea. Now to make a long story short, I don't think selling this May is a good idea. Um the reason there's a lot of reasons for it, but I broke down the reasons for it in a video which I made. You can see the video over here. Let me show you. I think it's worth listening to, but more importantly, I want to talk to you guys about this video. So this is the video. The video is called Salin May. It is 40. It's had about 42,000 views. I want to just show you what is so unique about this video. Let's look into the data I have here and what has been happening to understand why this year might be the exception and why selling in May could be a costly mistake. I know you all remember this and probably will say, \"Didn't you just say remind me to sell in May in this tweet here?\" Yes. Yes. Hold on. I'm going to walk you. So the interesting thing about this video is first of all, it's a very interesting video. It's got all the data. But the more interesting thing about that video is that that video was completely made by AI. So when I say completely made by AI, it was scripted by AI and my voice is an AI voice. But the way that it's doing it is it is listening to all my previous footage and it's listening to all the front runners research calls and then it is making videos. Now, we're going to make a lot of these videos going forward. And the reason is because AI can probably do a lot better and a lot more thorough research without any emotions than I can do or anyone of our researchers can do. So what what you're going to be seeing and we're going to put them in a separate playlist which is AI generated videos. What you're going to be seeing over time is we're trying to transform our business into an AI business also. And I want you guys to be part of the journey. So you'll see a lot of videos where I mean we we we're testing one now which is actually me. It looks like me and it's trained on all my data and we're trying to create a run AI. So you'll be you will be seeing it. And just to keep you guys safe, we're going to put it into a different playlist which is called an AI playlist so you kind of know which ones are AI generated and which ones are real. We're obviously not trying to to um to make you believe that the one is uh uh me. I want to show you which ones are the AI videos. And hopefully very soon we can train an AI that can actually be smarter than me and actually have my striking good looks. Imagine that. Anyway, I will see you guys again tomorrow. If you haven't watched the sell in May video or the the video from token2049, I strongly strongly strongly recommend that you go and watch this. See you guys again tomorrow. Until then, trade well, my friends. [Music]"
}