{
    "channel": "CryptoBanterGroup",
    "date": "2025_05_09",
    "transcript": " Uh, you better go out and buy stock now. Let me tell you, this this country will will be like a rocket ship that goes straight up. This is going to be numbers that nobody's ever seen before. Uh, that's a very important element of all of this. You know, if we get that, if you don't and and the Democrats are fighting it, what what else do you need but the president of the United States telling you to go out and buy stocks? And that's exactly what he says. And when he said that, this is what happened to the markets. And it's not only crypto markets, it's pretty much every market absolutely exploded. Just look at these green bubbles. You got ETH up 20%, you got Athena, I'm going to say that again. You have ETH up 20%. I'm going to say that again. You have ETH up 20%. You have Athena up 26%. You have ETH memecoins going absolutely absolutely parabolic. We have to spend some time talking about this pump because when you get the second biggest uh uh asset in crypto going up 40% in two days that could mean the beginning of uh of risk of risk on and now we are seeing a lot the the beginning of risk on a lot of you are feeling left a little bit sidelined. I know I've spoken to a lot of people today a lot of people in the discord groups and stuff like that who are telling me they are feeling sidelined. One of the things we're going to address in today's show is if you are feeling sidelined now, what is the correct move? Should you be buying now? Should you be waiting? Are there tokens that are undervalued? We got a massive show today. We were going to do a Friday banter, but on a day like this, I just want to [ __ ] talk about altcoins. So, if that sounds good to you, you know what to do. You're going to subscribe to the channel. You're going to obliterate the like button. And I'm going to get the show on the road. Let's go, guys. You know, on a green day like this, I couldn't think of anything else. And I couldn't think of anything worse than dropping a pre-record pre-recorded interview. So, we'll drop the pre-recorded interview at another time. Today, we're going to talk about old coins. We're going to talk about we're going to DJ into shitcoins together. We're going to talk about a green pump because the truth is we deserve this. We deserve this. We deserve exactly what we're getting here. Because if you did hold on and you did buy when the markets were low, now you're getting some kind of benefit from it and you basically deserve everything that you've got. Big question, how long is this going to last? What what should you what should you do if you're sidelined? Is there anything else that you should be buying? All those things. All those things we're going to answer today. So, obliterate the like button. Just before we get into the show, I remember we did this thing with Blofen yesterday where if you signed up, you could win $5,000 by the end of the show. But then we wanted to to make it fair because the spreadsheet wasn't updating as quickly as we wanted the spreadsheet to update. Also, there's some people that were watching yesterday's show within 24 hours. So, at the end of the show today, just to make it fair, we will select the $5,000 winner. Okay? So, um just to make it fair, by the end of the show, we will select the $5,000 winner. You've got until the end of the of the show to sign up. They are updating the spreadsheet for us absolutely live. All right, ladies and gentlemen, let's go. Let's talk about what's going on on the markets. I've actually got a big surprise for you at the end of the show. something I think you guys are absolutely going to love. Especially if you like AI trading. I think that you really love what I'm going to bring to you at the end of the show today. All right, let's talk about the markets. Let's talk about what's going on. Let's bring alpha. You bring likes, I bring alpha. You bring likes, I bring alpha. Simple as that. So, as I said to you, I mean, I think we got the green light. And who who I mean I mean, you got the green light from the president of the United States. He's basically said to you, you should go out and buy the stock market now. Which is quite funny because a few weeks ago, he or a few days ago, he was saying something like this is Biden's market. I wonder if he still thinks that that this is Biden's market. Anyway, when he did what he did, when he said what he said, you see that uh the stock market went up, but the real action wasn't actually in the stock markets. The real action actually happened in the crypto markets. We added 235 billion in 24 hours to the crypto market, which is a massive, massive, massive number. Bitcoin above the $100,000 level. In fact, this morning when I woke up, Bitcoin was here at the at the highs. was at 104,300. Um, and now we are not very far from the all-time highs. I mean, if you look at the all-time highs, remember that the all-time high was just a wick and that wick went up to like 109 depending on which which exchange you're looking at. But the actual all-time high close is actually 106152. So, it depends whether you're looking at the all-time high candles or the wicks or whether you're looking at the candle itself, right? But if you're looking at the candles, we're like $3,000 away from the all-time high. And we were like $2,000 away from the Bitcoin all-time high. When we go over when we go through the all-time high, two things actually happen. The first thing is we put in a macro higher high, which is like that's like we've broke anyone that tells you there's a bearish structure after that basically makes it invalidated. Whether it's Ben Cow and whether it's anybody else, it makes any bearish structure invalidated. Now, some people could say that if we broke down here that we actually put in a lower high. Some people could say that even though we put in a higher high over here, right? And we put in a higher high from here, etc. But people I mean, you could get people like Ben Khan arguing that that we're not actually um that we actually haven't put in in the higher high. Second thing is we go back into price discovery again. And you know, you know what happens to assets when they go into price discovery. There's nothing. You basically can't stop you basically can't stop them from getting into into new prices. And so what we're getting now is we're getting the markets absolutely running. We're getting the altcoins absolutely absolutely green. Just look at these altcoins. I mean some crazy move. Look at this. UniS swap up 20.4%. Pepe up 35%. Uh Brett up 25%. Athena up 25%. We're going to talk a little bit about Athena a bit later today. Uh if you go into second the memes flying Ian layer 35.2% up P up big big big big big big big big numbers going up here. So everything is going up. Hardly even a red bubble. While we're here, let's just quickly look at the stocks. Also, stocks also looking good cuz Trump said we should all go, we should all go and buy this. By the way, if you want this banter bubbles, you got crypto, you got stocks, you got the newsroom, everything all all in in one tool. One of the most use one of the most useful tools on the market. Uh, also interesting to note that yesterday Bitcoin or now Bitcoin overtook Amazon. So now it's only Nvidia, Apple, Microsoft. Then it becomes bigger than the than I think all the companies in the world and then it's just and then the next asset that we have to chase is we actually have to chase down gold to become the biggest asset in the world. So we are the number five biggest in the world if you if you if you compare it to companies. But as soon as that happens, we actually become the biggest asset class uh in the world. Anyway, let's talk about the real pump. And that real pump is this ETH pump. This ETH pump is is is the one we should be talking about. And there's a good reason why we should be talking about it. We have ETH up 40% in in two days, which is unheard of. And a lot of people are asking why the hell this is happening. So, let's talk about why this is happening. The first thing is ETH was completely completely completely oversold. You'll remember that the last time Bitcoin hit the all-time high, which was somewhere around here. Bitcoin was at 109. And when Bitcoin went down, Bitcoin went from 109 to a low of 74, which is a 30% correction, a 30% dip. Now, just look what happened to ETH at the same time. I don't know if you guys I mean, I was in this ride. I got liquidated along the way, but ETH was down 70%, 66%, right? And so, what you can say is you can say that ETH was very, very, very oversold. It it had been hit unnecessarily hard. And so, and it had been oversold completely. and and that's why the recovery for ETH is a lot faster. But that's only part of the reason, right? The other part of the reason could be the fact that there was a petra upgrade. And we spoke the other day and we said, look, this is the first time that ETH has gone into an upgrade and not pumped. When it went into the Shanghai upgrade, it pumped 86% for the few days before. When it went into the Dencoin upgrade, it pumped 113% in the 3 months before. Yeah, ETH didn't pump except for now, we catch we're getting this this catch up. So that that could be another part of it. Then there's there's a third part of it that we should talk about and that is that the fact that a lot of people were actually short ETH and the reason why they short ETH is because most people actually wrote ETH off ETH ETH off. And if you've written asset off and you want to hedge against the market, you could do what most traders do and you can go long Bitcoin short ETH. That way you remain market neutral, right? Because if one goes up, the other goes down. And all you're betting against is you're betting against the delta between the two assets. And a lot of people applied that arbitrage on Bitcoin, but more people actually applied that arbitrage on ETH and Salana. And so I don't know if you remember this interview we did with Joe McCann at token 2049, but remember what his strategy actually was. Just listen. More and more of those flows go into Bitcoin. You have to be overweight Bitcoin. Period. Now Bitcoin. Yeah. So Bitcoin, we're short ETH. I see no reason to own it. We have it as a hedge in our portfolio. Fundamentally, I've been saying this for years now. There is no reason to own the asset. The technology itself was like the Blackberry of smart contract platforms. There's better L1's out there. Obviously, I'm a Salana bull, but there's better L1's out there that bring real utility and use cases for mass adoption versus Ethereum. All right. What else? So he you see his trade was he was long uh long Salana short ETH which means that theoretically if the market moves up or down doesn't matter to him all he's betting is that Salana is going to outperform ETH and he's not the only one that was actually into that trade. Now, for those reasons, for the reasons that most people actually wrote off ETH, what happened, what landed up happening on ETH was there was a massive buildup of shorts on ETH. And what you can see happened in the last 24 hours is that there's been massive, massive, massive liquidations. And primarily, the majority of the liquidations were shorts that were liquidated on ETH. So, we very seldom do we get a picture like this where we get ETH on on this side of Bitcoin. Usually, it goes Bitcoin then ETH. Now, you can see it's ETH. And if you look at the liquidations, if you actually do a little bit of homework here on the liquidations, what you can see is that the liquidations were all shorts and pretty much all ETH and pretty much were the biggest liquidations that we've had as far back as this as this calendar actually goes. So, I mean, this is since since probably February 2023, this is the biggest liquidation that we've ever had. And the liquidation was the short liquidation on ETH. Another thing as so as a result of that and I still think that we may be that that the entire ETH short trade may not be closed. Okay. So and and and I think that we we have a very very very good chance of actually having a second leg to this pump. And let me explain to you where the second leg to this pump actually goes if we land up happen if if we land up having a pump this weekend. So, if the markets close green today, the stock markets closed green today. And I think if you look at at where the stock markets are, uh, stock market stock markets, they they're up.5% on the S&P as you can see over here. If the stock markets close green today, and I think they will close green today, then we go into the weekend. On the weekend, there's lower volume on the weekends, right? In which case, what can happen is you got the CME. CME is where a lot of the futures are traded. So futures can be traded on crypto exchanges, but the majority of the institutions actually trade futures on the CME. Now, here's what happens. We go into the weekend with ETH trading at $2,400 or or whatever it is. They use the low liquidity weekend as a chance to actually pump ETH. The minute the CME futures open on Sunday night or or or Monday morning or whatever time zone you're in, that then pushes the CME into liquidations. and those liquidations basically start cascading. So if we have a positive weekend this weekend, then I I I can see ETH going as high as 26 2650 as this as the short squeeze actually continues to go. Now look, I know I'm I'm not I mean I've got a small a small ETH position relative to my portfolio, but the majority of my of my wealth is not currently sitting in ETH. Regardless of of whether you're holding ETH or not holding ETH, I think the one thing that you've got to appreciate is exactly what Chris Berninski said. He says ETH the ETH rally is good for every asset uh and and protocol in the space. Love to see it. He's right and specifically it's good for every type of risk asset because this becomes a barometer for risk. So Bant General says insane move for ETH. This is a kind of this is kind of giving me full-blown risk on vibes. the consensus trade for risk seems to be the ETH trade or let's put it this way people are saying listen if ETH can rally after ETH has been so badly killed then this is a good sign for all risk assets and that's pretty much exactly what you can see is going on here so first soul was very very very much lagging you can see it over there and then even soul actually just woke up and I was like okay bang we can go you can actually see that if you if you go to the soul eth chart so let's we can just go to the sole eth chart and you go into the hourly. You can kind of see how long soul lagged ETH until about 1 2 3 4 5 6 hours ago. There was a a massive reversal. People said, you know what, this is actually not an ETH move. This is actually a a risk on move. And so now you got this risk on move and that is causing everything to basically go fully fully fully green. Especially what you can see running here are the ETH betas. So, if you look at the ETH betas here, you can kind of see like the ETH meme coins. I saw Mog was absolutely flying. Also, because Elon put the the the the Mog glasses as his profile picture. Actually want to see if it's still his profile picture. Let's quickly just have a look here. Uh Elon Elon Musk. Let's see if he's still got the M glasses as his profile. Oh, no. Oh, wait. That's Elon Musk news. Why is this being so Here we go. Where is he? Oh, yeah. Okay. So, he see there we go. He's got the Mog glasses on. And that's that's why Mog uh went up like like it went up. But I mean, pretty much massive moves from everything, especially especially especially the meme coins and the ETH bases. One thing to pay attention to is what Rick Capital says. He says, \"Look, ETH has broken into the range, the 22 to 3900 macro range. As long as it stays above 2200, it will be positioned for it will be positioned for higher prices in the range. History suggests that any retest of 2200, which it's already done, would result in a bullish price outcome over time. So basically, the consensus trade now is that ETH is back and there's a lot of there's a massive short squeeze that can actually happen. So be careful. There could be a massive massive massive short squeeze that uh that that that that actually lands up playing out. Anyway, regardless of so that that is the the big ETH the big ETH trade. I think that's probably the big story of the day. Regardless of whe what the big story of the day is, I think the sentiment has come back. Two green candles and we're absolutely absolutely back. You can see we're now back. The sentiment is back at greed. Not extreme greed yet. So not time to actually start selling anything but certainly um you can see that the sentiment is that on the stock market. If you look here the risk appetite is skyrocketing. According to KBCI letter, the options volume reflected 67% of the total options on Tuesday. Uh over the last three years, the the volume of these risky trading options has actually doubled. So he's talking about risky options that have actually uh and and the risky options in the stock market are showing him that basically the sentiment has flipped. Also, I think there's a massive catchup trade from all the fundamental news that we've had in the last couple of days. Like Stripe launched stable coins. There's now stable coin legislation that is on the way. Robin Hood is building its own blockchain. The biggest deal in crypto history. Coinbase, I didn't realize it was the biggest deal in crypto history, but it did. Coinbase acquires Derbit. What an amazing company. 11-year-old company getting bought out for getting bought for uh $2.9 billion. And you know, I'm glad that as Banter, we actually played I think I'm not going to say a big part of it, but we played a part in helping people meet Derbit. We did all the Derbit tutorials. Very proud to see that what these guys have achieved. And I tell you, those guys are are the real deal. I just hope to be honest I really really really just hope that they don't become like this American bureaucratic company cuz like that's the worst thing that can happen to Derbit. Deret is like this innovative amazing company and if they become like an American bureaucratic company don't think that that that will be very good. Also in the office of the currency controller, they have um they now said that banks can actually custody they can buy, sell, and custody crypto for their for their clients, which was something that the Biden administration actually said they weren't allowed to do. Listen, here at the Office of the Comproller of the Currency, we confirm that national banks and federal savings associations may engage in certain cryptocurrency activities responsibly in order to serve their customers. So, they can now do that. That's come that comes from the office of the currency controller. Um, Bitcoin sentiment is high. Spot buying is actually high again, which again is a is a bullish sign. Um, I think the main thing here is just to be able to identify when things are bottoming. And now you don't have to identify the actual bottom. You just need to identify more or less when the bottom is. And I think to be honest, we did that pretty spot on on this channel. I think uh Julian Ble um who's one of Raal Paul's partners I think he also did it very very very good um remember two weeks ago was the first time that we actually published a portfolio like we this whole entire bare market or or or bare period we never published any portfolios until two weeks ago when I said you know I'm comfortable to actually publicize a portfolio now because I think this is the right time to actually be buying now if you would have bought that portfolio you would have been up just above 23% actually even more some of the tokens your portfolio would been up like 90% or whatever, but we'll look at that a bit later. But it just shows you the importance of being able to sus out bottoms more or less. And I think we've called it spot on. Um I think now um we could be getting into this banana zone, this banana zone, and we could just be tracking the M2 money supply, which again, I think Ral Paul's actually called it spot on here. He's like, we're going into the banana zone now between now and August, he says. We'll talk about that in a second, but also we could just be following the M2 now. Now, the correlation between Bitcoin and M2 actually looks freaky. And you remember that less than a week ago, I did a show where I said, I think the market's going to pump because the lag between M2 and Bitcoin is X X amount of time. And now we've actually had that X amount of time. So, I think that's pretty big. And also remember, we've got a big catch-up trade to catch up to digital gold. So, there's a lot of uh uh tailwinds which are pushing us which are pushing us forward. Now, the question is, how long is this pump actually going to last? like is this a pump that's going to last a week, a month? Is this now are we completely out the woods? Let's talk about that for a second. So remember, a lot of people have been caught sidelined here. Uh why? Because the market was so bearish, there was a ton of sideline capital. And now that sideline capital's got to make a decision as to whether it's going to get into into the market or not get into the market. And ironically, the higher up the market goes, the more likely that sideline capital is going to start flowing into the market. So, if the pump continues for another couple of days, then you can expect this pump to get really, really, really aggressive. It'll be a combination of sideline capital FOMOing in, people's PTSD being worn off by the fact that prices are now going up and they're getting more and more and more confirmation of this pump. Um, and so when you combine when you combine those factors, you can kind of say that if this pump continues for another one or two days, we could get a sustained long-term pump. I'm going to say a sustained long-term pump. I think Ral Paul actually might be spot on here. Why? He says this pump could run or he said should run until August or so. Of course, with sharp corrections on route, he says please enjoy the fruit responsibly, right? So, and I think he's talking about the fruit being the bananas. So, why do we say August and why do we say that that we're not calling it into like a massive long-term sustained uh bull market and why are there going to be sharp corrections on route for now? I think the the the road is clear. The the trade deals have started to be announced. More trade deals are going to be announced. Yesterday, the UK was announced. I mean, I think we're hearing now that India is going to be the next one. But, I mean, you never know. They might put some in the way. And then we're going to get some big trade deals actually being announced. These trade deals are going to be announced pretty quickly, right? That's that's the second reason. We could even have rate cuts along the way. So, I I heard this. I think it was just very very very funny. the chairman of the Fed, JRO, if he would uh lower interest rates like China did, like I think UK did, but like numerous other countries have done, it would be it's like jet fuel. It' be great. But he doesn't want to do it. I I think he doesn't want to do it. Probably he's done. He's not in love with me. I think that's sort of a crazy reason, but that's the way life is. Uh anybody at his position would be learn it would be like jet fuel. But he says it's going to be he's going he says it was going to be like jet you know tell the design teams to change the thumbnail instead of saying risk on he said it's going to be like jet fuel. Okay. Well you tell them that make the thumbnail like jet fuel. So it could be that we get a rate cut along the way because if you look at the CME and you look at the the rate cuts there is actually a possibility that in the next meeting we're going to get a rate cut. So we could get a rate cut and then that's going to push the markets up. Small chance 20%. But remember this changes quite dynamically. The problem is that all the damage that has been done by the tariffs is going to start coming out in the financial data. It's going to start coming out in inflation and it's going to start coming out in unemployment and it's going to start coming out in a slowdown in the economy. So all the damage that has been done, remember that right now there's a lot of people that have lost their jobs, right? There's hardly any containers in the in the harbors. there's been a freeze of of of shipments from China and from many many other countries and all this uncertainty is actually going to get brought to the markets uh or or to the data in the next 6 months. So the GDP numbers which are retroactive numbers are going to be read in next 3 to 6 months and so when you take that you could say hold on in August or around August we could actually have some negative readings which reflect the past. Now the markets are actually forward-looking vehicles, right? And so if the trade deals are done and Trump's and and the and the and the and the the groundwork has been done, then the market will say, \"Oh, you know what? Those are historical numbers, but if we look forward, everything has been resolved.\" But if by then we don't have a lot of trade deals and the numbers aren't down, then we could get another sharp correction. So this here is actually a strong thesis and we could actually carry on running with corrections and whatever else uh up until August. Also remember yesterday we looked at the funding rates, right? Um let's we could just go to the funding rates. Um just quickly go into um funding rates. So remember we looked at the funding rates yesterday. I said to you that that this let's actually look at funding heat map. Um I think that's probably the best place to look. Uh let's see. Funding heat map. There we go. Funding rate heat map. So, one thing that I we spoke about yesterday, I said to you this this rally could actually go much higher because look at the funding rates. Other than FCoin, which is getting a little bit extended, everything is still pretty much close to zero like like or to b or to base funding rates, which means that it'll be a long time before we get a liquidation. It'll be a long long long time before we get a liquidation. So, that is uh uh uh uh um pretty much where where we're at here, right? That's that's pretty much where we're at here. we could get a rate cut, but remember all the the the effects of the trade wars are actually only going to be seen in the data. And if the data is is good, then um if the data is very good, then if the data is bad and but the the Trump uh the Trump administration has done good deals and the market may actually be able to see through that. If you want to read more about that, uh there's a big section around the risk, the dangers, it's in our good morning crypto newsletter. That's a free newsletter if you want it. There's a link below. It's absolutely free. You can get it. It gets delivered to your mailbox every single day. There's a link below. Anyway, let's go to altcoins. Let's talk about altcoins. I know. I know that's why you're here. You're not here for for Hold on a second. Hold on a second. Um, okay. So, let's talk about altcoins. So, as I said, altcoins absolutely flying. And again, I think the one thing that we've seen around altcoins is we've had a massive breakdown. Just look at that breakdown of of the Bitcoin of the uh Bitcoin dominance. So you take the uptrend that dominance has been in since December and you can pretty much clearly see no matter where you draw your trend line, we've now broken the uptrend of the Bitcoin dominance. And so I think maybe Ra Paul again he said he's he's called it beautifully, but I think that he he called it to the day when dominance actually dropped. and he said that's when he thinks that uh that um uh thing uh in terms of the the altcoins that are actually leading okay so the meme froth is back obviously people are still playing memes as as the as the proxy for the chain. So, like if you look at the if you look at like like the the the big moves here, you can kind of see that you've got Brett and Pepe because Ether's moved and and you can't really buy a base and so Brett has moved. So, people have run back to the meme coins. Um, which is why if you look at our portfolio, we did have like meme coins here. We had this line of meme coins. We had Pop Popcat in here, etc. Um, uh, yeah, I think I'm I'm very very very happy with this portfolio. Now granted, this portfolio never had ETH, but remember ETH was a catalyst for all the other risk assets to actually start moving. And if you would have bought the portfolio from three weeks ago, the whole portfolio is 23% up. Only two non-performers in the portfolio, Grass and Gzilla, which I'm very, very, very confident of. It's just a case of let's hold. But we've had some really good ones like AI 16Z is almost up 90%. Um, Aerodrome up 55%. Uh, Shadows up. These these prices were taken earlier this morning. I think the prices are are slightly higher now. So, still super confident in this portfolio. Remember, we said this is a portfolio for like 18 months or something like that. So, very very very uh uh bullish about about that portfolio. I actually like Miles's tweet here um where he said, \"I definitely there's more room for upside here, especially on the oversold alts, but I'm not falling into the trap of believing it's a full-blown alt season. I'm net long, but not net stupid.\" And that's really where your head space should be here. Don't be fomoing into things that have moved up thousands and thousands and thousands of percent because now is the wrong time to be fomoing in. Just remember, you should have been buying when the fear and greed was at extreme fear and you should be selling or you should start selling when we get into extreme greed. And so right now this is very very very much a no man's land unless you're looking for value or you've managed to find value. Right? If you've looking for value or you've managed to find value, like I still think I mean I called all of these in front runners. Um I called all of these in front runners, but um and there's been millions of actually very very very good calls on on on front runners here. Um there's been this diddy launch. There's been there's been so many good calls on front runners lately. And I I don't know if you guys saw this. It's it was tweeted by Kapur by Front Runners, but this guy's absolutely is one of he's one of the guys in front runners. He's absolutely absolutely absolutely nailed it. I'm just going to show you how. Plus, I'm going to give you another trade, right? But it's important to go back to your trades and learn and understand the mentality so that you can be in the right side of on the right side of the markets all the time. I'm going to share my screen, show you the Discord on how I was able to take 216% profit on Athena 6x leverage, perfect entry, and I was able to take TP1 on. So, all of these calls were actually called in front runners. Every single one of them was actually called in front. Guys, last chance. If you want to sign up to Front Runners, there is a link below. Sign up to Front Runners. You've got a 30-day money back guarantee. If you don't like it, you'll get your money back. There it is. Oh, and you're getting 30% off. Yeah. Okay. That wasn't part of the plan. Okay. Just go and have a look at it. It's It's really one of the last chances that we're going that we're going to do this where you can actually get your money back. Your money back guarantee. Um again, look for look for um for plays that haven't yet moved. This is one that I'm really really really bullish on and I don't think it's moved. That's a non because I think the as ETH has popped. Okay, it just Okay, this popped, but still I still think there's upside here. It's up to $610. Uh I think my original call here was at $510. What is it? $512 was my original call. I still think there's a lot of room here to grow for an on because I think the Sonic ecosystem will be one that actually explodes. Um let's see. Is there anything else that we've actually left out here? Let's have a look here. Is there anything else we've actually left out here? Even beer bar be bar be bar be bar be bar be bar be bar be bar be bar be bar be barer chain up 22%. Holy [ __ ] I mean this is like a bonanza. Look, we could get a very very very good weekend this weekend. We really could get a very very very solid weekend this weekend. I think let's be I'll be I'll be here and I'll be ready to go live with you guys if we get a a very good weekend. I'll actually be live here with you guys. I'll be ready I'll be ready with them ready to switch on. All right. I want to show you something else now um which I think is a is is something absolutely amazing we have actually haven't spoken about and that is AI trading for you. I don't know how many of you have wanted bots and AI systems to actually trade for you so that you can actually go and enjoy life while you actually make money. So, here at Banter, what we actually did was we actually put this to the test and we said, \"Look, we know that we are pretty good traders. Sheldon's a good trader. Fairfair is a very good trader. Um, uh, I'm not a great trader. I'm probably a much better investor. Dylan's a fantastic trader. But what happens if we compare the returns of our hosts against the returns of AI?\" And the and the the results are pretty self-explanatory. Like the AI trades without emotions and actually beats every single one of us every single time, right? And so what we did was we actually met a a guy who we love. We absolutely absolutely love this guy. His name is David Tech. And what he does is he builds bots that actually do trades for you. But he hasn't built one or two bots. He's actually built like thousands and thousands and thousands of bots. And I want you guys to have a look. Uh I want you to meet the man. Here's David Tech. David, how are you my friend? Hi. Hi, Ran. How you going mate? Thanks for inviting me. Dave, brother, how's things going? Very good. Dave, you have I just have to explain to the audience who you are. Maybe you can just give us a background as to who you are and what you actually do. Sure. So, uh my name is David from David Tech. I sort of built uh my own trading platform uh because uh I started trading about three or four years ago manually trading but we got wrecked. uh spent hours in front of a screen uh watching uh but I've also been a coder since the age of about 11. Uh so yeah, so I started building uh trading strategies which I documented on uh on YouTube. Uh I went through all of the strategies was coding like three strategies every single day uh to try and find the best strategies and then uh I started documenting adding it to this website that you can see which is David Tech on the screen at the moment uh and actually roughly roughly how many bots have you actually built? How many agents have you actually built? So there's 800 strategies on the website and there's about 300 that are actually in live trading at the moment that we haven't actually added to the website. So there's a thousand bots actually live trading uh the the strategies and how is the result how is the result of the bots? Like walk me through the result of the bots versus the result of humans because I know that it's been a a touchy subject between you and Fairfair and and a couple of others. Like how do the bots do when they compare to humans? Um so first of all like you said earlier there's emotion so you don't have so much emotion whilst you're trading. There's things also like uh trading 24/7 that isn't possible for a human being. So you don't have to that you can leave it trading. I had like three months of things I was sorting out with my family and things like that. I didn't have to worry about my trading because it was just going on in the background. And all of that was powered uh by the the strategies that I built manually first of all and now I've handed off over to uh to AI bots and the AI agent I was building. So sort of yeah my portfolio. I had a portfolio that I built at the beginning of the uh year which was yeah show us that portfolio. I bet you've got it. So let's just actually put it up on the screen here. Um I think this is an amazing thing. This is a portfolio that's doubled itself this year just so you you guys understand like the So, if I go over to my dashboard over here on David, uh, as you can see, this is sort of uh that I do transparently inside of Discord. And as you can see, the bots uh have turned what is was 20K into $42,589. You can see this is without any human intervention. The bots are just running by themselves, right? Zero, zero, absolutely zero. Uh, I built everything from the actual connector. So it actually connects directly to the exchange. Uh you can see all of the strategies on the website how they're performing. Uh back testing. So back testing is extremely important. Uh so we I like I said I started off doing this all manually. Uh and then I've started to build AI agents since we now are very lucky in the era that we live where we have AI agents that are now building they're coding the strategies. They're testing and optimizing the strategies. uh they're finding the best settings and all of that is done in the background so I don't have to and most importantly that once we decide to go live because you can see that on the website you can see the live trading as well you can actually just connect it to a bot and the bot will take all of the trades for you. Yeah. So I mean guys just just so you understand the green is is so when David bit builds a bot the green is the back testing. So, so basically he puts the bot in where that white line is and then he says, \"All right, just back test and see what would have happened if if we had run it and then it it shows it to you.\" The purple is actually what happened since the bot actually started working. Right. Absolutely. So, this is back testing historical data and this is live trading. So, you can see problem with even trading strategies is when you take them out of back testing 95% of them won't actually work. So, you have to put them on to live trading to make sure they work because historical events don't ever happen again or or it just doesn't work. Uh overfitting, all of those kind of things. But when you So, we put the 800 and there's lots of them that don't work and haven't worked. But that's the whole idea behind David Tech is to try and find a small bundle of strategies that actually do work. Uh which has actually turned out to be quite a big bundle of strategies that do work. How many of them How many of them actually work, Dave? Dave, how many of them actually work? there the there there's there's a good hundred of them that are actually working. Uh currently we have uh 6,000 bots actually running dayto-day with people trading them. So there's uh there's a good number of bots running. So, and uh I I'm trying to teach people how to diversify their portfolio because diversification I believe is uh the holy grail of actually trading is actually having top lots of strategies running. Uh like here like I said I have 26 strategies running completely impossible for any human being to do uh run 26 completely different strategies. I mean none of them are the same. Not using the same indicators or anything like that. Uh the good thing is is that everything's programmed in advance. All of the rules are in advance. I mean the stop loss, we know exactly where it's going to be. We know where the take profit's going to be before any of the bots are actually taking any. So guys, the exciting the exciting thing that the reason why I wanted to bring it to you today is super simple. So we've partnered up with David cuz I I I'm very interested in trading bots, but to be honest, I have zero idea where to start. And the whole concept and the whole idea of getting a trading bot to trade for me just seems absolutely foreign. I don't know how to plug the bot into my exchange. I don't know how to select a bot. I don't even know how to activate the bot. And so what we've done is we've worked with David over the last while to bring you an AI trading school. And literally the school you can get it for free or you can pay one triple 9. Just follow the unlock for free or the the unlock for triple 9. You can get that. There's a link below that actually shows you where to sign up for the actual school. I'll show you exactly where that link actually is. It is over here. So, uh, click on that link over here. Go and check out the school and you can if you can you can unlock the whole thing for free. The reason why we are doing this course is because I am really interested. I'm going to be part of the first course. I want to know and I know nothing. I know nothing nothing nothing about bots and I want to I want to know how to do strategies and I believe or David believes that within seven days 7 days you could teach us how to use all these bots right absolutely 7 days okay so guys it's going to take us less less than seven days if you want to sign up and do the course with me I'm doing the course it starts in 13 days you can start signing up today I'm going to try and unlock it for free obviously you should try try and do the same um we don't want you guys to pay but if you want to do it with me, if you want to join me on a on a on a very cool experience, um, uh, where we at the end of it, we're going to put the butts against Sheldon and Fairfare and Kyle and everyone, um, join us. Sign up for free here today and within I guess within 3 weeks, it's the course starts, the first workshop is in 13 days. Um, the f the uh, uh, but but 7 days after that, you guys will be trading for you guys will be able to trade with bots. Hopefully, we'll all be able to trade with bots. So, sign up now. The link is there. Otherwise, uh Davey, I'll see you next week. We'll catch up next week to you guys. Thank you, sir. And to you guys on the Banter fam, look, we'll be on standby this uh this week. We'll be on standby this weekend because it could be a good weekend and we could get that ETH um that ETH squeeze. And if it does, then that's going to drive the whole market crazy. Otherwise, I'll see you guys on Monday. Until then, trade well, my friends. [Music]"
}