{
    "channel": "CryptoBanterGroup",
    "date": "2025_05_14",
    "transcript": " [Music] While everybody is watching this ETH pump, I want to actually talk to you about a narrative that if you're looking at the bubbles, really only a very, very, very trained eye can catch this narrative. But the thing about this narrative is that I've been here in crypto full-time since, let's say, 2016. And never since I've been here, or since I've been here, this is by far, by far, by far the most exciting and most real narrative that I've ever seen in crypto. And not only is it exciting and real, but I actually think it's really early and there's a lot of money that can actually be made. So today I want to talk to you about this new narrative and I want to talk to you about why this narrative is actually good much better for Salana while everybody's actually watching ETH. So listen, if that sounds good to you, today's going to be an amazing amazing amazing show. Subscribe to channel. Join the one point. It's going up so quickly. I can't even I can't even keep up. 1.162442 subscribers. Uh obliterate the like button. We got a very very very alpha packed show for you to guys today. Uh let's get going, guys. I must say after all the sideways markets and everything moving sideways and not and news not moving markets, we're now back in a market where there's new narratives, there's newsmoving markets, there's a lot of positive news happening all the time and it's just amazing to be back uh in these kind of markets and amazing to have everybody here again. And I see a lot of people are are coming back because they went on a bit of a vacation when the markets were in this lull and now they they're all back here. Today we've got an amazing show for you. Slightly different show. We're not going to be covering too much about the macro and stuff like that. I think we've done a lot of that in the last couple of days. I think I want to get straight into this amazing narrative that I think really really really only broke yesterday or really only started breaking yesterday. And the reason why I think we should talk about it is because I think it's one of the more real narratives in in in crypto and specifically when I look at the markets now look at the markets now and I know that everybody's watching the ETH pump and you know to be brutally honest yesterday I posted in the uh in front runners that I actually took an ETH trade and not only did I take an ETH trade but you guys will be super super proud of me I actually for the first time I want to say ever but I'm not sure that it's ever for the first time in a long time I actually used a stop loss um and I think that ETH trade is actually uh uh playing out. Um but the thing about the ETH trade is that it's not really about the ETH trade. The ETH trade symbolizes that there's a risk on movement in the market. And when there's a risk on movement in the market, typically we see a whole lot of new narratives actually actually playing out. So whether you love ETH or hate ETH, doesn't matter. This ETH pump is very very very good for all risk assets in crypto. But the one thing I think that people are are overlooking because the focus is so much on ETH is I think that people have forgotten about Salana and the Salana ecosystem and in particular because this new narrative that we're going to talk about today is actually currently being dominated by Salana for very many reasons and we'll talk about the reasons why why this narrative is um uh being dominated by Salana. So listen, if that sounds good to you, I need you to do me one favor. The only only only one favor. All you need to do is smash the like button. And that's all I'm asking. I'm going to give you guys a whole lot of alpha. We're going to dig deep into this narrative. All I ask from you is that you get the 207 likes that we've got currently to 1,27. So, let's get going. Let's get going. So, what is this new narrative and why am I so excited about this new narrative? I think when when you think about why I'm so excited about this new narrative is because really I've been in blockchain since I think full-time, you could say since 2015 or 2016. And when I got into blockchain, the reason why I got into blockchain was because of all these buzzwords over here. The words like financial inclusion, uh accessibility, uh frictionless finance, global frictionless finance across borders, trustless finance across borders, real decentralized finance and disintermediation of middlemen across borders. I got into blockchain because of things like social finance or borderless finance. Those are the reasons that I got into blockchain. you know, for the most part, other than Bitcoin, stable coins, maybe ICOs, blockchain really hasn't delivered on on on the promise of of all of these uh of all of these uh uh buzzwords that it purported to be. But now there's a new narrative that has actually surfaced and it's actually surfaced very very very quickly and the narrative is called internet capital markets. And really, if you think about it, yesterday was the first day. You can kind of see it started to go up um in in in the in the social metrics a couple of days ago, but really only yesterday did this whole internet capital markets thing actually break. And it actually broke, funny enough, a little bit before we were live on on the show yesterday, and that's when it really came came onto our radar. So, if you think about what internet capital markets are, pretty simply put, internet capital markets are creating capital markets out of anything and anyone on the internet. So basically anyone who has internet access can be part of capital markets. Now I mean I know that sounds like a very very very big term but we're actually going to bring it back to something that's happening right now. So again the the the concept behind what a market is or specifically capital markets. It's a place where people that have capital can invest that capital in people that have ideas. Right? So if I've got an idea and you've got capital and you want to invest in in ideas then um we can meet in what capital markets are. But if you think about traditional capital markets traditional capital markets like all traditional financial markets are are pretty are pretty um flawed. And the reason why they're pretty flawed is for the normal reasons. One uh they only open to certain people. You have to be an accredited investor if you want to invest in capital markets. specifically if you want to get into early stage capital markets, you can only invest uh uh at certain stages in a in a company's life. There's a primary market and a secondary market. The primary market is where things are sold for the first time and the secondary market is where people actually land up trading. Um and effectively uh markets are usually only open to certain participants and there's very few in fact I don't know of any global capital markets right and specifically what I don't know about is that of any markets that are so inclusive that they can actually allow anybody with an internet connection anywhere in the world to participate in capital raising whether you're on the one side of capital raising where you want to provide the capital or where whether you're on the other side of the capital raising where you have an idea and you need capital. The internet capital market is really the only thing the only markets that can actually do this. So the key differences between capital markets traditional capital markets and internet capital markets. First of all access capital markets are mostly limited to big institutions and wealthy investors. They usually have intermediaries and if you've ever dealt in capital market and you've dealt with the intermediaries usually they are capital raisers, VC commercial banks and stuff like that you'll realize that there's a lot of friction. And there's a lot of paperwork. There's everything else. Availability. Capital markets are only available uh uh in your time jurisdiction. Uh speed and cost. I mean, if you ever try to raise capital in capital markets, you'll understand the speed and cost of capital markets is very is very rough. Transparency within capital markets, there's limited information available. Often the information is private and controlled by big companies. So, generally when people are raising capital, um the the capital raises are pretty private. So that is what traditional capital markets are and that's how they compare to internet capital markets because internet capital markets are literally where anyone in the world can can appeal to anyone on the internet with any idea on the internet to be able to raise capital and that's really democratizing the whole of finance. So whereas some people have pitched this as internet capital markets equals tokenizing startup ideas before they built I think that's a little bit limited. So he says, \"Devs pitch ideas, launch a token tight that idea, and traders bet on the idea before the idea goes into production by buying and selling the token.\" So if you wanted to launch something and you wanted to understand whether or not there was a product market fit, you could say, \"Hey, I want to launch little silver magnetic balls that people can fidget with while they are uh um the while they are broadcasting on the internet.\" If there is a market for it, people will land up actually buying the token. And if people actually land up buying the token, that means you know that there's a product market fit. And then you can take the money that you've raised through this token sale to actually go and develop the little magnetic silver balls that people can fidget with while they're actually playing on the internet. So as this thing says, it says no product, no MVP, just vibes and speculation. And it's happening very very very much on on Salana. So here's a a nice breakdown. Here's a nice breakdown which I got from the internet. It says, \"Internet capital markets, the meta you can't miss. Here's how to make some serious gain. Internet capital markets. What? Making your next viral app idea tradable from day one. Imagine launching your app instantly and making it a tradable asset where anyone on the internet can back your idea not just with likes or downloads, but with becoming a real stakeholder. So, it's almost like you can almost think about it like a Kickstarter. You know, you remember that you know that site Kickstarter where people have these wacky ideas and they want to develop the wacky ideas. Well, it's almost like bringing even like it's one level above uh Kickstarter. It's the creation of a new market where you can trade ideas behind apps, not only apps, generate volume, the kind of volume that helps build users and earn share of fees. Uh which enables them to to turn the the idea into an actual app. Internet capital markets allows everyone to inject capital into apps and websites from day one directly from people who will eventually become your users and and uh and your investors. It's like a creation of a launchpad for internet apps. And I'm going to say it's not only internet apps, it's internet ideas where builders can launch ideas and you can speculate on ideas by buying a token. The more demand for the token would eventually help the builder develop the app faster and build a successful business around it. So that is um that is effectively what internet what internet capital markets are. Um someone says internet capital markets literally outperforming 90% of all random businesses we've never heard of until today. Study execution risk. Study the Fcoin parallel. So this is literally the FCCoin parallel. The Fcoin was the AI the first iteration of the AI agent parallel. This is in my opinion much much much bigger. And the reason why I think that this is much much much bigger is because I think the best ideas are actually going to come from AI. I don't know how many times you've actually heard of uh uh people who go to AI. I don't know if or you've maybe even gone to uh to AI agents and you said give me five business ideas or five ideas for apps that I can launch on the internet. Now you're in a world where the AI agent can actually come up with those five ideas, post it onto the market, and people can actually crowdfund this idea, and if the if the idea gets a certain amount of funding, then the idea can basically get into real life or come into or come into fruition. Very, very, very similar to a Kickstarter. For those of you who don't know what Kickstarter is, let me see if I can quickly get onto a Kickstarter website. So Kickstarter is an idea where if you've got if you have an idea um if you have an idea you can basically uh pitch your idea to the world and they will fund the idea and if they do fund the idea if they do if if they do like the idea and you actually raise the money and you can actually and you can actually develop the idea. So that is what effectively internet capital markets are. Now in this world of internet capital markets I think we already have the killer app which has already been launched. Now, the the launch of the app was very recently. I can't tell you exactly which day it was launched. It is an app called the Believe app. So, it's believe.app and you can download it onto your your your iPhone onto your iPhone. I'm sure you can download onto Android. Um I don't know if you're going to be able to see it on my app, but effectively you it's because it's green and we're we're here in a green screen, but effectively that is the you can't really see it there, but that is actually the app over there. So you can see uh you can see the app over there. Let me show you let me show you this. Okay. So that's the app over there. Um and how the app basically works is it's really really really simple. Um what happens is if you see something you tag at launch acoin plus the name and you can turn it into a coin. So basically, you literally you can go to Twitter, you can comment at launchercoin plus the name of the coin, and it will literally automatically turn it into uh turn it into a coin. It's Kickstarter, but for ideas and projects, here's how it works. A founder or scout can tag uh an idea or post with launch a coin, which automatically creates a coin tied to the idea. The market then determines the coin's fair value based on the size and the importance of the problem being solved. For founders, it's a way to gauge real market demand for the idea. If enough fees are generated, the founder can claim the earnings and immediately start building. For scouts, the goal is to discover the best ideas and founders. And so they they will be able to raise money. Now, on top of the app, which is a very, very, very cool app. I think the one thing that they've actually got right is they've actually got it onto the Apple store. And not only have they got it onto the Apple store, but effectively um you can actually pay using a debit card. You can use Apple Pay, you can use Coinbase Pay, you can do a manual transfer from or to a Salana wallet or from a Salana wallet. But effectively, that is how easy this whole thing is. So, you can see one of our researchers actually tried it and and he made us this video. You can actually add in he wants to add 100 bucks. Hit debit card and pretty much it it adds um it adds money to these things. So, it really really really is a a a new frontier. As I said before, you tweet Launchcoin plus the ticker name. A bonding curve initializes the token limited supply. It's almost like, think about it like a pump. Fund or think about it like a virtual protocol where you can launch instead of launching an AI agent, you're actually launching a business idea if you can raise enough money for that business idea. the token goes out of the the the bonding curve and then the best thing is that you as a a founder get to claim 50% of all trading fees by linking your ex account. So basically unlike pumpf fun which actually only recently started sharing revenue with its creators, these guys are actually sharing revenue with the creators uh on the first day and that revenue can actually be used to fund the ideas. the graduation trigger. You got to reach 100,000 market cap. Once you've reached 100,000 market cap, then you graduate uh then you graduate to to one of the actual actual dexes. The app has has be been able to get uh massive massive massive traction. You can see it's already after such a short period of time. um 147 in the finance in the finance apps and they had extreme I think they got just I think this thing exploded much quicker than they actually uh than they actually imagined. Now on top of the actual app there is a coin. Now the coin you've probably seen and I said to that's why I said to you I think the trained eye can see it on bubbles. It's got a $200 million market cap. It launched I think the coin launched a while back but I think it only started exploding pretty much yesterday. So you can see it pretty much exploded more or less when we went live on the show yesterday. That's more or less here is when this thing this this coin actually started to explode. Right now the coin which is called Launchcoin on Salana is trading at a $200 million market cap. Now if you were on Bubbles you would have been able to pick up not only would you would you have been able to to pick up this coin. You can see that there's there's there's Launchcoin over there. This coin was up like 700% yesterday. Um, and it's up 70,000% in 60 days like Martin said. Um, and we'll talk about whether you should buy this coin or not in a couple of seconds. But there is already a coin and there is already a killer use case and a killer application which is endorsed and maybe maybe even funded by Salana and some of the biggest VCs uh behind Salana. When I saw this coin, I went to look I went to speak to some of the VCs. It seems that some of the big VCs are actually in this, but I don't think that they had very many rounds or anything like that because we've never seen one of these uh one of these rounds actually uh going on here. So, the one thing about this is that there's going to be many launchpads that actually launch internet capital market ideas or so-called blockchain kickstart ideas. They're going to be many, many, many apps that actually do this, right? Just like when we had the AI agents, we had a lot of apps that actually launch AI agents. We had virtuals which was predominantly uh on base. We had equivalents on sui. We had sooi. We had AI agents on sui. We had AI agents on salana. And effectively right now the first killer app was it that has happened on this is this believe app. Now what you'll remember is that in the old days or in the old days in the last in the last part of the bull market when we started speaking about AI agents the the real winner when it came to AI agents was actually virtuals right so virtuals was the real winner when it came to AI agents and what landed up happening is virtuals not only was probably the best thing to happen to base and then by definition also the best thing to happen to to Ethereum but it also had a ricochet effect which brought people onto the base chain. People started to download uh uh base wallets. People started to participate in in in base DeFi. People started to use aerodrome as the biggest base uh decks. And the reason why they did this is because they wanted to participate in the AI agents which were actually being launched. So this is going to be this is going to be no difference in this thing. It's exactly like the launch of virtuals. You can kind of think about believe and any other app that comes out like this. And there are a couple of copycat apps that have come out like this. You can kind of think of this exactly like virtuals in the launchpad game. I think it's it was pretty clear that the biggest winner was actually virtuals. And then the the um the other thing that actually happened was you got a whole lot of different AI agents that were actually launched using the virtuals software that also started to get value, right? And it's exactly the same here. The first thing is you've got the launchpad which is the believe app which is the launchcoin uh uh token but then on top of that you've got a whole ecosystem of other tokens which are the tokens of the projects that are actually being launched on the platform. Some of them are absolute garbage but some of them are are real businesses and the truth is I'm not really going to start commenting in this show and we are going to do many many many other shows. In fact, in front runners, we're actually going to have a dedicated channel to uh believe app system tokens or to internet capital market specific tokens. And that channel or or or those contributors have already started to make a whole lot of money on this uh uh um uh uh narrative. So, you can see that yesterday already people were were posting watch lists in front runners. Uh already overnight the guy started to make 120 million apes 3x overnight. So, these guys already started to make money in front runners. I'm going to say this again, and I said this to you guys yesterday. There's probably never been a better time to get into front runners because right now, right now, when the markets are exploding, there's tons of calls. But now, we're also going all in and focusing on this on this new narrative. And so, what I've done here is, as I said before, I said to you guys, you can come in and you can check out the dedicated channels and you can check out the calls. If you're unhappy in in a month, you can pretty much exit and you can send me a mail and you'll pretty much get your money back. There's really no better time to get into one of these groups. You're about to enter a bull market and there are specific bull markets happening within specific sectors which we are actually starting to cover and you can see that in those sectors a lot of coins are actually starting to launch. This is exactly exactly exactly a repeat of the playbook that happened on on AI agents. Do you remember that the AI agents started to launch? Then Coin Gekcko launched a new category called uh at that time it was the the virtuals agents. Now they've got the belief app ecosystem e ecosystem tokens. You can also go to the beliefscreener.com and if you look at the beliefscreener.com you can pretty much see all the different projects that are actually launched uh on on believe and you can go into each one of the actual projects. Okay, I'm not going to go into Launchcoin because Launchcoin is is the actual coin, but you can go on to dupe and I think it will load if the internet actually gives it to me or if their website actually works. But pretty much you can see everything that you need to see in the belief screener about every single one of uh of these things and you can see the correct contract address because remember each one of these things has a contract address. Now there's also a lot of spreadsheets that are going around. This is one that I picked up yesterday. I'll show you another one at the end from Pratik and he I'm actually let's just follow him but he actually has a Google spreadsheet of literally all the not all but a lot of the different watch lists of things that he's actually using which are these um uh uh uh internet capital market projects or projects from anyone on the internet trying to raise money and I want to show you just one or two of these projects of of like how cool some of these projects are. So this is a project called dupe.com. What dupe.com is is there's a guy who felt that he was duped. He went to he went and he bought something and when he once he bought it on the internet, he felt like he he was duped. And so he started this thing called dupe.com. Um snap up all your dream furniture at the lowest price with this one one life hack. Tell everyone. So let's just go to dupe.com so that you can actually see what the website is. Again, this is just an idea. And he says find similar products for less. And the way that he came up with this idea is he bought something on the internet. He felt like he got duped. He didn't want people to get duped. And so he created a website where literally you paste an image and it tells you where you can get the same the same sofa or whatever it is for the same amount of money. And he needed he needed money to do it. So what did he do? He went to the internet. He said kickstart do do my idea fun crowdfunded the idea on on the believe app. And now he has a token, but he actually also has an amazing amazing amazing business, which is being able to source furniture much cheaper than anybody else. Now, this could be the next Amazon. This could be the next billion dollar idea. And this was started as an internet capital as an internet capital market project. And there there are hundreds of these. So there's this one here. It's called use giggles. Uh use giggles, if I remember correctly, is a um post giggles g. So basically I think you watch giggles and um you get rewarded for actually watching these these short videos which they call which they call uh uh giggles and you can see that over here and there's I mean there's tons and tons and tons of these. There's a buddy AI powered content coach. Uh there's fitcoin AI virtual closet app that offers fashion styling resell and crypto rewards. Let's maybe look at that one. I kind of like that one. So you can literally go through all the all of these different ideas and you can even create your own ideas and you can in an instant crowdfund the idea using these internet capital markets. So that is effectively the idea. As I said it's not really about the actual the so it's not actually about um specifically the believe app even though I think the believe app probably has the biggest chance of success with who backed it and with the fact that it launched so early and it got the biggest share of voice. It's about the fact that anyone anywhere in the world can raise money for a business idea. If I'm in South Africa and you're in Philippines and you've got a great idea, I can fund your business idea with no capital restrictions with no crossber restrictions. And basically, we're making we're making finance uh we're making finance accessible and and uh and absolutely uh fair to everyone. Now the question is whether or not you should buy this token, the launchcoin token, and whether or not you should actually go and buy the individual tokens on the app. So let me let let's start off with those and then I want to talk about how this benefits the Salana the Salana ecosystem. Someone says run disclose your bags in this idea first. My my bags are I have a position in uh in Launchcoin. Uh I I bought the position yesterday. I have uh I have no positions in any of the other projects because and I and I'll show you in a second why I have no positions in any of the other projects but I'm going to have positions in the other projects. So the reason why I've taken a position in Launchcoin is because I think that this coin has the share of voice and this could be the virtuals of this ecosystem. They've obviously done a great job. They've lifted on the Apple store. They've managed to get credit card payments, debit card payments and stuff like that. So they've instantly made this, you can use Apple Pay. So they've instantly made this uh a global app and I like this tweet which said in the current environment you can either chase derivatives of the original Meta or be part of something net new and this is something net new and this is the the app that it's not a derivative of the the net new. It's the first net new app. So it's almost like investing in virtuals ver versus in ver versus investing in any of the other AI agent launchpads, right? You can say that there were there were about a thousand AI agent launchpads that launched after virtual launched, but how many of them got anywhere near the traction that virtuals actually got? And that's why to be honest, even though I don't usually invest in things at 100 million and $200 million market cap here, I actually did take a punt. And the reason is because this is one of those ideas that can easily go to a billion and maybe $2 billion market cap very quickly. If we look at virtuals, um let's see if we can actually go to virtuals and we go to where virtual traded at the top. It's trading at a $2 billion valuation now. But if you go back to to the um the top of the bull run, if I remember correctly, this thing went to something like $4 billion or 4.5 or 5 billion. and that was an AI agent launchpad which effectively allowed you to use wrapped AI agents uh and to tokenize them. To me, internet capital markets is a much much much much bigger narrative. It's a much more real narrative and it's a narrative that AI agents are going to use to launch their business ideas. AI agents are going to come up with business ideas and they're going to crowdfund to actually develop code or launch or launch these business ideas. Okay, so that is that is the narrative. Um, it's, as I said before, it's called Internet Capital Markets. And what it's about, it's about turning any idea on the internet into a token and into a business by being able to raise money from anybody on the internet. Any idea or any person can create money can can raise money and create can launch a business across the internet. So, that is the idea. And of course, there's a lot of advantages to the idea. And as I said to you, the reason why I like it is because it really does uh uh trade one of the it does it does talk to the benefits of blockchain etc etc. There are of course a couple of risks. There's a lot of risks. The first risk is and I think the most obvious risk is that the tokens won't actually have any value. Specifically if you look at the terms and conditions and I think they've done this to avoid SEC and securities laws. The tokens are not securities and not investment instruments and not equity. And so the question is how will these tokens actually acrue value. The second issue is that these tokens by nature will mostly be securities because if you're participating unlike Kickstarter. So Kickstarter does something very smart. It says look you invest in in in the Kickstarter and let's say I'm developing a new water bottle. You invest in a new water bottle and if you invest in the new water bottle you're not actually investing in the company. You're actually pre- buying the water bottle, right? And that way they've managed to get away from being a security here. The token, if the token represents any kind of value tied back to the business, then the token is going to be a security. And so one of two things will happen. Either these tokens will be securities and they will need to be regulated like securities in the different jurisdictions. And we know what that brings or the tokens won't have any value. Or the third thing that could happen is the tokens will actually be utility tokens. But I think we're probably a long way away from actually being utility tokens. So because because I think that the tokens are a long way away from actually being utility tokens and I think that the average person on the internet that launches a token has no idea about the difference between a token that is a security and a token that is a utility token and how to structure a utility token to be a utility token versus a security token. I think that there's going to be a lot of gray areas here. Now what are the risks around the gray areas? The first thing is that these tokens, these derivative tokens won't actually land up having any utility or that they will be regulated by the SEC and achieve a massive penalty and etc etc or that the platform itself will start coming under fire from things like the SEC or SEC's in different jurisdictions. So this is for me those are for me the risks but remember you you cannot not invest or not start something because the risks you what you do is you start and then you tackle the risks as the risk happen. So I think that they've probably got a plan B and I think that they've got I mean I know for sure because I went through the the terms and conditions that these tokens don't have any value and they've got all the different terms and conditions already pro programmed into the app. But I am highlighting that there are that there could be a hell of a lot of risks. Now, let's talk about the massive opportunities. So, you know, with these things, as I said to you, I'm not a big fan of the individual tokens. Even though I do think that they're going to provide for amazing amazing amazing hype casino, just like memes provided a hype casino and just like AI agents provided a hype casino, our new hype casino is Kickstarter projects on the internet on the blockchain or what we call internet capital market projects on the blockchain. Right? That is our new casino. And in order to capitalize on the new casino, you need to be early. You need to be first. And I think it's going to be a very very very very similar structure to memecoins and a very similar structure to AI agents. This the sooner you get the information, the sooner you get in, the sooner you're going to profit. And I think that partners of ours like the accelerate which effectively the accelerate is a te what it does is allows you to trade telegram calls like by just following a telegram call or just linking a telegram group. You can follow and trade calls and you can sort the like the telegram groups by the the win the win rate the lose rate the highest returns that they had etc etc. Um there's a link below if you want to try it. Use this link cuz there are a lot of malicious links and I know people that have clicked on malicious decelerate links and had their wallet stranded and here you are connecting your wallet. So please use the link below to actually connect to the accelerate. But here you can find some of the earliest calls exactly like we found them for memecoins and exactly like we found them for AI agents. That is the the thing I think that now we are launching a new type of internet casino. The first type of internet casino was memecoins. The second type of internet casino was AI agents and this is now the third internet casino. Just like with memecoins and just like with AI agents, I think 99% of the actual derivatives of the actual coins long-term are going to have no value, but there's going to be a lot of hype and you're going to be able to make a lot of short-term uh gains on these things. And as you can see from the spreadsheet, like literally each one of these things has a token attached to it. Some of the tokens are actually going up to big market caps and big valuations. Some of them are going up and coming back down. Like this one's back down at 5.9 million. It was at $16 million earlier when I looked at it. So you can see that each one of these ideas is going to get funded. So to me, what I'm treating I'm treating the I'm looking to buy into the actual protocols that are going to gain from this. So what are the protocols that are actually going to gain from this? By far by far by far the biggest winner from all of this is going to be Salana. And I know everybody wrote off Salana and they said, you know, because uh because um meme coins are are starting to die or because there was a bare market and the meme coins were starting to die. uh uh uh Salana is has lost its shine and that's why everyone was looking at the soul ETH chart and basically saying oh no no it's the end of Soul and it's it's the beginning of ETH but as you can see very very very very very close to the bottom of this trend line or or to this trend line over here which which Salana has been tracking since I think probably somewhere around here since 2023 we're now getting a bounce and I think that the reason why we're getting a bounce is because of this narrative called internet capital markets right now the reason why I think Salana is is is is this is the best thing that ever could have happened to Salana is if you understand what Salana set out to become at the beginning is Salana was the path to a decentralized NASDAQ. The NASDAQ is today the capital markets of the traditional finance system and they want to become the decentralized NASDAQ and that's how they've set up their technology. their whole technology is around the decentralized NASDAQ, right? And so if you think about about uh uh uh who the biggest custodians of this trend are going to be, effectively this is an yet another narrative where Salana lands up winning. So when it came to memecoins, I think no doubt we can say that Salana was the biggest app or the biggest winner in terms of L1's when the meme coins came, right? And then we got the AI agents. And even though the biggest platform on on AI agents, which was the virtual platform, launched on base, ultimately if you look today at the AI agent launch narrative, you can see that Salana is still the the the biggest. And the second one is ETH. And that's of course ETH because of Bass. And so once again, even though so once again, Salana Salana basically took the lead here. And what this is showing you is that really for every narrative that actually lands up happening, Salana becomes the winner eventually. So in internet capital markets, Salana actually became uh uh uh the winner. Memecoin, Salana became the winner. AI agents, Salana had started off second but actually uh uh became the winner. And what we're seeing now is that Salana is actually um 70% of all onchain transactions in the market actually land up happening on Salana. And this is just another narrative which is happening on Salana. And the reason why I'm so excited about this narrative is because this narrative is the closest narrative to Salana's core. And their core was the path to decentralized NASDAQ. and decentralized NASDAQ effectively translates into decentralized capital markets anywhere in the world. And that is why this narrative makes me so excited, right? And the truth is that I think the reason why people are going to Salana is a because they have the most distribution because there's I think it's got the I think Salana has the most wallet downloads. It has the most active addresses, the most users. You can see that over here when you compare it to any other blockchain. Literally, if you look at the most active addresses, which is which translates to the most downloaded wallets, you can kind of see that Salana is by far by far by far the biggest the biggest in terms of numbers. So, the most distribution happens on Salana. Also, the chain works, but most importantly in Salana, Salana's moved beyond the layer one. So the first the first uh uh uh um uh war the first battle was to win the layer one battle. Who could be the fastest? Who could be the cheapest etc etc. What seems to be happening is that now Salon has won that battle. And now the next thing is how many successful revenue generating businesses can be built on the protocol. And once again here we're seeing that Salana if you look at application by re revenue by chain 64% of application revenue so not gas fees on the chain but actual revenue earned by applications on the network 65% of all application revenue fees are going onto Salana. And the reason why that's happening is because Salana has the most distribution, has the lowest gas fees and that's really and it's fast enough and that's really what um users actually want. And so I think that the biggest custodians here so like I mean just have a look at this. This is like this is super super super interesting. From August 2023 more or less Salana went to becoming to over 65% that's actually now 65% of all revenue. They went from pretty much zero to 65% of all app revenue. And you can see it. You can see it here. I think here it's a wait, you can can't see it there. There you go. You can you can you can see it over here when you look at this chart over here. You can kind of see that the green is the Salana revenue. I'm going to take you to a year and you can kind of see how much uh app revenue is actually being earned by by the um by the the apps on Salana. So who are going to be the biggest the biggest uh um uh custodians of of all this profit? The first thing the first one is of course Salana and I think that here once again we have another narrative and the narrative is happening on Salana also in this recovery we're also getting memecoins recovering and the home of memecoins is actually on Salana and if you talk about AI agents which is probably the only other narrative in crypto well Salana Salana wins again. So the biggest custodian here obviously is is going to be the L1. But then remember that if you and you can kind of see it when you look at the bubbles. If you look at the bubbles and you look at the bubbles which are actually starting to explode and I actually called this a few days ago when I or or two weeks ago when I built my portfolio look at radium and the reason why radium is actually exploding like this and why Radium has got a chart that looks something like this, right? The reason why Radium has has that has that kind of chart and if you go I'm going to go into one year. I think one year takes us too far. But if you if you look at the one month chart of Radium and why Radium's almost doubled in in a month is because no matter what value is being traded, whether it's memecoins, whether it's AI agents, whether it's now internet capital markets being traded on Salana and you need a DEX and that's why I say that the smartest moves now in blockchain are to own the L1, the dexes and then the launchpads if you like a certain idea. And in this case, the launchpad would be the believe uh launchpad. So, which is the which is the launch coin um and and stuff like that. And then you can actually la the dexes because no matter what the value that is actually being created, the decks will benefit. So, when everybody thought that that Radium was dead because Pump Fun actually launched their own decks, well, then Radium launched their own version of P of Pump Fun, but Rad no one's going to go and trade their AI agent on Pump Fun. No one's going to go and trade the internet capital markets idea on pump fund. They're going to go and and trade it on on things like radium. And so Jupiter and Radium basically have the best exposure here. But then there's GTO. And the reason why JTO is so good is because JTO actually captures all the minor the the minor extractable value or the maximum extractable value on the Salana chain which is the the actual value of the chain is actually all captured by GTO. And so if I was building a portfolio now around these narratives, I would have Salana in it and I think Salena is still cheap enough to buy. I would have all I'd have Jupiter because Jupiter is a Dex aggregator. I would have Radium because Radium is where everybody's going to trade the value that's created. I would have GTO because GTO is where we capture the MEV. I would have launchcoin because that's the the latest uh launch pad and that could go as high as a virtual. And then the truth is, look, again, as I said, I haven't got into any of these or many of these. Um, but the guys in front runners, the DJs in front runners in the different channels are constantly getting in and out of these things. I mean, they're buying them at 100 grand market cap, 200 grand market cap, they're selling them at six, they're making 20xes overnight. I think they were like there was a 20x, there was a 3x. There's so many of these things going all the time. So, I think that that is probably the ultimate. I would like if you want to play in the casino, take one or two% of your portfolio and play in the casino, but the rest put into the infrastructure that's going to benefit. And I say again, I think this is one of the most exciting uh narratives in blockchain. But if you don't think so, that's cool. Ultimately, the last three exciting narratives have all landed up being on Salana. And the the thing that has benefited the most from AI agents, memecoins, and now from internet capital markets is the layer 1, the dexes, the me capturers, which is which is in this case uh GTO. And then of course you can go into the launchpads and the actual ideas. And that is effectively how I would play this new and exciting narrative that uh that this is that I think is one of the best narratives in the world. Again, I want to just warn you, I'm not a big fan of the actual coins and actual ideas, even though I think I do think there's going to be fun and high adrenaline. And I think what we'll do is we'll actually start a Sunday show like we used to do the AI agent show. We're actually going to start the Sunday shows talking about the specific Kickstarter ideas and actually just reviewing the specific Kickstarter ideas, maybe even meeting the founders and stuff like that. So, that is that's that. Uh, let me know what you think. Let me know if you're as exciting as excited as I am about this. Uh Josh say shares I need to do my Blofen. Oh yes, of course. If you opened an account on Blofen, uh here it is. So if you open an account on Blofen, we said we we do draws until Friday of $5,000. It's very simple. All you'd have to do is open account on Blofen, which is an amazing amazing amazing exchange. You got to use this link over here. Open account on Blofen. It's a amazing exchange. No KYC required. So you can open it anywhere. Deposit money into the account. a little bit of money just so we know you're not a bot because there's no KYC. You guys have been taking advantage of this and like I get it. Like you want to open 10,000 accounts, but it doesn't really work. So now we we've been filtering the accounts and we think these are the real legitimate accounts. I'm going to quickly just pick a winner here for today. Today's winner is this one over here. It's account number UID number 1981990262716. There it is on the screen. If you are that account, email giveaways@cryptobanter.com from the email you open that account and make sure you've got money in that account and you'll get $5,000 deposited into your account. Let me know what you think if you enjoyed it. Uh, someone says, \"Why does Ran still think he needs to convince people about soul? Always sounds desperate.\" I'm not convincing you about soul. I'm just telling you what's in my portfolio and and and what I'm doing. Someone says, \"Oh, I won. Amazing. I really hope you did win. Soul 120. If you can get solid 120, I'll take as many as you can get. So otherwise, I'm buying it at at these levels. Well, I have been buying it at these levels. Uh, cool. Let's just quickly look at the market. So, I see that a little bit flatter, but nothing to worry about. Uh, I wonder if the call from Good Morning Crypto from yesterday, our newsletter. I wonder if it's right in terms of when we're going to hit the the new um the new uh uh uh uh high on Bitcoin. I actually, I must say, I read that article yesterday. I just thought he actually does make a very very good point and we actually could see the the new alltime high in about 2 weeks. Anyway, I'll see you guys again tomorrow. Big show tomorrow. Until then, trade well, my friends. [Music]"
}