{
    "channel": "CryptoBanterGroup",
    "date": "2025_05_04",
    "transcript": " You know, everyone loves Royal Pole. You know, the reason why they do is because he's always bullish. Here in Dubai, things are bullish. How bullish are you? Uh, max bullish. Not just bullish, but max bullish. So, why are you so bullish? Uh, so I think that the setup is just perfect. This special episode is brought to you by Elbank, a centralized crypto exchange offering over 700 trading pairs across 180 countries. We're here in Dubai covering token 2049. The last time you saw us on site, we came to you from Hong Kong, but that was before the trade war between the east and the west. Now, this trade war is causing havoc on the market. Let's go inside token 2049 and find out exactly what people think. Let's go. Like I said, the last time we were live in real life was on the ground in Hong Kong. That was in February when Trump had just taken office. And since then, what do we have? Boom. Well, we have a tariff induced trade war that has tanked the markets. They are getting absolutely hammered in China. But there's some light at the end of the tunnel today. Bitcoin trades above $97,000. Bitcoin's bounced back big time this week. And maybe, just maybe, if you believe all the bullish headliners here at Token 2049, a massive bull run may be upon us. And this is how liquidity is pumped into the market. Token 2049 has emerged as the go-to global conference. Other conferences seem regional. And what a show, what a spectacle it's become, drawing over 15,000 attendees from all around the world. Also drawing some of the biggest names in the space, Eric Trump and World Liberty Financial. Guys, our system is broken. Modern Finance is absolutely broken. Arthur Hayes, CZ. So I think the future is going to be quite decentralized. Exchanges like OKX the title sponsor, Coin W, who were just behind our set, WEX, Bing X, and many others. And Blofin and its whale making waves. But is Bitcoin going to go up? We'll sit down with a controversial mantra and really more importantly what we're doing about it and what what the way forward from mantra looks like and check the pulse of the everyday crypto enthusiast on the floor with our man Femeni here in Dubai. What do you think about the market? I think we're about to see enough trend with over three stages to choose from. It's max coverage from all things crypto for 2 days non-stop. Institutions were here from Goldman Sachs to BlackRock. A bunch of blockchains in the multi-chain world were here too. Salana, Near, Ripple, and more. And VCs galore looking around for what's next. And the best part of being here was meeting the banter fam in real life. Remember, okay. Okay. Thank you. You're going to be so Janice. The energy here. Hi. Just look up and you'll see a freaking zipline over the conference. You'll see meditation centers, cold plunges, ice baths, coconuts, climbing walls, IV drips, activations, games, contests, and even a drone show to close it out in classic fashion. And what a difference a year makes. Last year when we came here, it was the historic floods disrupting everything. This year, smooth sailing with Ral Paul kicking off a banger conference. As we know, there's quite a lot going on in macro land right now. And straight after his talk, only cryptobanter got him in real life to talk to him about his patented banana zone and drive Bitcoin prices higher. All right, first talk of the day and we managed to get him hot off the press, hot off the stage. Well, it's the first time we've met actually in person, right? I'm very interested to talk to you cuz we haven't actually spoken since Trump got into power and uh he's turned the world upside down. When I say he's turned the world upside down, tariff wars, trade wars. I'm kind of interested to know what you think his agenda is. I think it's more about taxes. Is how do you service the debt? Right? If you see everything through the eyes of this massive debt burden, how do you service it? Well, you can tax foreigners via tariffs. That's one way of doing it. Now, are you going to bring factories back to the US? Is it going to be the rise of the blue collar worker? No. Cuz go to a Tesla factory. There's no humans. It's all robots and AI. So, what are you doing? You're giving jobs to robots. I mean, that's the worst possible outcome. So, it's not about that. Yes, you get some foreign direct investment in the US, but really really it's about how do you service this massive debt load. So the posturing that China's done is that they're standing fast and they're not going to budge and they want to sit down on a table with the US, but they're only willing to do it when the tariffs disappear. Who's going to collapse first? So China has tariffs on the US anyway. All people are trying to is get to some reasonable equalization of tariffs. And really what they're going to get to is some generalized agreement that okay, these industries we need a bit more equalization. These ones a bit less and these ones will be exempt because they're too important to both of us. That's what the outcome will be in the end. There's a narrative on Twitter and it's it's a narrative that's been going around that there's always that the US wants to get uh the the bond rates down, the yields down, and China has been selling some of their Treasury holdings to stop them from doing that in what they call financial warfare. the fact that the Chinese currency is so weak they're having to sell their dollars to defend their own currency. My next question is how does this end? And I kind of know what your answer is is they print more money. Right. Well, it's already happening. So already US interest rates are too high for the debt and so have to keep printing more bonds or creating more debt to pay for the old debt. So who's going to buy those bonds? So what they do is force the banks to do it. So there's something called Basel 4. I think we've spoken on the show about it before. Basel 4 is a new kind of globalized system of which the banks hold more treasuries and more European government bonds and more UK government bonds. Then there's the SLR change in the US which is the US primary dealers holding more bonds. You mentioned that there's maybe there's not going to be a recession. You said you don't think we're going to go into a recession. So for it to be a recession, you need that over two quarters. Quarter one, the Atlanta Fed is forecast. And the forward-looking indicators of liquidity have been doing this since. So they're flooding the system of liquidity. Liquidity leads growth. So I think it's a one quarter, one and a half quarter affair before the economic indicators start turning up. So I don't think it'll be a recession. I think it's a air pocket in growth. So I want to talk to you about the M2 money supply chart because I think you've become you started the banana zone and I think now you're becoming the M2 money supply guy. It's the same thing cuz don't forget what does it show phase two of the banana zone the M2 money supply the global money supply which is a proxy for um total global liquidity is just going higher and what is driving that the weakness of the dollar so I was about to say is it real M2 money supply growth if it's just the dollar depreciating 10% against every other currency that makes up the M2 yeah so that's the biggest factor then M2 growth is growing US growth is positive. Um, China's been positive. You know, M2 growth is growing everywhere anyway outside of dollar M2. But wait, take me back one step. So, if the M2 money supply looks like looks like it's growing. Yeah. But it's actually because the dollar is degrading. No, but if you look at it in local currencies, they're all rising now. So, it's all rising but not as much. Exactly. And the dollar is the accelerant. Okay. Cuz the dollar is the the liquidity for the entire financial system. So the weaker the dollar is, the easier it is to get hold of dollars, the easier it is to service your dollar debts. All of this works. So that's what's that's what's really happening. And that trend won't stop for a while. So what do you think the markets are waiting for before we go into acceler accelerate mode? Or do you think we've already hit accelerate mode? I think we've started the accelerate mode. I think we hit the bottom. It's been following that M2 chart. Expect that chart to fall apart after a while when everybody's following it. But we should now just rise the wall of liquidity going forwards and that should be all the way until the end of the year at least we think into Q1 Q2 and it doesn't seem to stop which is an exact replay of 2017 and Trump. Same thing happened the weaker dollar the whole thing M2 the whole thing is identical and what we got was a ripper of a crypto bull market. So you know when I walked into your talk I had my dad with me and I said you know everyone loves Ral Paul. You know the reason why they do is cuz he's always bullish and here you are always bullish. Always printing money. You're always printing money, brother. So good to finally meet you today. Good to see you, my friend. Good to see you. Thank you very much, guys. That's Ra Paul and obviously he's always bullish. That's why we all love him. Who's also bullish? Well, this guy riding in in style on the ultra impressive zipline, Arthur Hayes. I mean, come on. What other conference has a zipline? Let's talk to Arthur and find out why he's so bullish. Another person that certainly needs no introduction to anyone on the channel and no one and everyone else here. No introduction necessary to Arthur with us again. Arthur, good to see you, my friend. Thanks for having me. It looks very bullish here, right? And you spoke on the stage and you were bull you were bullish. So why are you so bullish? Uh so I think that the setup is just perfect for a rally in risk assets just like we saw from third quarter 2022 until early 2025. We a similar setup today. We have a lot of fear, uncertainty, doubt in the markets and the authorities, the monetary authorities especially in America cannot handle that and so they're going to resort to money printing. But there's not enough fear, uncertainty and doubt. I mean it's nothing's broken yet. So surely they're not going to intervene yet. Well, there something broke. Something broke in April 9th and the move index hit 172 intraday. There were people blowing up. Basis trades were going nuts. Hedge funds were getting stopped out. Jamie Diamond gets on CNBC talking about the markets are in trouble. Trump walks back tariffs the next day, 90-day pause, all that. Investing gets on TV a few days later, talks about how he's got buybacks to make sure that the Treasury market is well functioning. I think people are getting a bit too scared. Oh, I want to see the Fed cut. I want to see the Fed do. That's 2008 to 2019. We're in a different situation. This is all about the Treasury. Jenna Yellen printed$2.5 trillion dollars from 2022 to 2025. Bitcoin went up 6x. Vessed has to do something similar and so that's why I think April 9th was the bottom and we're going to go much higher from here. Okay. I want to talk to you about the trade wars. So right now it's become a war between China and the United States. How does it end? Uh there's going to be two financial systems. US centric one, China one. There's going to be two trade spheres. US centric one, Chinese centric one. And so we're bifurcating the world. And it's a very inflationary because China and its I believe hundreds of millions of workers and its very efficient manufacturing base was a reason why developed market inflation was so low from the early 2000s until present and now you know for obvious for other for reasons they want to separate and we're going to take all the supply chains and move them from China to US. Do you buy into the thesis that um Trump wants to reduce the the 10-year Treasury yield, the the the rates and China at the same time is dumping uh uh uh debt into the market to stop him from being able to bring down the interest rates? I don't think China is dumping Treasury debt because number one, I think that would really escalate things beyond where the things are today. If China's actively selling treasuries, they could always sanction China and pretty much freeze our entire banking system if they started to do that. So as much as it sucks that China has, you know, almost a trillion dollars of treasuries, that's what happens when you lend someone so much money. That's now your problem, right? So they can't get out of the trade, they'll let it mature, but they will not be dumping treasuries because the US could easily freeze all that money like on the gauge of bullishness 0 to 10. How bullish are you now like to start buying? 10. 10. You're deploying all in. We're all in and also not yet. Bitcoin Bitcoin is I think Bitcoin dominance goes at 70%ish. Uh, Bitcoin goes to 150 some level somewhere around there thousand and then we start to get the rotation into all the coins. Still bullish ETH? Yes. Still bullish Salana? Yes. Eth or Salana? Which one? I think if I had a fresh unit of fiat capital, I think ETH performs better than Salana and the stash. ETH performs better than Salana. Correct. Tell me why. Because it's the hated asset. And if the price starts performing well, all of a sudden all the things that make ETH eat are great. It's very secure. highest, you know, most amount of value on a cliche, most amount of developers, highest amount of like, you know, TVL locked up on a DeFi application. So, what's the next one you'd put your money on if you had a fresh unit of fiat? Um, Ether. Etheri. Tell me why. Uh, so Dave just launched a uh card. Let me uh pull it out here. Look at this. Etheri platinum Visa card. I can I can spend stables. I can borrow against my stake ETH. Um, all these sorts of things. I think Ethery is building the American Express of DeFi, right? Do you want Do you want to be long American Express? I want to be long where rich people spend money. Rich crypto people are going to spend money on their Ether card and they have committed to taking a certain percentage of that revenue and buying back their token and distributing it to stake Ether. So, I think it's a great that's one of our bets right now and yeah, I'm an adviser on that one. See you tomorrow at your party. It's going to be lit. We always cover his party and I'm kind of glad that it's on my last night here so I can sleep on the plane the next day. Exactly. Yeah, brother. See you tomorrow. Thank you. And here you see it. Arthur's party is always like him, legendary. Now, I could go on about the 300 plus parties and events across Dubai, but for today, let's just keep it all about business and bullish. Enter Joe Mccan, one of the smartest voices in institutional capital who's well, max bullish. So when we spoke to Arthur, what he said is he's very very bullish. In fact, he was the most bullish that he's been in a long time. I wonder if Joe's that bullish. How bullish are you? Uh max bullish. We we had basically this risk asset wash out based on tra trade policy uncertainty, which is now that trade policy uncertainty has peaked. We are now kind of coming off of that and you're seeing risk rise. But more importantly, they're going to have to actually flood the markets with more liquidity. There's really no other solution and of course we know that Bitcoin and crypto benefit the most from that. So do you think I mean there is still a trade war between China and the US that China's standing fast. The US is standing fast. Do you think that the worst is over? China PMI data came out and it actually contracted over the past month. That's not good. 40% of China's GDP is export-driven. And if they're shutting down factories and laying off workers, eventually that could lead to social unrest in China, which is China's biggest fear is to have a level of social unrest that they can't control. So what are the alternatives there? One, well, they could actually stimulate demand internally by flooding the market with cheap liquidity, maybe making loans more easily to obtain, etc., etc. Or two, doing some sort of compromise with the Trump administration. I So India is cutting a big deal right now. Japan is cutting a deal right now. They're loosening things on autos for Canada and Mexico. That's supporting Canada and Mexico. That was not the case on April 2nd. We're going to see more of this. And I do want to call out that the 90-day pause ends right around July 4th, which is Independence Day in the United States. You cannot think for a second that they're not scripting all of this for TV. They absolutely are. And when they get these trade deals done, you want to be invested ahead of that. All right, so we know it's going up. What are we buying? Uh, well, Bitcoin. Bitcoin, obviously. I mean, I've been saying this for a long time. You know this. I've been on your show saying this. When the ETFs came out for Bitcoin, I basically was like, Bitcoin dominance is going to continue to go higher for a very long time because I think a lot of people in crypto, especially retail crypto traders, don't understand the magnitude of institutional flows. Okay? As these institutional flows come in, they're not going to Ethereum because people can't understand what Ethereum is. It goes into Bitcoin. And as more and more of those flows go into Bitcoin, you have to be overweight. Bitcoin, period. Now, Bitcoin. Yeah. So, Bitcoin, we're short ETH. I see no reason to own it. We have it as a hedge in our portfolio. Fundamentally, I've been saying this for years now. There is no reason to own the asset. The technology itself was like the Blackberry of smart contract platforms. There's better L1's out there. Obviously, I'm a Salana bull, but there's better L1's out there that bring real utility and use cases for mass adoption versus Ethereum. All right, what else? I like Salana, of course. Fundamentals are crushing it. They are twothirds of all blockchain activity across every network, even in the slowdown that we've had over the past few months. What else? Uh, and I do think, believe it or not, I can't believe I'm admitting this, I think Ripple is actually a good trade. I know. Now listen, you ask me as a trader or an investor, where do I think there's upside? Part of the reason is, remember, I run a fund. Ripple is one of the most liquid assets out there. Wow. I I I can't believe what I've just heard, but you heard it from the man himself, Joe. It's so good to see you, brother. Good to see you, too. You know what? I keep saying here, people like you. And you know why people like you? Cuz you're always bullish, bro. Thank you. All right. Let's bake from the bullishness, take a look around the conference, hit outside from all the activations, and cross over the bridge to the Binance Clubhouse, their signature sides across the street with a packed house to see the legend CZ talk all things macro. But I just try to observe what's hot and try to follow. And to talk all things Binance, we went behind the scenes to sit down exclusively with Richard Ting, the new handpicked successor and CEO. I managed to steal 15 minutes with Richard. I think you guys all know Richard. Richard, how's life, man? You've been around for 16 months now at the helm of of Binance. How's life? Life is good, very hectic. Uh we continue to push forth to build the best-in-class platform for our users and we have seen very very strong growth globally. So very thankful for all the support and confidence of our users. So I really want to understand the journey. So when you before you got to Binance, what what did you do before Binance? I was pretty much a financial services regulator almost all my life but I got to know crypto right about 2017 and the more I understood crypto and I really believe is going to be the future of finance at that point in time and my hypothesis is that crypto needs two elements to go mainstream the first element you need clear regulations without clear regulations you can get the early adopters in but after the next 5% after the first 5% the next five the next 10 those people may not understand as well and they need a framework for them to understand to have user protection etc. The second element is institutional adoption because crypto used to be very retail based. We saw that in 2024 finally with the approval of ETF in the US all the institutions from Fidelity to Black Rockck to Charles Swaps all starting to embrace this space. So it's exciting. So when you walked into Binance it was one thing and I'm sure you had a big set of focuses. What were your focuses for the first 16 months? And I'm going to ask you what your focus is now. So, so my focus has not changed, right? So, I when I became CEO, I said that my priority are three-fold. Firstly is to really build the best platform out there to serve our users in terms of security, in terms of compliance, in terms of product features, give the users what they want. I think users have continually repaid that confidence in us. Right? So, um and if you look at user numbers, they have continued to grow from strength to strength. We started 2024 with 170 million users. Ended the year with 240 million users. Today we are north of 270. So in the course of 15 months we added more than 100 million users. Right. So that's a big testament from users. Secondly, working with global regulators to really support the development of this sector crypto adoption. We are now the most regulated exchange globally. We're regulated in 21 different jurisdiction. Right. And last year we have onboarded uh we have seen a huge surge in terms of institutional onboarding on our platform. So 97% increase last year. Wow. This year for the first quarter it the the growth number are are still very robust. Right. So it's better than the fourth quarter of last year. The new the new customers you're saying are primarily main mainly led by institutions. Yeah. There's a good mix of institutions and retail but there's so much more institutions in this business now. Right. So they come from all over from sovereign wealth funds to high net worth individuals to family office to traditional trading firms that now add crypto. What I mean I know you probably don't have the number handy but what percentage of institutional traders right now have ventured outside of Bitcoin? Well I don't have those figures. I'm quite interested but I think the figure is still small small under 10 under 20 under definitely under 10 because under 10 if you if you think about it most of the institutions their due diligence process is very long right so first they have to convince the board of directors uh you need a strategy they will think about it how much interest are you guys getting from from nation states from sovereign rail funds from plenty plenty so I I do think that you know with the election of President Trump towards the end of last year being the pro- crypto president. Um and you know the US is the largest capital markets in the world. I think that changed the narrative substantially, right? Uh after he's elected a we get a lot more approaches by different governments to say, hey, if President Trump is investing big time and has appointed a AI and cryptoza in the US that demonstrate that these are the most two important foundational technology of the future in our view. This this region I mean UAE is a very forward-looking country. It has always been an very forward thinking. I mean, if you look at AI, blockchain, they ahead of the curve compared to many other countries. So, we're going to see a lot more convergence between finance, crypto, AI. Uh, that would be the future. Richard, it's so good to see you, my friend. Thank you so much, guys. We're going to shoot back to token 2049 cuz there's lots to cover there. We shot back across the bridge, under the zipline overhead, past all the big sponsor stands, through the crowds that were literally non-stop, and back to our set to start taking deeper dives to look for narratives that we should be looking out for. Okay, I know you've heard this before, but there are some people that are still bullish on gaming. Off the grid launched, probably at the worst time, no gaming run, but you're still bullish. Tell me why. Yeah. So, first of all, when you have take a look at gaming as a broad sentiment, the reason why gaming hasn't had a good run isn't because of utility. Right now, we have something like 7 million daily active players playing web3 games. That's seven times higher than it was 3 years ago and about 100 million registered users. So, that's not bad. But we have to understand that tokens are more than just utility. Something like 70 or 80% of the tokens are there for market pricing. They're speculative in nature and they give us information about resources kind of like a commodity or a stock, right? Which means the macro of gaming is affecting the token prices, not the games in and of itself. Right? So I give you an example. Last year what was really hot AI. AI tokens do really well. But how many people are actually using the AI tools, you know, on platforms? Hardly any. Hardly any in comparison, right? And the reason why we are so bullish about sort of second half year in terms of gaming and how it's going to affect gaming tokens is because of Nintendo Switch 2, the launch of Mario Kart, and the biggest one, Grand Theft Auto. There's going to be a macro gaming shift. macro gaming shift which will flow straight into web 3 because tokens have this mimetic quality where they basically follow what's happening in the macro market as well. Who will be the custodians of that in the crypto world? Who will who will be the beneficiaries of that? Basically the majors or strong fundamental projects, right? So strong fundamentals. So I mean we can quote our portfolio, right? Uh but we're very bullish on Axi Infinity as a result on things happening to Ronin. Obviously bullish on things like um um you know Sand um know we do like Godzilla a lot. I mean we're investors. I think the point is they did launch at a very tough time but they would benefit from the narrative of gaming even smaller titles like Crossy ages and so on. Are you macro macro bullish? I know you're bullish macro gaming but are you are you bullish on the macro environment? I'm I'm bullish on macro 2 for a whole bunch of reasons because particularly crypto is basically to me the way that you deal with these uncertainties. I have to remind people all the time crypto is not affected by tariffs directly, right? There is of course a macro sentiment issue, but at the end of the day, you're not, you know, some Chinese dude sends Bitcoin over to America, he doesn't get tariffed on that, right? That Well, maybe that's the one fair trade that is that's not getting tariffed at the moment. Exactly. And so that's my that the point is is that that kind of exchange you don't have to worry about. There's going to be all these new stable coins issued in America. We have our own stable coin with standard charter in Hong Kong that's going to onboard masses into the space. So, generally speaking, very generally up into the right. Generally up into the right. You'll hear me say this all the time, but the thing is you just again draw the chart over the last 5 years and it looks very positive. But again, gaming will have its moment because of these two things and it's going to really really shake up the space and that's why we're bullish. But basically, opportunity to go for liquids. I had Arthur Hayes on here and I had Ral P. Now I've had you. And I think you guys must be the three most liked figures in crypto. And why? Because you're always bullish. So that's more bullishness leading us right into our break. So good. Stay tuned for our man FFA taking to the floor talking to real traders and builders and gauging the sentiment on the ground. I'll be doing a live sit down with a hotly debated mantra. And now a word from our sponsor Albany. Elbank was founded in 2015 and it's a centralized exchange offering trading for 700 plus tokens in 180 plus countries. It supports spot margin and futures trading with up to 200x leverage. It also has staking, peer-to-peer, and a whole lot more. KYC is optional but required for full access. ElBank supports over 131 fiat currencies with multiple payment methods like Visa, Mastercard, and bank transfers. We're back on the floor here at Token 2049, the preeminent global conference that has become the place to be the biggest spectacle and the biggest stage for the world's crypto speakers. Taking our tour, we run into Elbank, our sponsors for this special episode. All righty, we're here with our sponsor. These are the guys that bring us the coverage here of Token 2049. LB Bankank, guys. Thank you for sponsoring us here. Tell us a little bit about LB Bank exchange. Yeah, thank you so much for uh this. And Albang is a global centralized exchange and yeah we are based in different global regions and also in Dubai and uh we have like more than 800 tokens and we are the top centralized exchange and I'm the event manager. We have been frequently doing events in this region and globally as well. If I'm trading on one of the other exchanges why should I go to Elbank? Elbang is one of the best if if you want to trade the meme specifically meme coins. Lots of trade volume lots of liquidity. Yeah yeah yeah. In the coin market cap, we are in top 17 number ranking and yeah and we are going every day. We are doing events in different regions as well. Really excited for the token 2049 and yeah looking forward to the other events as well. Amazing brother. Thank you so much. Thank you so much guys. These our partners that bring us this coverage that partners us at school. You may see them on some of the shows. Give him some love. Give him some support. Also supporting here at token 2049 is our man Fe in from the live stream to check in on the floor and to tell us what's really going on with traders, builders, and everyone else. FFE, take it away, bro. Thanks, Ryan. We're out here right in front of Eric Trump's speech, a token, and if you see there is a line of security behind me. It's absolutely crazy. No one can come out, no one can go in. So, I thought we just going to go around and find someone what they think about the conference and what the Wii is about. So, come. Hi. What do you think about the conference? Is it very good? Very good. You enjoy yourself? Yeah, enjoying right now. What do you think about the market? I think maybe it's a bulldog. What do you think about the market? Uh, it's a little stagnant right now, but I think we're I think we're about to see an uptrend though. I think it's going to rip. Honestly, I think the market now is starting to recover. It's like always up and down. Uh, I'm really excited. I've been bullish for a very long time. I think we just take bullish uh out of the downtrend. I think we're starting to see the uptrend now and uh it's going to be a fantastic year. Everyone is bullish. We interviewed Arthur Hayes today. He said Bitcoin is going to 200K almost this year. So I'm also very bullish. Is the narrative. So I think uh the merge of web three and AI is the current um cycle. I think I'm bullish. I think it's uh the market will will boom. I I would hope in Q3 Q4. Yeah. What does that mean? We're at token 2049 and Eve's not even token 2049. So that's a little bit of a problem. Market splash. I was expecting a bit more bullish 12 months going up. Of course, what is really exciting you in the next 6 months in crypto? I think I'm looking for the projects that actually have adoption, right? Uh a lot of the problems in the industry right now is that actually people don't really use the product. It's a very small circle. So I'm looking forward to actually seeing projects that coming out that actually have real users. So you guys also work on distributed networks and bringing people in with through deepen. How do you solve adoption? We have a new economic model to incentivize people to put infrastructure. Half the world is unconnected. So that was our first target market. The other half the world is exploited. Uh right now heading over 2 million users about to launch main chain in the next two to three weeks as well. So that's very exciting for us. What do you think about the conference? Amazing one. I was just listening to Eric Trump. It's so crowded, you know, many people and it's just like hard to manage everything. It feels like tripled the amount of people, triple amount of good conversations. The statement from Eric Trump, from Justin ring the beginning of a new crazy revolutionary era. Everyone should come at least one token in their life. So what do you guys do in the space? So I'm co-ounder of Axelr. uh Axelar solves a problem of fragmentation in the space. Now with the emergence of AI and how easy it is to launch new layer 2, we envision that there's going to be more than a million chains in the next 10 years and if we want to on board the next billion users to the space, we need seamless user experience. How do you guys solve this and why better than anybody else? So Axelar is offering interoperability technology that enables users to easily navigate the crosschain ecosystem. So the way we envision the future is that the user will have a single interface. Under the hood, Axel is going to offer the technology, the infrastructure that will facilitate this crosschain communication. So the user doesn't have to think about different wallets, about different chains, just assets and applications. Thank you so much, man. I appreciate you. I appreciate you. What do you do in the space? I have a YouTube channel. I work with Ledger. So secure self custody today. And you guys have the cold plunges outside when we tried. So now we have the cold plunge outside cuz we're doing a collaboration with Punchy Penguins. So it's ice outside, cold hardware inside and that's how you stay cool. Oh, these are cool people. So tell us short what do you guys do? Uh tokenized real estate. So RWAS in general but focused on real estate initially. How do you see RWA's evolving in the next 6 to 12 to 18 months? Well, we're starting in Zanzvar. So I think it starts with sovereignty from the top down. So we're working uh with the government similar to DIFC or ADGM here being able to have a framework for rural assets starting with land and then gold and then others. How do you see the market evolving? How do you see the industry in the next six months? Oh, in general I think it's very I'm bullish like I'm being able to see that onchain to connect to value in real time. It's unprecedented. What do you think about the market? I I didn't look at it, but we can smell that the green is coming. Now, Eric Trump is speaking, so probably the market is pumping. I'm bullish. Bullish summer. Bullish summer. Bullish shortterm alltime highs in this year. Yeah, but earlier than most people are thinking. Thanks, Fif. For a more sobering look at the ups and downs in the industry, we're talking to JP from Mantra. We had him on our show from Hong Kong previously, but since then, as you know, things have taken a turn for the worse. All right, here's someone that needs no introduction. You all know him because we've spoken to him before. He's the founder of Mantra, and Mantra's been through a hard time. I would have thought you would have maybe kept a low profile than walked through the biggest crypto events out there. Absolutely not. I mean, just like we did in the wake of the incident, being front and center is incredibly important. and I just got off stage um talking about, you know, what happened and and really more importantly what we're doing about it and what what what the way forward from Hunter looks like. So, look, we can't change the past. Exactly. Learn from it. Exactly. What are we doing going forward? What's what's the route forward? No. So, I think we're doubling down on, you know, commitment to transparency. We put out this dashboard that has real-time monitoring of all tokens. We welcome community feedback on how we can improve upon that. So, we can see bridge flows, exchange inflows, all different types of onchain information. Um honestly just getting back to building right we launched our EVM test net which we haven't told anyone about yet two weeks ago in the midst of all this crisis so you know shipping product uh bringing assets on chain bringing new TVL RWA deals this is something that is kind of our bread and butter and we need to focus on building and shipping um more than now more than ever but what about token tokens I mean you know we don't really know what the story is think that a lot of people or one person or somebody or got liquidated that mean a lot of tokens out there in the market. Is there like a plan to get those tokens out of the way? Yeah, so we've been in contact uh well, first off, we do believe that there is some supplies sitting on different venues that we've been, you know, working on getting back with, you know, both ourselves as well as our institutional partners. So, we've been working on how we can know bring that back off the market um in an orderly fashion. That's really really important. You know, one one of the things that this reminds me of is Salana. Yes. Cuz if you think about the Salana incident, you had one big uh investor which was SPF SPF FTX they were liquidated. They took the price of Salana and it's down to $8. Yeah. And then no one believed in Salana at $8 and then there was a recovery. Yeah. I mean is there a parallel here? Do do you feel like are you following the same playbook? I would say so. I mean to be honest any of these major projects have had their ups and downs or projects or you know tokens Bitcoin, Ethereum, they've all had their incidents. Salana obviously the most recent example you know we do feel like following that playbook getting back to building shipping heads down you know showing not tell you know not just telling is is critically important here so you know we're we're in public here at token and frankly after that we're going to be just building and back in the lab basically brother so good to see you well well handled appreciate it man let's talk again soon and if not soon then definitely a token 2049 in Singapore absolutely we we'll we'll be there thank you brother yeah appreciate it let's hope that By September in Singapore, things really turn around. Also needing a turnaround, it seems, is ETH. We managed to find a big ETH OG and the founder of Synthetics who thinks that ETH has actually bottomed and it may only be up from here. You all know I've pretty much given up faith in ETH. I've given up all hope. I w I've bullish. I watched the chart go down and down and down and I pretty much gave up hope. That's what you were talking about on stage. You were talking about the existential crisis in ETH. Yes. Can it be resolved? Just it can. It can. I I think it can make a comeback. Um tell me how or why. So um I think we're at a moment now where people have realized that the rollup ccentric road map has not worked, right? And so the question is are we pivoting away from that? And I think the reality is that there is now momentum towards scaling L1. And if we scale L1, Ethereum can become competitive again. But if you're going to scale the L1, why not just go to Salana? Well, it's a question of individual developers, right? what does an individual developer do? And there are still an order of magnitude or more solidity engineers than there are Rust engineers, right? Um, and so the developer ecosystem in Ethereum is much bigger and there is a high cost to moving to Salana if you're already in the Ethereum ecosystem. How long would it take to get make ETH a competitive L1? Like um I think to get L1 competitive, you need to bring some uh applications back to it. Um, so you know, uh, synthetics, the project that I founded, is going to come back to the L1. We were the first ones to go to optimism in 2019. We're coming back. So that is going to create blockbased demand on L1 directly as opposed to indirectly through blobspace. So why abandon the L2 road map? I think for me there's two things that failed. One is uh we created an environment where it's unclear to an investor which token to buy. Do you buy arbitum? Do you buy optimism? Do you buy some coin token on base? it it's not it's not obvious right the second thing is that um we've created a an issue of block space where the margin for block production is being captured by L2s not the L1 so we need to bring activity back to L1 to increase the margin that uh block production is generating for Ethereum but when you bring the people back to the L1 the L1's still going to be slow no no it it's actually much faster than it was much faster than it was and there's a very clear path to scaling it um we can raise uh the um the uh block size. There's a number of things that we can do and we also have just better technology. We have like off-chain um batch settlement. There's there's it's not the same network that it was in 2019. It's gotten better. What do you what's your views on the leadership? Like is Vitalik still the I think the Vitalic is still the leader. Um what has happened though is uh there has been some questioning of like the the methods and approach that Vitalic has taken by a lot of people in the community. And you know what I talk about on stage is this tension between the uh DeFi people and the kind of flowers and rainbows side of Ethereum right and that tension has been dominated by the Vitalic wing which has been not as DeFientric, not focused on DeFi. Um but DeFi has been the thing that's been driving activity. It's the it's it's Ethereum. DeFi is Ethereum, right? Um and so last year a lot of DeFi founders um including myself turned up and said you need to care about DeFi and Vitalic responded to that. And so I think we've seen this kind of reintegration of these two sides of Ethereum and this realization that DeFi is driving activity on Ethereum and we need to support it. You think it's the end of the of the ETH BTC chart going down? I think we're close to the bottom. You're close to the bottom. I think we're close to the bottom. EBTC. ESOL. What do you think? Uh, EOL, I don't think so because I think Soul has too much momentum right now. It's going to take a lot for people to be convinced that Ethereum is regaining its momentum. It's not going to happen in a day. Amazing, Kate. Thank you so much. Great insights. Thank you very much. For some other Opium, let's end on the floor with Fairfair and a special appearance from our correspondent Rebecca to bring some levity and laughs here at token 2049. I think there's a guy called Fairfair. I've been seeing him walking around. Seems like a good guy, bro. You're money. Let's go. And I will also make some uh stupid [ __ ] Over the right side. Yeah. Thank you. Come to my right side. All right. Do you Oh, that's so cool. I'm actually going to put this on. And other than the fact walking around with these plush things, what do you do in the space? I talk about crypto and the markets and news on Tik Tok. My handle's crypto. Okay. Check her out. Thank you so much. No problem. your story. How's it going, man? You good? Perfect. Pleasure. Pleasure. Come, come. Let's do an interview. It's going to be snippets. Hey, low bent fan. What do you do in this space? DJ, bro, all day in the trenches. Can I have a photo with you? Oh, yeah. You can. Hey, really? An interview? Okay. You watch the show? Yeah, of course. Really? Nice to see you. Better thumb. Hello. Nice to see you again. You guys are crushing it. I saw your stand back there. You're interviewing like Arthur Hayes, Yasu, all the big guys. So, hold on a second. What do you think about the conference? Good. I love it. A lot of people. What do you mean camels? We're getting some camels. Oh, camel. I thought like a camel. But this is cool. I'll come back for it. Just trying to find like ks or we need we need some ladies. It's a bit of a sausage party so far. Can I ask you a few questions, ladies? Cryptoven mentor. You got to run. Very busy doing interviews that you're trying to skip so badly. No. Come on. Come on. All right. And how are you enjoying the conference? Okay. Seems like it's a Yes. Good. And then what's going to happen? Is Bitcoin going to go up? Yes. Well, thank you. Can you Can you hear us? He must be so hot. All right, we're good. What do you think about the market? The market now or the market yesterday? Maybe. I don't know. Can I work with the ATH vodka? Cool. Yeah. ADHD vodka is here to take over. Yeah, of course. Okay. When can we taste it? Tonight. Done. Cheers. Done. Cool. How was yesterday? Uh, not difficult. Little bit of like you know did you recover yesterday? I am still recovering again. So now we continue. What do you do in this place? Uh I I make the food here at the event. I I make the Should we try some tea? Is that tea? Let's try some. Thank you so much. What do you think about the conference? Thank you very much. Nothing better than some Arabic coffee from a plastic cup. Wow. Look at this. Look at Look at this. Sorry. Sorry. Sorry. Sorry. You guys so good. Let's see what else we have here, bro. I'm going to take one of these. I'm actually taking two just in case. Oh, let's see if we can find someone here. Watch out. Yes. I want to have a chat with you. Yes. Oh, you want to have a chat with me? My brother always anytime. What do you think about the car? Today's been my birthday and best birthday I've ever had. Birthday. Yeah, because you know why? I've had a great lecture from a Bitcoin masters. What do you think about the market? Um, I think it will make the world grow. Do you do anything in crypto? Um, I'm going to try. I think I'll try cuz I before I I had no idea. It's so cool. You see, it's so cool. So cool. It's a crypto conference. A security guy walks up and he wants to talk. It's so cool. This is the proper proper crypto conference. Okay, let's go. Let's see what's happening here. Okay, I think that's it. Cool, man. Appreciate you. Thank you. Thank you. Cool. I'll catch you and I'll come back from one of these camels. Cheers, bro. Always nice meeting you. Thank you very much. Always nice meeting you. Are you good? Me off guard like have a good day. Thank you, too. Cha cha. And that's a wrap here from Token 2049, the global gathering that brings together the best in the space year after year, conference after conference. We've heard about max bullishness from all the OG's. And here's to hoping that the markets respond exactly as they predicted. On Monday, I'll be back at the studio and I'll be bringing you the daily live streams like no other channel can. Until then, trade well, my friends. Yeah, let's go run. Let's go, Krypto family. Yeah. Subscribe to the channel. Subscribe now to the channel. This is the place to meet, the place to learn, and the place to see what's happening on the market with clear mind like their boss minds."
}