{
    "channel": "CryptoBanterGroup",
    "date": "2025_05_12",
    "transcript": " We have uh reached the an agreement on a 90day pause uh and substantially move down the tariff levels. Both sides on the reciprocal tariffs will move their tariffs down 115%. So, so we have a I would say an unexpected trade deal with China uh and uh a 90-day pause on basically on on the tariff wars and that's basically sent the markets into an absolute tis. You can see that the S&P 500 is up 3% on the day. The futures on the S&P 500 up 3% on the day. That's what the stock bubbles look like. We're going to go to crypto. If you look at crypto, Bitcoin is below where the highest level it was trading at. It actually at one point during the day actually shot up to almost 106,000 but still above 104,300 which is very very very good to see. I want to talk a little bit about why Bitcoin isn't reacting as well as stock markets are are reacting and why it's the stock markets that are actually flying today and not the actual crypto markets. Then there are a lot of people that have been reaching out to me and saying look have I missed the entire run? Is this too late to buy? Should I be taking profits on this? I don't think it's time to take profits. I actually think it's time to start buying, but it's not time to start buying anything. Specifically, I've made a list for you of eight altcoins that I really think haven't started running yet. So, if you feel sidelined by this whole pump, and if you buy into this thesis that for the next 90 days, we're going to get a bit of a pump because that's how long the trade deal has been paused for, well, I've got a spreadsheet for you today with eight tokens that haven't yet moved that I think will actually move pretty quickly from now. And I've challenged my researchers to actually put uh researchers, put your names on sheets over here and let's see who gets the highest returns in the next 30 days. So, if that sounds good to you, what I need you guys to do is subscribe if you're not already subscribed. Obliterate the like button cuz the more likes you get on green days, the more energy I get, the more energy I get, the more alpha I give. At the end of the show today, at the very end of the show, I'm going to talk to you about a new token that's launching. You don't want to miss it. It's the contract's going to drop sometime in the next 72 hours. I want to talk to you about how you can get that contract first. So, let's get the show on the road, guys. Big green energy show. Let's go. Let's go. Let's go. Wakey wakey. Rise and shine. It's a beautiful green day. whether you're holding stocks or whether you're holding crypto. Beautiful, beautiful green day. Crypto had a very strong weekend this weekend. We're going to talk about some of the tokens that that ran this weekend. Also, I want to talk to you about these tokens that are moving here and why they're actually moving cuz one of our front runners actually broke it down for us. So, today's going to be all about macro. It's going to be all about altcoins. It's basically the full bag here today. The full bag here today. It's back to bull market mode here. Back to bull market uh mode here. If that sounds good to you guys, what I need to do is obliterate the like button. let people know that we are actually back and we are bringing you the highest alpha per minute show on the entire entire entire interwebs. Anyway, let's not waste any more time. Oh, before we do have to do one one announcement. So, last week on Friday, I forgot to announce the winner in the blofen competition. That is if you open up an account with Blofen, we're going to put we we're going to put before the end of the show, we're going to put $5,000 into your account. So because I forgot to do Friday, what we'll do is we'll do one today and one tomorrow during the show. All you need to do open an account on Blofen. This is Blofin. It's one of the best exchanges out there. Uh leverage and spot also um no KYC which means that no matter where you are in the world, you can sign up to Blofen because they don't actually ask you where you are. Um yeah, and so just do that. There's a link below. You've got to use uh this link below. This link below. So I see these guys are are changing the the the thumbnail here, right? They keep changing the thumbnail between the altcoins and the trade. They keep changing the Let me know in the chat whether you you signed up for the altcoins or whether you signed up to hear about the trade deal. Okay? Let me know in the in the coins whether you you signed up for the for the altcoins or for the for the trade deal. In the meanwhile, if you want to sign up to Blofen, there's that link. You must use that link to land up on the spreadsheet. Before the end of the show, someone will get $5,000 and before the end of tomorrow's show, somebody else will get $5,000. Then we all fair and square. Then we're all fair and square. Anyway, let's go. Let's talk about what's happening on the markets. As I said to you guys, you can see that the markets are running mainly the stock markets. You can see S&P 500 futures up. They were up 3%. They're up now 2.62%. The Nasdaq up uh 3 holy moly almost 4% uh on the day on the open. So, the the open happened 2 minutes ago. We got the Nasdaq up 3.9 uh% on the open. We got stocks up. Look at these stock prices up. Amazon up 8.28%. Shopify up 11.63%. I'm actually looking to make a bit of a purchase in AMD. How's AMD up 6% today? I don't know if I should be buying it. Yeah, I I will buy the dip. And the reason why this is all happening is because we got a bit of a surprise trade deal from China, right? We got a bit of a surprise trade deal from China. Why do I say a surprise trade deal? No one in their wildest dreams thought that the trade deal would happen on the first weekend of their negotiations. And the way that they framed this announcement, they've come out and the way that they framed this announcement is they've said there is a trade deal. Now, I don't know if I would call this a trade deal as much as I would call this a 90-day pause in escalations while we discuss a trade deal. But regardless of that, that's got the markets running. You got uh the stock market's up. As I said, Bitcoin off its highs. So, we're off the highs. The highs were about 105800. But very important to say this, where we're trading right now, we're on the cusp of being higher than the highest weekly close on Bitcoin ever. So the highest weekly close on Bitcoin was here, and that was at 10447. We're $200 away from that. And if we close higher than that, that is the highest weekly close that Bitcoin's ever had. So looking forward to a very very um uh uh good close uh or very very strong week from Bitcoin. The ETH madness carried on this weekend. And I'm glad to say that if you have been following me on Twitter at cryptomanran, I called this at the time Bitcoin was I mean ETH was at about 2250 or 2,300 and I said there will be another ETH pump this weekend and it's going to get to about $2,650. And guess what? That's exactly exactly exactly what we got. We got a pump in ETH and the pump took us I mean I I I I generally don't call them this right um a lot but you can see the pump took us to 26 26 which was uh which was the high and the reason why they wanted to do this is because they wanted to open a CME gap and I want to just show you if we can show if we can see the CME gap here. So they wanted to open the CME gap. So let me explain to you why they wanted to open the CME gap. Imagine these futures traders that are trading on the CME and they've got liquidation prices and automatic tradeout prices. They leave work on Friday. When they leave work on Friday, the the ETH is trading at 2350. On Sunday night, when the futures open, the futures open at 25 or 26. And basically, you cause them all to get liquidated or you cause this massive gap. And that's exactly what happened with ETH. So, for now, the ETH rally continues. Um, the good news is that when we're looking at the ETH and Bitcoin rallies, and when you look at the ETH and Bitcoin rallies and you look at the funding rates that are associated with these rallies, this is the highest price that we've been at with the lowest funding that we've been at. Now, that's a massive massive thing because that means that there is a lot of incentive for traders to take out leverage because the cost they're paying to hold that leverage is not very high. And so, this is a sign that we still could be pushed up a lot by leverage traders. Let's see, the researchers are sending me something. We always got to be um Okay, good. Okay. So, um the the um the leverage traders the leverage traders are are now um uh uh they still have a long way to go or or or a lot of leeway to actually take out leverage. So, from that point of view, this pump can actually continue. So, from that point of view, from a pure leverage uh point of view, this pump actually could continue. So, that's one of the the points that we have for the pump. And we'll talk about a couple of other points for the pump happening later. All right. So let's quickly recap why this pump is actually happening. As I said, we went into the weekend and I said to you before the weekend, the China America trade deal is probably the most complicated trade deal in the entire world. And no one in their right minds believed that they would go into the negotiations in Geneva on the weekend and come out on Sunday with that on the weekend. I don't know if you guys were watching some of the big accounts this weekend, but they were literally making a reality show out of the negotiations. At one point, the Chinese negotiators actually went to the bathroom. So like the Chinese negotiators have left the room. Everyone thought like the negotiators have left and that's the end of the trade talks and then bang they're like they returned from the bathroom and the negotiations have carried on. Like that is how much tension there was around these negotiations these trade negotiations. And at the end of the trade negotiations they actually came out and they announced a deal. They said the US announces a China trade deal in Geneva, which was I mean I think no one in their right minds thought that that there would be a China trade deal announced this weekend. Now I listened to the trade deal. I listened to this thing over here that I played for you guys. Just have a listen. We have uh reached the an agreement on a 90day pause uh and substantially move down the tariff levels. Both sides on the reciprocal tariffs will move their tariffs down 115%. We had very robust discussions. Uh so look, I don't know if this is an agreement or an agreement on a 90day pause. Either way, the White House and Scott Besson are framing this as an agreement, which is I think it's wrong because it's an agreement to pause while we reach an actual longlasting agreement. But it looks like the mandate to the White House is look, we need PR. We need strong PR that there is actually an agreement and so they're framing this as if an agreement has actually been made and you can see Scott Bon spoke very highly. In fact, you should probably listen to this and I think that led to a great deal of the productivity we've seen. Uh we will be giving details tomorrow. Uh but I can tell you that the talks were productive. We had the vice premere, two vice ministers who were integally involved, ambassador Jameson and myself, and I spoke to President Trump as did Ambassador Jameson last night, and he is fully informed of what is going on. So there will be a complete briefing tomorrow morning. So you've got you've so you've got this deal which has been announced as a which which has been announced as as like this big trade deal um by Besson and by um by agree Vice Minister Lee Chengong and Vice Minister Lia Men work very diligently and these are very tough negotiators. Um a couple of them I know from before and have had past interactions with them and this was as the secretary pointed out a very constructive uh two days. It's important to understand how quickly uh we were able to come to agreement which reflects that perhaps the difference. So were not so large as as maybe thought. What we wanted to see here was we actually wanted to see confirmation from the Chinese because the the worst thing that could have happened is the US announces a trade deal and the Chinese announce well there's not exactly a trade deal. It's a framework for a trade deal. But we actually did get it. So China's vice premier he lifang both sides reach important consensus. So they confirmed it and then you know I was saying look I don't believe that there's a real China deal on the table but who was I to argue against the polymarket odds which actually went to like 100%. Now again I'm not sure this is a trade deal. I think this is a 90-day pause whilst we negotiate a proper trade deal. And I think that there could be a lot of hurdles along the way before we negotiate what is one of the world's most complicated uh trade deals in the entire world. You got Bangkok B says big big fan of banter bubbles. It is the only one that can show you stocks and crypto. And also by the way the the thing I love here is I don't know if you guys know but if you click on live this is actually live. So like it like literally the bubbles are moving as the prices move in in real time. Anyway, back to the program. Back to the program. Um, let's talk let's talk about what this deal actually talks about. So, both parties are going to reduce their tariffs for the next 90 days. US to reduce tariffs on Chinese, Chinese to reduce and um and that's what's happening for the best for the for the next 90 days. If you want to know more about it, the full breakdown of the deal is posted in good morning crypto which is our free newsletter where there is a link below. It's absolutely free. No money involved, no anything. Just go and subscribe. Literally, you get the the news before the news actually happens. I think we're now going to be moving into a a stage where we're going to get a lot of trade deals. I think they started off last week with the UK. Now they announced this deal on China. And I think what we're going to get for the next 60 maybe 90 days is just a lot of trade deals actually happening. Deal after deal after deal after deal after deal. And that's going to drive the markets up. So maybe maybe for the next 90 days, Trump has given us a license to actually buy the stock market. Remember last week he came out he said go out and buy the stock market. and we all went out and we bought the stock market and today we're actually all celebrating. Some people that didn't buy and now they're feeling sidelined. We're going to address those people towards the end of the show. I promise you towards the end of the show if you've been sidelined, I'm going to tell you exactly what you need to do. Okay, so that is the weekend and the weekend was actually quite a big weekend for Trump. It seemed like he was in a lot of places at once and a lot of things were actually happening on on the weekend. So, let me give you a few other examples. Number one, Trump says Putin wants to meet for talks on Thursday. They're meeting in Turkey. uh they want to meet uh with Zilinski and they want to put an end to this bloodbath immediately. So it looks like there's a peace deal trying to be negotiated between between Russia and Ukraine. And I mean that war really needs to come to an end now. That that war really needs to come to an end now. Then there was the India Pakistan ceasefire which Trump broke it and then it was broken down. So I'm not sure if there's still a ceasefire. Maybe if you're in India or Pakistan maybe just update us on on the situation. There's the Zalinski and Putin meeting. is a trade deal. And then Trump came out on True Social yesterday. He said, \"I'm going to make the biggest announcement and the most impactful announcement ever.\" And I actually think he's right here for the everyday person in the United States. What he announced last night was he signing an executive order that drug companies have to reduce the prices of drugs in the United States by between I think he said 30 to 80%. And the reason why why he said that was he said that in the United States prescription drugs are way more expensive than in any other country. Now, I don't know if you guys have been to the United States and if you don't have medical cover and even if you do have medical cover, holy moly, do they rape you when you go and try and buy prescription drugs, stuff that I buy here in South Africa for like $2, $4 in the US can cost up to $400. So Trump says, \"I'm pleased to announce that tomorrow morning the White House, I'll be signing the one of the most consequential executive orders in our country's history. Prescription drugs and pharmaceutical prices will be reduced almost immediately by 30 to 80%. They will rise throughout the world and equalize for the first time uh to bring I will be instituting a most favored nations policy whereby the US, United States will pay the same price as the nation that pays the lowest price for drugs in the whole world.\" Why am I so excited about this? Obviously, I'm excited about this because Americans are going to pay less for prescription drugs and having lived in the US for a while and realizing how much more expensive how much the drug companies in the US rip you when you want to buy um uh prescription drugs. I actually think it is revolting and disgusting that that happens in the United States. On top of that though, remember that a lot of the monthly expenses that people pay in the United States, a lot of the monthly expenses is actually prescription drugs, right? And the prescription drugs actually increase inflation. And so by doing this, you're actually bringing down inflation a lot without slowing down the economy. So, if you can reduce the price of prescription drugs and every single household in the United States is spending, I don't know, 5% of the income, 10% of the income on on prescription drugs, whatever it is, and you bring that percentage down by 80%. You're automatically going to bring down the amount of inflation in the United States. And remember, this week, it's actually tomorrow, we have a massive inflation reading. Not exactly sure what the inflation numbers are going to be, but I see that true has got them at 1.57%. Right. So, yeah. Um so uh price is coming down. Prices coming down. Inflation should be coming down. Uh let's actually see what the expectation is for for the inflation numbers for tomorrow and then we'll obviously be here live when 2.4% the expectations for tomorrow 2.4%. I think they'll come in lower and then we're going to get a beat on the inflation numbers. All right. So all this amazing amazing amazing news after Trump told us last week we can go and buy the markets. means we we should have bought the markets. And if you did, you're making 2.53% on your S&P trade. You're making a lot of other money on all the other trades. The one problem though is no matter what Trump is doing, as you can see, the 10-year Treasury yields or the Treasury yields ain't coming down. And this is a massive, massive, massive problem. Right? Remember, we thought that Trump want well, Trump has to get these numbers down so he can refinance the debt. problem is this ain't coming down. And I kind of like what Kabisi said here. He said tariffs. Trump raises tariffs, yields rise because inflation is back. Trump's cuts tariffs, yields rise because growth is back. Trump does nothing. Yields rise because the Fed won't cut rates. Trump is really struggling to get the yields down. And this is the elephant in the room that no one's talking about. Yes, we can celebrate. Yes, the market's on. Yes, everything is amazing. But the one thing that we do need to talk about though is the fact that the these yields ain't coming down. We need these yields to come down so that the Fed will land up cutting interest rates. And so this is the one chart that everybody should be watching while everybody else is dancing in euphoria um about the markets actually exploding. Keep your eyes on this chart over here because this is the one chart now that is actually worrying me. Why aren't these 10-year Treasury yields coming down? Why are the markets not giving them a break? We need to keep our eyes on this 10-year Treasury. We will help you along the way when this happens. But for now, the music's on. We need to be dancing, guys. That's how it is. The music's on. You need to be dancing. One of my friends actually WhatsAppapped me this morning. Uh, let me see if I've actually got the WhatsApp for you. I'm sure I'm sure I've got a few. Let me actually I've got to open this WhatsApp for you. Hold on. Uh, here we go. I'm not going I'm not going to open I'm not going to show you his name because some of you might actually know him. Um, he's quite private. So he asked me this morning, he said like, \"Are you taking money off the table?\" I was like, \"No, bro. The music's dancing.\" So I said to him, he says, \"Are you taking some some profits now in crypto or are you holding all main stuff?\" I mean, I said, \"Bro, I'm holding. The music's on. You got to dance.\" You've been waiting to get into this nightclub. You've been waiting for this music to start for the last 3 months. You've taken a lot of pain. It's almost like like I said, it's like you're going to to a bar or a pub and you stand outside from 8:00 at night till 10:00 at night because you're not there with a beautiful lady. If you're there with a beautiful lady, chances are the bouncer will let you straight in. That's the that's the trick, guys, for those of you who don't know. But or or you've got to book a table. And if you book a table, it's going to cost you like $10,000 if you go to Miami, right? But otherwise, what you see here is it's it's like you've been waiting for this specific DJ to come up or to get into this specific party. Now, the music's on. Now, the worst thing that you can do when the music's on is basically say, \"Okay, I'm leaving. I'm cutting my losses. I'm leaving.\" You got to ride this wave. And specifically, if the wave's going to start carry on going for 90 days, right? There could be a lot more upside left in this move. There could be a ton of upside actually left in this move. I just show you some things over here, right? Um, if you look at the just from a plain charting point of view, uh, there's there's a lot of upside if we continue on this on this upward trend. If you look at the number of coins that are above their 100 day SMA, the number of altcoins that are above the 100 day SMA, what you can see is that there's actually like a very very very few coins. And in order for the market to become overheated, you kind of want this ratio to be quite high. Now, a lot of people want to sell now. And the reason why they want to sell now is a very simple reason, but it's the wrong reason. The reason why they want to sell now is because they have PTSD from the last move, right? The last time they were overinvested in the market, they got rinsed on the way down. They managed to hold on and they kind of said, \"Look, if these coins get anywhere near my break even point, I'm out.\" I've seen that before. Problem is, you land up missing the entire run because you went and sold at the beginning of the party, right? You went and sold at the beginning of the party. So now, look, if you got a a high leverage position or if you if you got yourself into trouble, probably now is a good time to get out if you're break even. If you're if you're coming for the ride, then I'd use a strategy of a stop loss here. And I'd say, look, let's just set yourself a level which is a little bit below where we are today or not a little bit below, but substantially below where we are today and use that level as your exit level. But otherwise, try and enjoy the upside. Don't cut away your your upside here because remember that when the altcoin market runs, there's a lot of run left in this run. Like all of these coins have got to move over their 100 day moving average. And then you know you move up these levels. So let's look at like the 200 day SMA. So you got to move you got to toggle you got to toggle around these levels and it just shows you there's actually a lot of upside left in in this move. I want to quickly just talk a little bit about the altcoins and then we'll get to the spreadsheet. So as you can see the altcoins absolutely running. You can see that uh you got pi. I don't really like covering pi but we will do something about it with the meme coins again. Again these meme coins have started to explode. It's like we learned nothing. The main thing that is running obviously is this ETH run. So this ETH run is continuing and I think it's I mean if you look at how aggressive this ETH run has been I saw this analysis by Jim Biano which says ETH is up 40% in less than 72 hours. Over the last 3 days close to current ETH is up 38% which is the largest rise over any 3 days since January 2021 and the second largest rise in the last eight years. So, it's been an amazing amazing time for ETH. A lot of it is because ETH was oversold and a lot of it was because ETH was shorted. I want to just show you something here. We showed you last time how the oper how the the the leverage traders on ETH were the ones that actually got liquidated. If you look at the ETF inflows on ETH, so let's just look at the ETF inflows on ETH. The ETF inflows on ETH actually weren't very strong, right? Like look at last week. ETH had the biggest run that it's ever had. that actually the ETF flows were close to negative. Actually, they were negative last week. That shows you that the majority of the move actually wasn't spot driven. The majority of the move was actually driven by people getting liquidated. And now is the real test for ETH because now the I read this from Dan Krypto. He's right. He says we need you'll need to see sufficient spot bit to maintain prices at these levels, right? cuz now the CME guys have been liquidated, the crypto guys have been liquidated, and now we've got to see this ETH run continue. If the ETH run continues, everybody should be happy because it's exactly what Jose says or Jose says an ETH rally is good for everyone because whether you like it or not, every single asset is priced in ETH. ETH $300 billion market cap anchors all other stock or all other valuations. In other words, when they compare Salana, they say, \"Oh, look, Salana is rel relative to ETH or look at this protocol relative to ETH.\" So, you want ETH to go up to bring the market more risk on. And there's a good chance that if ETH goes up, we go back into traditional market cycles. Now, I haven't shown you this thing for a long time, but it's like first we got a Bitcoin. We've had a massive Bitcoin run. Now, we actually have a ETH run, then we get large caps, then we get small cap alts, and then after that we go into uh we go into um uh a full-blown alt season. And I think here somewhere along the the line we're actually going to an onchain season and we'll actually talk about that. One thing that's already happening now and I wish the show would have come to you 20 minutes ago but here we are now is exactly what what Lucky mentioned in our discord today in the front runners discord and he says here what he's noticed is that first the memes exploded. So, PopCat, uh, then a mudang and peanut. And then once the moves, the memes had exploded, then the big L1s, which I call the meme L1's, like it's the it's the H bars, it's X, it's the XRP, it's the ADAS, then they exploded. And so now what you're looking at is you can actually see here that look at the things that have been exploding. So it was first it was whiff and all the and all them. And now you're starting to see H bar, you're starting to see XRP exploding. So people are moving down moving down that that that risk curve. So just keep watching the the ICPS, the H bars, the Elgorans. You can see that they're all starting to run. Watch those coins because that could mean a shift into risk. If the market is convinced that there's a 90-day risk on period, which will take us to August, which is exactly what we said last week, we think this can go on to August, then I think that you can actually be buying altcoins. And there's a massive move up that you can still get with the altcoins. Right now, some of the calls we've already made and we've already made huge money on some of these calls. So, here's a call that we put into front runners last week. It was Hey Anon, um it was at a price of $512. I know a lot of the front runners actually came and took that. Today, that token is trading at $8. Well done to anyone who got in. For those who didn't get in, get into Front Runners. You're in a bull market. Uh if you don't enjoy it for 30 days, you'll get your money back. Don't worry, just email me. You can get your money back. But get into this because the calls are coming here very very quickly. And actually the list that we made today for the show is already in Front Runners a long time ago. So there's a there's a link below or there is there a link below? Let's look at let's look here. Uh just ask them to put a link to Front Runners before and put a 30-day money back guarantee. Okay, Josh, will you do that? Beautiful. Beautiful. Josh, thank you Josh. I knew you weren't you weren't just here for moral support, Josh. All right, let's talk about a lot of you are feeling sidelined. I know a lot of people are actually feeling sidelined, right? Um, let's talk about feeling sidelined and whether or not you should get in. So, the answer, the pretty simple answer is if market moves happen, typically market moves happen in such a way that you feel sidelined, you feel sidelined, you feel sidelined, the markets go up and they go up and they go up, you start hating yourself more and more and more and more and more and then eventually towards the end you eventually capitulate and you actually fall into the market. I think that there is a a smarter way to actually get into the market or or or or yeah I think if you understand the market cycle there might be a very smart way to get into the market. The first thing is look at tokens that have very good fundamentals so that if you call this market cycle wrong doesn't matter because you know that those tokens are going to survive multi cycles. So if we go down again you're happy to hold those tokens for a long period of time. The second thing is I think that there's a whole cohort of tokens that have really strong fundamentals, but the market just hasn't got to them yet. And eventually the market will get to them and there'll be a catch-up. At the same time, those these are all tokens with very, very good fundamentals that maybe the market just hasn't got to yet. And that's what really what I want to talk about today. Yes, I could tell you to get into Salana. Yes, I could tell you to get into Radium. Yes, I could tell you to get into all these other ones. But we've already spoken about that. I want to show you six or seven or eight tokens that I think have really strong fundamentals and I just don't think that the market has started to price these in. I haven't gone for meme coins. I haven't gone for high risk coins. I've gone for coins that are going to give me the highest risk return. And I think that if the market run continues, they start running within the next within the next before the next month. And so I asked my reachers, I said, \"Ask researchers.\" I said, \"Researchers, guys, give me a list of eight or nine tokens that you believe are going to run in the next 30 days and that haven't yet started to run.\" And that's the tokens that I actually want to talk to you about today. I'm going to give you about eight of those tokens. Um, and again, they're all very, very, very strong with fundamentals. So, let's quickly go through them. Let me know in the chat if that sounds good to you because I put I put a lot of work into this. All right, let's go. Why'd you tell me I had like a rogue hair on my eyebrow? Bro, you said you have fours like support. At least support. You know, when James used to be used to see like a rogue hair in my head, he'd like come here with a with a gel and he'd glue it for me. You should do that, bro. All right, let's go. Let's talk about the eight coin. So, here's the spreadsheet. The first token that I think you need to be looking at which hasn't yet started running is actually Ronin. Okay, so Ronin is the Axi Infinity developers built this chain and the chain is called Ronin. Now it's one of the most it's a gaming ecosystem. It's one of the most robust and most used gaming ecosystems in the world. Now, the reason why I'm so bullish this thing is because I used to watch Ronin trading against Super. And what I realized was that Super was actually way more reflective reflexive than Ronin, right? And so, if you look at Super, Super went down to 38 cents and is back up at 90. Right? If you look at Ronin, Ronin actually also went down to about 46 cents and you can see that it's only recovered to about 71 cents. This chain has a lot of good fundamentals. So, if you look at the fundamentals here, you can see that when when the numbers spike up, they actually have a hell of a lot of accounts on the chain. Um, there's over 139 project teams actually building here. And when the market actually runs, as you can see here, this one actually always outperforms super. So, super if I use super as the benchmark in the in the gaming protocol, this one actually always goes higher. So in June, July, this thing, sorry, in November last year, this thing started at 40 and it went to $460, right? And if you look at what Super did at the same time, let me go back here. Also went okay, went a bit lower, but didn't get anywhere near the amount of growth. So to me, Ronin is one that hasn't yet started running. If you look at where where it started, the low for Ronin was about the lowest close was about 50 cents, but it was about 45 cents and now it's only at 71 cents. And you can just see from a straight charting point of view, this chart hasn't started to move up yet. So my first one is Ronin. My second one is um also in the gaming in the gaming universe and it's Godzilla. And the reason why I'm saying Godzilla is one to look at. This game launched and as you can see only 6% of the tokens are in circulation today. Only 6% of the tokens in circulation. Typically when tokens only have 6% of their tokens in circulation it makes the price very easy to manipulate by the market makers. Right now here you have the launch of off the grid which was like one of the most anticipated game launches and token launches in the market. Ever since the tokens come come onto the market, it's just gone down from um from a from a a market cap of over a billion dollars all the way down to a fully diluted market cap of $420 million. It started to bounce and it's only back at $630 billion. I think that in the next couple of weeks and months, these guys are going to give when they see the market conditions getting better, they're going to use this only 6% circulating to their advantage, which is probably why they only started this the 6% with 6% cuz they wanted to manipulate the price. And I think they're going to do it and they're going to get in inverted commas what what uh they think the market believes that they deserve. Right? So that's that is the that is the reason why I would pick uh Godzilla and I think that that this is the key gaming token. This is like the benchmark for gaming tokens. Let's look at the third one that's actually hasn't run yet and I think definitely deserves a run. Telegram. So if you look at Telegram, you look at Ton. Ton is one you you've got to say that Ton is one of the the best tokens in the e or the the the best uh big tokens in the ecosystem. Now, at the top of the cycle, they were at about $830, and then the founder was uh was put into uh French jail. He's now out of France, and I think he's back in Dubai. And um and what you can see is that the token has started to recover. But the but if you look at where the token's come from, from a close of 265, the token's only at $354. I kind of think that at some point, this one's going to have a catch-up trade. And I also think that this is one of the good tokens to hold in the cycle. I agree with Jason Yanovitz who says um uh uh I'm sure most disagree, but I think the two most interesting ecosystems might be Worldcoin and Telegram. And I think he's right because Worldcoin gets embedded into society as AI takes over. And I'm only realizing now when we're delving into making AI content, how easy it is to make a fake run. And unless you have proof of my my retina or whatever it is, um I I guess that that um you'll never know that that it's actually real run. And I think Telegram becomes the widest distribution consumer app which has actually adopted crypto in an amazing way. So I think Ton is another one that you may still be early to. All right, let's carry on. Let's move on to some of the some of the other ones uh because I want to get through all seven or eight or whatever I promise you that I'm going to bring you today. Next one is save. So this is a chain which has quietly been building quietly been accumulating users quietly been accumulating TVL and the only thing that it hasn't quietly been doing is increasing in price. Now you can see that at the top of this cycle this has been at $114. It's only at 26. But if you look at the fundamentals and you look at the metrics the TVL is up 73.7%. Gaming transactions up 80%. Daily active address is up 78%. This chain is actually moving and I think one soon there's going to be a catchup pump also at some point Monad is going to launch and when monad launches there's going to be a whole talk about paral paralism and parallelized EVM transactions and that's where I think say will come into its own. So keep an eye out for say because I think this is another one of those big lagging tokens. All right, let me give you another few that I think are lagging. So, next one is Grass. This is one of my favorites. So, out of all of these tokens, really, I think Grass is one of my favorites. Why? Look at this. Look at this chart over here. This is the grass chart over here. Let me just quickly get a few. Okay. So, that's a messy messy chart. Why is it doing that? Let's Let's find some Let's find a better chart than that. Okay. So, that is the grass chart over here. The high of this thing has been in this cycle uh about $3 about there $3 $340 somewhere around there. Okay, I see it. It is it is it is moving. So, it's now trading at $163. This is one of the best real businesses in crypto. So, what does Grass actually do? Grass gives you a Google plug-in that you can plug into your Google and then you use your internet bandwidth to scrape the internet. Okay. Okay, now you may ask what do you need to scrape the internet for? Because AI models need data and the only way to get that data is to scrape the internet. Why do they need to distribute the scraping of the internet? Because most sites to stop DOS attacks have limit that limit you to the amount of data that you can scrape, right? And so what Grass does is it distributes that and allows everyone to scrape and to earn um and to earn uh and to earn money by actually doing that. It's a real um uh business in crypto and it looks like they're going to have $50 million plus in revenue uh as a crypto business to me when people when this when an AI run happens and an AI run will happen and that's why I took this a non-trade and that's why I told you guys that you should get into front runners because there's a lot of trades that are actually happening specifically now when the market goes up and Josh have they added in that link already? Let's see if they added in the link. They said they have. Let's see. And Josh, have they added in that? Let's have a look here. Bang. Uh, yes. Front runners. Okay, there we go. Okay, so then the next one that I think is worth looking at. So, Grass is by far on this list, by far, by far, by far, for me, the best risk return beter is Grass. Next one is Babylon Chain. Why do I love Babylon so much? There was a lot of hype around this chain. This is a chain that allows you to stake your Bitcoin and to secure other chains. Now, when I look at the Babylon chain launch, the Babylon chain launch was it was a disappointing launch. You can see it started at at a fully dilute at a fully diluted number of of.16 and then it dropped all the way to like 7, which is where where it is now. It's back at Okay, it's starting to move today. I was hoping to do the show a bit earlier. Now, it's back at 0.11. This is one of those tokens that I think maybe just yeah I mean if you're trading for short-term maybe just wait a bit if you're trading for longterm you can still buy this thing. I think this is another one that's going to have a massive run. And if you look at the number of tokens in circulation only 20% of the tokens are in circulation. So that's another one. All right. There's two more that I'm going to give you. The first one is Athena. I'm sure it's Athena. Okay. I love Athena in bull markets. And the reason why I love Athena in bull markets is because in bull markets, Athena has turbo boost because people realize that by holding Athena USD, you're actually earning lots of yield. The reason is they get their yield from market frothiness. So if you think the market's going to run, the yields on Athena USD are going to run to mirror these yields over here. And then people will start paying more attention to Athena. And so this is the list. The list is Ronan, Gzilla, Telegram, Say Grass, Babylon Chain, Athena, and the last one that I still think has got legs is Sonic. The reason why I think Sonic's going to run is because I don't think it's had a proper run yet. uh if you look at Sonic um and I think that very soon Andre Krener will launch one of his his applications that he's been working on and then we can see a real run out out of the Sonic chain which we haven't yet had because Sonic Sonic launched into a bad market conditions with all of these tokens. I'm happy to hold these tokens if I didn't call it right this time. I'm happy to hold these tokens for another three or six months. These are not tokens that I absolutely want to get out of, right? They're not meme coins or or whatever else. Michael Lombardi said the stream is not responsible. Not responsible for what? Okay. Um I did post this on my Twitter. Now this is for the dirty DJ. So, if you're a onchain, a dirty DGEN onchain trader, if you're like one of those really dirty DG onchain traders, the same people that told me that Melania was about to launch and Melania and I preempted the Melania launch are telling me that there's a true social meme coin that could be launching in the next 72 hours. I don't know if it's true or not true. I don't have the contract address. I'm saying that if you are a a dirty, disgusting onchain trader and you want to catch this, then just keep an eye out for true social memecoin, right? If you want to be able to trade that memecoin really, really, really fast, remember with this, it's all about getting the contract address, my suggestion is go to the accelerate. What the accelerate allows you to do, and we'll leave a a decelerate tutorial in in the thing here, so you can actually see how to do it. What decelerate allows you to do is to copy trade Telegram channels. And I think that the call will come out of Telegram channels. And so you need to go and search the Telegram channels. It's all in the tutorial. But sign up to the accelerate. There is a link over here. Don't sign up with any other link because there are a lot of fake links here and then people can drain your wallet cuz here you are actually connecting your wallet. Use this over here. Set your bot with this with accelerate. What you can do is you can actually I'll let me just see if I can quickly set up a bot for you. So you can set your entire trade parameter. Uh who who calls it? You can set you can so let's say you can set who calls it. You can set the entire parameter in terms of when to take the stop loss, how much to put in, etc., etc. Go and set up the trade because this thing may actually come out. And this is again, this only for the real dirty dirty DJ traders. Go and sign up with the accelerate and be and be able to catch this as soon as it happens. All right, let's take one more look at the markets. Let's take a look at the newsroom and just see before we go because it's been one of those like long shows, which which I love. I love these long shows. Um, Trump says, \"We achieved a total reset with China, potentially signaling intention to sell.\" Let's just see a Galaxy Digital. Oh, so Galaxy Digital is saying Trump because today is the last day to hold the tokens for the for the dinner with Trump. Uh, anything else happening in the in the in the chat here? Not much happening. Okay, let's just quickly look one more last look at markets. I see Salena's back over 180. Go baby. Go baby, go baby. E going to close over 26. Salina back over 180 I think. Amazing. This is amazing. Let's just look at the old coins and see if there's anything else that's that's actually running. I think top 100 we've looked at. Look at that. Toshi up 40%. Popcat. Pop. Oh, I just popped Popcat. I see Rune is coming back. Rune was over two bucks at one point which is very very very encouraging because I mean for the holders there you doubled your money. You doubled your money. Um bro, have you been watching Murad's channel? The guy's gone on to Tik Tok and he tells you like how bad the world is and he always says meme coins are the answer. Have you seen this [ __ ] I got to show you this. I have to show you this. I think honestly I think Mur has lost his mind now. I mean good I think he had a good thesis on on thing but he started this thing now about how like the whole world is bad and like um I'm not kidding you when I say this. It literally taught me how to believe again. No, it's not that. It's not that. I got to find this thing for you. Yeah. Listen to this, bro. Lonely. When is the last time you made a new friend? Yeah, I thought so. Smartphones, social media, cheap dopamine, and video games have sucked the energy away from community, family, belonging, and meaning. Community is something that people need. People want to belong. Here is the million-doll truth that no one talks about. the biggest communities of the future will be online and tokenized. people think of crypto coins. See, like he tells you about how bad the world is and then he always tells you look memecoins are the the solution, bro. It's the I'm He does it a lot, bro. Like you like listen why why college is totally useless and why meme coins are the answer. Watch this. Now that AI is here, they are totally useless. For most people, going to college is a complete waste of time and money. The only way for you to make it is to take unconventional, crazy, and risky actions. In the next 5 years, all of the money will be made in AI and crypto. And if you're not an engineer, you're better off focusing on crypto. The biggest secret in crypto is to find the most passionate, diamondhanded, and active communities. You see what I'm saying? You see what I'm saying? Like basically, the whole world is [ __ ] Your future's gone. But meme coins will save you. I'm telling you, I was watching this. I was like, whoa, bro. Anyway, listen guys, I'll see you guys again tomorrow. Hopefully, it's another green day and we can do what we do best, which is basically DGEN. Otherwise, the list for the spreadsheet will be available below. Also, the front runners have already got it. I'll see you guys again tomorrow. Until then, train well, my friends."
}