{
    "channel": "KyleChasseCrypto",
    "date": "2025_05_13",
    "transcript": " What if we've been thinking about crypto adoption all wrong? Not through the next airdrop, not the new flashy L2, and definitely not another crypto casino coin dressed up as innovation. What if the real breakthrough starts with something so ordinary you'd never think twice? A phone bill, a remittance, a baking fee you didn't even know you were paying. Now quietly being replaced in the background by crypto infrastructure working invisibly, settling transactions faster, cheaper, and more efficiently than any legacy system ever could. No wallets, no speculation, just better systems doing exactly what blockchain is supposed to do. That's the shift that Santiago Santos is trying to prove. And if he's right, it changes everything. You might know him from early DeFi, JP Morgan, Paraffy Capital, but long before any of that. He was just a kid in Mexico watching his family get taxed 9% just to send money home. And I hate that. It's just that if I were to define my life goal is to kill Western Union. And then you stumble upon Bitcoin and you say, \"Wait a minute.\" That moment didn't lead him toward hype. It led him toward a mission. And today he's putting that mission to work. Not by launching tokens or chasing after trends, but by rebuilding realworld businesses using blockchain infrastructure under the hood. No headlines, no tokconomics, just cost savings, margin expansion, and a user experience that actually gets better. Because to Santiago, crypto's greatest strength isn't what it looks like, it's what it replaces. And when we asked him what crypto's chat GPT moment might be, and so to your point, like what is a chat GPT moment of this industry? It's called stable coins. This conversation maps out a new kind of crypto adoption, one that doesn't require users to understand the technology just to benefit from it. But there's very concrete about buying a mobile carrier and cutting 50% of the cost. AI is not going to do that. And if this strategy works, and that's how you bring a billion users on chain. This isn't a pitch. It's a wakeup call that crypto's next era won't be one with memes and liquidity mining, but with better products built on rails that nobody sees. If you care about what's coming, this conversation might just flip your entire thesis. I highly suggest you watch this until the end. And without further ado, ladies and gentlemen, let's get into this interview I did with Santiago. So for those who don't know you uh just like who is Santiago? What have you been doing and uh what are you currently doing in the space? Yeah, well uh thanks for thanks for having me. It's really nice to be in this van. Uh so hot so hot outside. Uh if I get kidnapped, you know, folks, please I'm in Dubai in the the conference. I'm kidding. But um yeah, so I've been investing in crypto since 2012. Uh and I was at JP Morgan at the time in the investment bank. So I come from traditional finance uh first doing investment banking then doing private equity. How did you find out about it in 2012? Oh I was uh you know one of those late nights uh waiting for like a IPO perspectus to print and flipping pages and I stumbled upon the R bit Bitcoin forum on Reddit. Wow. And I studied game theory. So it's a facet of economics and so from a and I found that to be fascinating because um at the end of the day you know Bitcoin is interesting. think it's an interesting proof point, but people sort of if you peel it all back, which has why I think crypto is actually more important than AI, is because it allows us to coordinate better. You know, when you when you learn about game theory, it's just a funky kind of term that econ like economists use to say there's always friction when you want to coordinate. Say where where should we meet for this podcast? Yeah. You know, you have to use certain piece of technology to say or send a location. You know, 2000 300 years ago, that was incredibly difficult. It took us days to send you know paper notes, pigeons, pigeons and then telegraphs and then uh you know the telephone and then smartphones and that has compressed the time to basically coordinate faster and that has an immense amount of productivity for anything that you're doing. We're a social species. We want to do this. We want to interact and and that's what crypto allows you to do because there's the coordination problem people talk about as a pzantium general problem. Yeah. And by and large like when I first read that white paper I said okay you're you're solving this very well-known problem in academia that's a coordination problem which is you know everyone has their own different incentives and everyone wants to operate in their best interest and in comes along a white paper um where back then you actually do read the white paper and uh it comes along and says we've actually solved a very important problem in academia which is we can coordinate better without this suboptimal payoffs and I read that I'm like, \"Wow, this is fascinating.\" And then I overlaid that I grew up in Mexico and you know, when people move money from the US to Mexico, it's the second largest source of income for Mexican families. If you're going to use Western Union, you get charged 9%. And it's hidden, right? Because people walk into the it's a convenient service and they'll say, \"Hey, we'll charge you 3 4%.\" Fine. Uh but then they'll charge you more on the FX conversion rate if you're swapping dollars to pesos all in. And if you're sending $100, your relative back home gets 90. And I hate that. It's just a if I were to define my life goal is to kill Western Union. And then you stumble upon Bitcoin and you say, \"Wait a minute. I bought a bunch of Bitcoin. Took me a while to go to the Soho Center in New York. It felt like a very sketchy trade. Like it was the infrastructure was not very much there.\" And I bought a bunch of Bitcoin, send it to people back home. And and I said, \"If this works, you can totally disrupt the money, the movement of money.\" Yeah. internationally. So, long story short, I mean, just to cut it short, I I then was a partner of Parfy. We're investing in decentralized finance, but you know, throughout my career in crypto and just generally, it's sort of predicated on this idea that crypto is a very powerful technology because it allows us to coordinate better. um the financial system hasn't really been modernized uh because it was built before pre- internet and and and so I think we're at a time which is really exciting now where we can start using crypto technology to make it very relatable for people and what I'm doing now at inversion is obsessing about like why don't we have more users on chain yes like if because you know you come to these conferences and people are talking about all the different benefits and it's all ideology and I just got tired of it I don't want to tell people about I want to show them how this is so powerful in the same way that the email was so powerful to tell people the internet's actually really cool piece of technology that's you know not just uploading pictures of cats um and I think we're at a really interesting point in the industry where we built so much really good tech and and I'm I would characterize this as crypto enabled which is in like the best technology is invisible yes and I think crypto will be invisible for people we shouldn't expect that people are going to have knowledge and understanding think of key management and setting up wallets. What I want to do is buy a business, make it vastly more efficient by adopting crypto rails where the user never sees it, but they'll definitely feel the impact. Yeah. You know, they'll stop paying the fees that we talked about. They'll get their money faster. They might be able to get credit faster, better, cheaper. Right. I mean, so I call this often, you know, the kind of the chat GPT moment for for crypto because, you know, I think AI was around for about 35 years, something 30, 40 years before chatbt came out. So really it was largely unusable for most retail people, most consumers until chatbt, that killer app came along. uh do you think that the kind of chat moment will come from something like you're describing where the you know a big existing business with millions and millions of customers are already using it and then their service gets better exper user experience increases because uh the business has modified its its ways into uh into um you know using crypto rails and infrastructure totally look imagine I buy a mobile carrier in Mexico or Latin America you live with a customer 24/7 All of a sudden, how's that customer? Did you buy a mobile carrier? I'm in the process of it. Okay. Why mobile? Because you live with a customer 24/7. Yeah. And there's no reason why your mobile carrier can't be your bank when money's digital. Exactly. And I mean, it is in Africa usually, right? Totally. And Pesa has really done some interesting stuff. Um and and so to your point like what is a Chad GPT moment of this industry? It's called stable coins. Yeah. Everyone in the world wants access to dollars. Yes. The dollar, ladies and gentlemen, will continue to be the most soughta uh store of value and and gold, but the dollar. And so you just so the question is, okay, if stable coins are so great, why don't we have more adoption? There's a very specific problem that we have as an industry, which is every user comes to this industry by one venue, which is exchanges. And so that's just broken in and of itself because the use case for speculation is quite narrow. Yeah. Certainly a lot of people go to Vegas, Macau, online gambling, but you can't sell someone life insurance or a mobile service or a life savings pol, you know, like an investment product when they walk in at Vegas or the casino. It's just like a broken uh proposition. So you just sort of do it on the reverse like quite literally inverting the playbook and saying if I buy business like a mobile carrier I buy business with 25 million users they all are it's like a captive audience that wants access to this stuff we just turn on the lights okay so so now okay let's say that you um successfully acquire this company with 25 million users uh what do you do at that point how do you bring it on chain how do you make it more efficient and then how do the existing users um both how the existing users feel the benefit from that then how does maybe the the success metrics of the company increased because of the the blockchain integration. Yeah, look I'm not in the business of burning money. I mean at the end of the day this either is a viable business or it's not. Um and it's very concretely so the last four years have thought about okay which business can I buy today that I can make vastly more efficient and that means cutting costs because I think when you you always control costs you can't you know and so when I go in so where can you cut cost for a mobile carrier for instance you can use decentralized infrastructure y um to lower data cost that's 50% of all the cost of a asset like telco they got to go buy gigabytes you know to service you when you want to so so just once But at the time so you would essentially with this company maybe first step is deepen network deep network like helium helium I can lower cost by 40 50 60%. Because you're using last mile coordination of you're basically buying data from a network of hotspots that you're using wireless Wi-Fi versus a cellular tower. One's really expensive the other one's not. And what Helium's been able to do in the US is really interesting. coordinating all these different players to hook up this hotspot to their lo to their home wireless and then provision some of that excess capacity to this network and and that's a very cheap piece of infrastructure relative to a cellular tower. So that's like really interesting from a cost perspective. I can lower cost for this mobile carrier using decentralized infrastructure in a very meaningful way. So that's step one and I guess I guess maybe 50% of that cost gets passed on to the customer, 50% goes to Yeah. or you increase revenue. Totally. Well, uh maybe not so much revenue. The the revenue piece I think comes later which is you become their bank. Okay. Why? Because in the same app where they're constantly topping up data and buying the plan um you rearchitect that so that that becomes a wallet and that very quickly becomes their way to receive remittances to you know save. And mind you people in Mexico and Latin America can't hold dollars in a bank account. And so imagine the consumer walks in says oh I'm gonna there's no disruption of the mobile service right because you know that's sort of like step one you cannot disrupt people want to watch the football game you want to render that and there's no disruption but more importantly once once you know you're you're living with them 24/7 they go to the same convenience store where the hotspot is located and they're buying data and they're buying other stuff that's a cash on rent to stable coins and then you become their bank. Yeah. And so mobile is not really a good business. Of course, you can cut costs. The real business is becoming their bank. And how does that business make money? Well, you have interest income because you have all these deposits coming in. You have an interest income. Um you can launch your own stable coin if you wanted to. Um and you have you can extend credit to people that don't have credit. Basically that you become either Tether or New Bank or both. These are, you know, multiple billion dollar companies. What does the consumer see? The consumer initially does not see any of the crypto piece that happens in the back end like the rearchitecting with deepen. They don't ever see that. There's no disruption of the service which is so powerful. Yeah. But they definitely will see the ability to do one thing which they've never been able to do which is hold dollars in a bank account. And you don't again you don't call it a stable coin. You don't call it a you know a self-custody man like none of that. You call it a basically this is a US denominated savings account that earns you some yield. Everyone, I think in Latin America and in the rest of the world understands that product. It doesn't even have to necessarily earn them yield because they're already going to get the benefit of being able to transact with each other at far less cost. Totally. Yeah. You know, and remittance and all these and and the remittance flow. Yeah. So, so that's how you turn an asset like mo these mobile carriers are not great businesses. They have 10 less than 10% EBIT margin operating margin. uh by lowering costs in this capacity you turn margin uh you know you double margins if you do it well okay and so imagine the outcome so let's fast forward in a year from now where I've done this playbook what happens uh the biggest problem we have as an industry today is that everyone says this is just a casino it's only for memecoins it's only for speculation and I think this is why I'm doing it because the outcome of this is all the telco analysts at JP Morgan or the investment banks say, \"Wait a minute. You what have you just done? You bought this mobile carrier and every other comp in our sheet is 10% ebid margin and this is 20. What have you just done? Surely it must have been AI that you kind of like used AI to drive efficiency.\" And you're like, \"No, it was just one thing, which is what we've been telling you all along, which is uh it's crypto rails deep. It's it's a sediment layer of the internet. It's it's you can make businesses faster, better, and cheaper.\" Um, and that's what's so powerful because unless we do that, we're constantly going to be discounted as an industry. Yeah, we totally are. There was a talk at the digital asset summit from Melt Demar that made me a little bit pissed off, a little upset. Like it was just she, you know, and she wasn't necessarily wrong, but I thought it was phrased in a way that was a bit wrong. I don't know if you saw it, but she just said, \"Look, we've been here for 15 years. We haven't built [ __ ] There's been, you know, hundreds and hundreds and hundreds of billions of dollars that come into the industry, and we have nothing to show for it.\" I think that's not true. Absolutely not. because we had to get to a stage like you said infrastructure should always be invisible to the end user. I mean, we travel over a bridge and we don't have to check the integrity of the bridge before we drive over it, right? We don't have to check our our like, you know, our internet service to make sure that it's working before we use it, but just we just work. It just works. And so infrastructure should always be invisible. It takes us a long time to build things that, you know, we can abstract away that end the end piece from the end user. Uh I'm curious though. So now let's go into this idea from inversion a bit more and the chain the DPIN network the mobile carrier the neo bank the deepin network is that already set up or would you use an existing one or was this would be this be part of the acquisition and part of the strategy? Yeah it's it's very much part of the acquisition um so then you have to get all the physical infrastructure into Mexico and just set that up from scratch too. Well, the interesting thing is Helium is already working with a couple carriers. One carrier in Mexico and they already have an interesting pilot there. Uh, but to give you a sense of perspective, yes, you do have to deploy hotspots. Yeah. You either do it and convince people, normal people to do it. We pretend to do it ourselves day one. Um, so you can imagine you have these partners that have physical distribution. Convenience stores are great example. They have convenience stores everywhere in the country. Yeah. So, we work and we pretend to work with someone like that. We say we'll deploy hotspots in the convenience store. It's a great partner because again, that's the convenience store where people go in and buy data and and top up their mobile plans. Um, and the and just quantify the figure, what what does it cost to deploy a network of hotspots, distributed hotspots across a country like Mexico? Just and my question is, what is the range of one of these hotspots? because I've talked to another I forget the name of the project at the moment, but you know, they're talking about this new uh 5G antenna technology they're using that I think it's about 5 mile range from one hot spot. Is that about sound about right? That's a bit much. But the helium hotspots, there's an indoor and an outdoor, but the range is a bit less than that. Yeah. Nonetheless, to give you a sense of perspective, in the US, Helium has now 90,000 hotspots. When it started offloading, it had 21,000 hotspots. Um, sorry. It has how many now? 20 98,000 now. 90,000. Okay. Um, and that has allowed mobile like they're now working with two out of the three largest carriers in the US to do offloading. This is the the idea of switching from a cellular tower to a wire like a Wi-Fi network is offloading. Everyone does this to save costs. Um, so it roughly takes anywhere from 10 to 12 million in hardware of hotspots to build a network in a place like Mexico, which is a massive country. So you deploy it in the major cities. To give you a sense of perspective, if you buy a billion dollar revenue business that is paying $500 million in data costs and you cut that by half, you're saving $250 million on data alone on a $10 million investment of copex. That's a that when I talk about like the unit economics, because ultimately a lot of times when we think about technology, it's all sounds nice and great, but the the concrete it's like what is the math? Like does it actually make sense? like what is the business case for crypto and I'm I can tell you I've obsessed and look at hundreds of different business models the ROI and something like this is phenomenal when you think about um you know I don't necessarily care what the price of helium is I just care is the network reliable where I can offload so that that doesn't create a disruption in the service and that's always been the issue is like can these um decentralized or distributed network be as reliable in terms of uptime and you know particularly uptime relative to a centralized player like Verizon, AT&T or whatever centralized carrier uh um and and so Helium's done some really interesting stuff to guarantee uh really good uptime and reliability in the network to the point where the when people ask me well this sound no one's really done it sounds like it's very risky I'm like what are you talking about are you paying attention to what's happening in helium in the US Um and and so that's the nature of crypto which is you know a lot of things never change but some things actually do change quite quickly and there's been a lot of progress that I've just observed by being an investor in a lot of these networks that it's like okay the time is very very right to do this playbook like to your point about meltem I would push back a lot there because you know you're old enough to remember that for the internet it was no What pushed the internet so much in terms of video compression and streaming capabilities? It was one industry that pushed the development of that porn. Exactly. Yeah. So, you might have sat there and said, \"Wait a minute. This internet thing is is totally useless. I hate it because it is used for nefarious or things that I don't agree and in a similar manner like meme coins for instance get a lot of um bad press in crypto and you know for a variety of reasons.\" I look at that and I say, \"Wait a minute. You had a president that launch a memecoin. Point number one, sort of crazy timeline. And then he launched it on a Friday night and then the amount of volume that the network of Salana was able to absorb was 20% of all the volume that NASDAQ does in a single day. I mean, you sitting there, you're saying on a Friday and it didn't break. No. Uh, that's impressive. And so and so when I go talk to a network engineer or someone in NASDAQ and I tell them that they're like, \"Huh, how like this is pretty amazing.\" And so again, the the the speculation is a proof point. And as we built some great technology over the last 12 years, four years ago, I couldn't have told you that this could have worked. Why? Because we just didn't have enough proof points on high throughput blockchains. Now, I think we can agree we have uh uh very good proof points. We have excess demand of block space. sorry excess supply of it not enough demand you know we just we're at a point where we can actually credibly absorb a billion users so okay I I want to move on to some other thing market dynamics and things like that but uh on the I just want to wrap up the whole idea of the inversion chain uh the telco company the neo bank this whole ecosystem that you're hypothetically building uh or you are building but um uh so so how does it work from a centralized and decentralized perspective. There's several different value acrruel mechanisms built into that model. Uh there is going to be you know people who are watching this and saying okay like Santiago is building this thing it's cool I'm I want to follow along because maybe I want to try to take upside in something he's doing or other people are watching and say I like this idea I'm going to go do the Birkshshire on chain too. There's plenty of businesses that need to be acquired or whatever. I like this model. uh but there seems to be um some centralized aspects of it to maybe where the like the value of cool goes to maybe an equity side of the company and then there's this chain that you've you told me about before we started rolling um and I'm wondering like is that going to be a decentralized chain where you've got like open validators who take who you know take upside as the chain itself grows and transactions grow uh or is there going to be some aspect too where you build in some decentralization into these into the mobile carrier or the neo bank where uh you token holders or participants can also share an upside. How does all of that work? It's Yeah, it's an excellent question. So, yes, we're launching a chain. So, why do we need to launch a chain? Well, if I'm going to bring all these users, you know, hundreds of millions of users, billion users, um I want to capture that value in two ways. One, at the portfolio company level, so that business becomes more valuable if we were able to cut costs. we're able to grow that into different business lines like mobile plus neo bank. So that creates a lot of value at that kind of company level. Um and then all the activity stable coin swaps on and off ramps and every other activity that the user is doing think of it as the app store right comes to our chain all that activity in terms of fees and me like all that gets captured in the inversion chain. Um that's important because uh ultimately um the idea for the chain came about of two ways. one, we want to create a permanent like a vehicle where we can go buy more and more companies, right? Um, and so you benefit from all of that stream indirectly, right? As we go buy more businesses, well, all of that activity comes to our chain. So, you know, there's roughly 30 to 60 million active users in on chain today. With one acquisition, we can become the largest chain in terms of number of users, active users. And so, I care about like real GDP on the chain. Yes. um and retaining those users and the the lifetime value. Again, the unit economics of that user is far greater and more interesting in our chain. Why? Because we're we're rendering them a core service called mobile and called banking. Um that user doesn't necessarily care if Bitcoin's at 100,000 or 20,000. You're care if coins are hot or not. Exactly. And so they if you look at every other chain um and kudos to all of them I mean it's most of their activity tied to speculation and so and so that's incredibly volatile and probably spending as much money on marketing as you would do to acquire the whole business and with your idea you don't have to be the coolest kid at token 2049 and throw parties and stuff like that because your users aren't there coming from a speculative my I don't my I don't want my users to ever know or hear about inverting like again crypto is very much invisible That's our northstar. The interesting thing about you mentioned Bergkshire Hathaway. I I've learned a lot from that model which is unlike a traditional fund. So I could do this two ways. I could raise a private equity fund and I'll raise outside money and try to become KKR or Blackstone. I need to sell that business after 5 years because I need to return that money to my investors. Mhm. I never want to be in a position I never want to sell these businesses. I want to buy more and more of them like uh you know Bergkshire Hathaway has done. And so you want to be patient long-term capital. And how do you do that? Well, just to give you some perspective, you want you the chain itself is deriving all these value from the businesses, right? In terms of settlement and activity, you can imagine that chain have decent amount of treasure. If we do this well, I think we can create a ton of value as a chain that brings this a ton of GDP on chain, a real activity. Uh and then we can use that those resources that treasury to go buy more basically. So you can become and I I won't stop until I become the largest economy digital economy. I'll go buy more mobile carriers and turn them and do the same playbook and then do over and over and over and that's how you bring a billion users on chain and to give you some perspective. So I mean you can imagine the treasuries of all some of these chains are not small. You know Ripple is now kind of doing this. They went and bought that that billion dollar acquisition. Billion three. Suie I think was going to go buy 23 in me. Really? They went out of business or something, right? Well, they did, but it was up for sale because they have a lot of data. So, lot of data. Again, my um if if you are going to have more conversations with like founders or people in these networks like Salana, all the L1's or L2s, ask them, \"What are you doing with your treasury?\" Yeah. Because they the team that the foundation has a decent amount of the tokens. I'm like, \"What are you doing with that currency?\" And I've gone around and done this and it's like, well, it's a bit perplexing because you have the ability to solve crypto's biggest problem, which is onboarding users in a different way that is not through an exchange. I mean, I guess unless you're in the top, you know, unless you're maybe in the top 100, which I I don't see why you wouldn't be if you were if I had that many active wallets and users on chain. Um, but I guess it's I guess one argument would be that it's not easy if you want to acquire a business for a billion dollars to liquidate a billion dollars token without getting flak from community or whatever because you have to be able to sell those, right? To in order to and that's why you don't necessarily have to though. Well, how how could you you could I mean again our the nature of the game is finding the lowest cost of capital to go and running this playbook. So the interesting thing is we've talked about like large private equity funds that have been starting to get interested in crypto. I'm building very much in the open. So, I get a call from a large private equity fund like, \"Oh, we're interested in this crypto thing you talk about like making our business more efficient. How are you gonna do it?\" I'm like, \"Well, let's talk because I don't want, you know, if I could partner with them. They have a huge balance sheet. They want to learn how to do this.\" So, there's like a couple different avenues to go about it. Initially, we we pretend to raise like an SPV, like a specific like kind of like Spack sort of vehicle to go and buy a business, and we're looking at five or six right now in Latin America. we're going to do something in the next 6 months and so now it's a matter of which asset. Um and so we'll have to raise some money for that. But once you do that and you bring that business on chain, you launch the chain and then you're in a very interesting position because if you've done it well, you've proved that you can take a business and transform it with crypto rails. Um and then you have multiple options at your disposal. You can continue to raise an SPV for future acquisitions. You can use the cash flow of that business to go buy other businesses. You can use some of the treasury. You can borrow against it. You can maybe sell some. It all kind of depends on the market and the premium that you're getting or not. Yeah. It's kind of no different than um I mean companies do this all the time. Like Bert Burchcher does this. If you're a, you know, a treasurer at a company or CEO, you're constantly thinking, okay, if you're a public company, you're saying, I have all this stock. How can I best use that? I can reinvest it in the business. I can do acquisitions. I can do dividends. I can distribute it back to shareholders and it's a constant exercise of finding the most productive use for that capital. To give you an example, uh you probably remember this, but uh at the peak of the dot bubble, AOL was valued at, you know, I think it was like 18. It was crazy valuation. They had like very rich valuable stock. What did they go do? You've got mail. They went and bought a real business called Time Warner, which is seven times their size. AOL did AOL bought Time Warner and they call it a merger of equals. And why would you do that is because they were in a position where they realized this is we can't justify our valuation by any stretch of the imagination. So, but we're going to be smart about using our currency that the market thinks is really valuable to go buy a real business and and you know eventually grow into that valuation. And I think of it no different. Look, I I'm going to lay to you straight. As much as I'm an investor in these L1s I or L2s and L2s, we can't justify the valuation of any of them. No, other than Bitcoin, which is you can't really just it's just a commodity. It's based on supply and demand. But if you're going to value an L1 or an L2 based on like a discounted cash flow of fees and me, no matter what crazy wild assumptions you're going to make over those 10-year projections, you really have to believe that we grow out of this current niche of just the casino. Yeah. But of course when prices go up people don't really have this sense of urgency. I very much do because I want to get to the answer like can we take a business and make it more efficient with crypto rails cuz then you actually credibly believe we can onboard all these billion users and then you can start wrapping your head around okay maybe we're not too crazy in how we're valuing these networks of you know Ethereum is a $250 billion asset. Salana is a 80 you know $70 billion asset. You go down the list I mean is it worth 80? Is it worth 10? is that we're zero. Yeah. If we don't bring normal users that at some point people the addressable market for pure speculation is not small but it's definitely not at that valuation. Do you see anybody else in the space doing uh doing it well or or I know you said Ripple's on that kind of on that path a little bit maybe anyone else that you think is kind of getting to a place where we're going to bringing real users on chain. One of the things that I've always said and you probably use this example before too is like decentralized ride sharing application right how great would it be to acquire something like a Kareem or a Grab or something like that and put that on chain. I think so. So, look, I mean, I um I wouldn't be surprised if other chains start doing it. If private equity funds, Apollo, KKR, Vista start doing this playbook. I want them to. I mean, there's no shortage of companies that you can buy and run this playbook. As the consumer starts getting more used to digital money in the same way they start getting used to, you know, the internet and email, the aperture of businesses that you can buy widens. So I don't today I don't want I don't want to buy certain businesses because it's not we're not there yet. Like I wouldn't buy a restaurant chain. I wouldn't buy uh consumerf facing business where I'm going to make an assumption that the user is going to all of a sudden ditches Visa or American Express and use a stable coin. Not today but you know you can imagine a world that in 5 years most most most things that maybe like uh things that are very much able to do peer-to-peer stuff like maybe uh like all these uh food delivery services and things like totally. I've looked at uh public companies that they're paying a lot of suppliers and employees internationally. And what's interesting there is a lot of their cost structure is paying a lot of these fees to move to pay these suppliers. And it's a huge working capital drag because it takes time to move that money. You have, you know, these corridors where you have to tie up capital to do like trade credits and all this stuff. Um, and especially employees if you're paying them through Swift, like that's that's a very high fixed cost every time you're sending them that uh paycheck. Yeah. Well, what if you bought that business and said, \"Wait a minute, all of your employees.\" You send out an email and say, \"Guys, this is the steps to onboard to create your wallet. I'm going to pay you now, maybe in real time, maybe in a week's time, and it's going to be through a stable coin.\" You've just saved that business at least 4%. buy a large business that 4% starts adding up. Yeah. Of course, you don't stop there, right? Uh but but that I like those businesses where again it's it's equally valuable what we know we're very focused on what we want to buy. It's mobile for a variety of reasons. Um makes sense. But um but I've looked at other type of sort of like taking deepend elements swapping particular pieces of infrastructure like think about the income statement of a company. You can imagine like there's some fat layered into every single line item and you comb through every single one and you say, \"Okay, what can I do about this? What can I do about that?\" And you go down that list and I can tell you like there are very specific areas where you can trim that fat. Yeah. So you have said publicly that you think that crypto would be even maybe more disruptive or prominent than AI. That's a pretty bold statement. I mean, I was definitely in that camp before Chachi BT came along and then you just start seeing all like how great this you know the LLMs have become. I I constantly today I'm like raving about the usefulness of 03 totally. Uh but you know I also have always been in the camp you know I'm also since 2012 in Bitcoin and crypto building the space and I've always thought that crypto was by far the most disruptive thing that was going to happen and uh so now I'm a little bit like this when it comes to both but I'm curious to hear your thoughts. Yeah, people might be laughing right now because certainly Chad GBT first they laugh at you. Chat GBT is by far very relatable. Why? Because it doesn't require like it's very ingrained in the it's search, right? We're so used to searching on Google Chat GBT that the work stream the flow is convincing that audience is so intuitive. So what is what happens that chat GPT becomes the fastest growing app ever. So someone might say you're out of your mind if you think crypto is going to be more transformational than AM. And I'll tell you why. Um, for the simple reason that back to the coordination side, like AI will use crypto rails. It will have to use crypto rails. So, so I think of it like crypto is a foundational piece of technology that sits below everything else that AI does. Yes. And crypto comes along and exponentiates what you can do with AI, what you can do with AI agents. Um and and and so it really increases the functionality of what AI can uh can do. Um and so I think over the long term so that's point number one like coordination is vastly more breakthrough in terms of the impact that it has in society. Yeah. So the biggest pieces of technology allowed us to coordinate better as species. uh AI is is is certainly useful there but crypto very much allows us to do things and empowers AI agents to do things in a in a very interesting way. So that's point number one and the other one is you know this better than any in investing what do you want to do? You want to um invest in things or bet on things that the market eventually will wake up to and you hope that the market wakes up to them in a year's time not in 10 years time because being too long term is indistinguishable from being wrong. I've made that mistake before. Yeah. Many times. But again, I do think that we're at this sort of precipice moment where everyone is focused right now on AI. So, you want to go buy or invest in an AI company. They're all the rage. You're paying very expensive, what I think multiples for that type of technology. It's fine. Some of it will come out and be great. But I do think that the the impact that crypto will have on the businesses that we acquire is going to be greater than the efficiencies that I'm going to get with AI. Certainly, you might be able to cut down certain functions, you know, backend stuff, call centers. A lot of those functions in the P&L, like especially like sales and marketing and CRM stuff, you can definitely streamline with AI and we'll do that, but there's very something very concrete about buying a mobile carrier and cutting 50% of the cost. AI is not going to do that. And and so the the the simple answer is in certain businesses, not all of them, the impact that crypto uh technology by transforming that business into a crypto enabled one is going to be greater than the impact um that AI has. Like the ROI, the the amount of cost that you're able to save, particularly in a business like mobile, is I think higher with crypto than it will be with AI. Let me ask you about this. Uh because uh so for example uh before Elon acquired Twitter, I think that there was a a lot of consensus that um especially those who are in crypto that we would need some sort of decentralized social media platform for freedom of speech and protecting you know Yeah. mostly for protecting freedom of speech and also anti-banning and censorship resistance and immutability and stuff like that. Mhm. And then Elon comes along and fixes it and gets protected by the first amendment and the feeling of the necessity for a decentralized social network decreased in my opinion 98% or something like that. Like I just don't see necessarily the need at the moment. Um, so now when it comes back to AI, I think for retail users, non non-invest, not not non big builders, whatever, for the majority of the population has been using these LLMs or whatever for to improve their daily life, to improve their business, whatever. Uh, in order for that AI assistant to be the most efficient assistant possible, it must know everything about you, more than you do about yourself and your deepest, darkest secrets and that your IP and everything like that. Right now, Chat GPT knows way too much about me. Uh, I haven't told anything deep dark secrets quite yet, but like if I need the ultimate advice, I might have to, you know. Uh, and I think that that is a bit concerning for a lot of people, especially as we get deeper into the conversations with these with these assistants. Um, and I think that, you know, that there's this idea that having some sort of decentralization or open network where we know that that these centralized companies aren't taking all of our data, extracting it, using it, manipulating it against us. Um, you know, so do do you feel like there is going to be a public awareness? Maybe it's a leak that comes from ChachiBT. Maybe we find out they're using it for election bias or whatever that comes. Like do do you think that uh that there will be a need for privacy and decentralized AI assistance and models? Definitely. Um so there's a there's a couple of things. One, technology is incredibly a centralizing force. If you look at the m the vast amount of value that's been created in the internet, it's kind of very concentrated in the user aggregators. Tik Tok, Facebook, Google, uh like technology is very centralizing. It's it's it's very much a technology that there's like very few people that concentrate a lot of power. Mhm. Because they create a beautiful product. It's like sort of byproduct of like just created great service like Facebook. You have billions of users. You have all this data on them. the user. In my all my time in crypto, I've sort of come to the um sobering realization that users will not care about decentralization. They care about being rendered a service that is faster, better, and cheaper. Yeah. But I do think crypto, particularly in AI, offers us the probably the only hope to break away from the natural gravitational centralization force of of of technology, especially the AI. Yeah, like AI, you basically have like the US-based AI models like and you know like perplexity and chat GPT and you have DeepSeek in China. So in a world where everyone's using these foundational models, I mean those all very you can I mean it's it's quite concerning in many ways. It is. Yeah. Uh like Google Gemini for instance, I was thinking about this the other day. It's like when Google launched its own AI like Gemini, you would have like prompted it like what's the optimal diet and it was a very opinionated LLM that wouldn't have told you to eat red meat. You're a Bitcoiner. I think you like red meat, don't you? Isn't that the overlap between Bitcoiners and red meat? I think so. Tone Tone Base is probably there for sure. But you know what I mean? Like the more like the omnivore of the the healthy gut, you know. Yes. Exactly. But so the the the the point there is um if you're a user unsuspecting user that is going to prompt this ALM what the optimal diet is because you're relying it for everything. You don't know what data set that model's been trained on the weights of that model. Uh the and and so the the beautiful thing about crypto is so how do we push back on that? How do we create these LM where you have some sort of verification that the data is not being leaked like 23 and me leaked all the data. Yeah. bad services. Uh so so crypto again is to your point around AI is a 20 years of foundational research. crypto when you go talk to people in AI it's like you can actually use some of the elements of crypto privacy zero knowledge proofs um verification aspects to if you're a big AI if you're a big company and you're deciding which model you're going to work with I think now you have this possibility where you say wait a minute I want to work with a crypto enabled AI model or service because I want verification on the LM I actually do want guarantees that that model is behaving the way that I want that I have some transparency into how the model is being trained the different weights um and it's not an ideology point it's more of a business case so I do think there's going to be an interesting pos area to um justify or make again make it interesting for businesses to realize that um crypto fits very importantly in if you're going to use AI um then I think you want a service that gives you more power to you to say, \"Hey, maybe if I'm going to ever get comfortable prompting data or sharing sensitive business data to the model, I can I have these guarantees.\" And again, what does crypto do? Crypto delivers those guarantees. So, is is that going to mean that Chad GPT uses crypto? I I don't know. Probably not. Probably not. But but definitely AI agents will. Yeah. really fascinating everything we've talked about especially from you know how do we get adoption on chain finally what I really want to know uh after everything we've talked about today for the for the audience specifically is like there's a lot of interesting information but like as speculators out there people who are looking to kind of you know get ahead in their financial future the things that we've talked about or just even something we have talked about where should they be looking right now at you know placing bets how could they maybe do a bit of research to find out you know how to get into a narrative maybe before it becomes popular. Yeah, look, it's um for me it's been I like to invest in things that I'm using is I'm just m for instance when we were investing uh in decentralized finance before it was decentralized finance I was using Maker. Yeah. And I was like sitting there and saying okay ETH the value of the collateral backing the stable coin die went from the peak in the ICO boom to like 80 bucks and you're like and and the value of of the stable coin remained the same. it was delivering a lot of value to ETH heads that didn't want to sell their ETH but had to pay real you know expenses and so I was like this is like a really fascinating thing and then you then start saying okay what else can work yes I don't pretend to give any advice ultimately you you're never going to catch them all like when you start investing in crypto was one thing it was Bitcoin maybe colored coins and then made safes and but it was it was easy to kind of track one thing um develop a focus and an edge and by the way the things that so beautiful about crypto is it's open source and it's everything's on chain from and the access that you can get to teams is phenomenal like imagine like in what other industry can you go talk to this the the the founding team the CEO you can literally join a discord group that's free ladies and gentlemen you can go in there you can start asking questions I I can't tell you how many times I've seen community members get hired and join the team and also build real wealth because they were there they were using the projects and then maybe then they started building on top of the project and so that's like that's the power of this entire movement is open source smart people want to work with smart people there's a lot of really smart people in crypto and the door like we've all in this journey I've had immense amount of help from a bunch of people because they've been generous with their time and they've I've asked questions that are really dumb and I still do but they take their time and that's really powerful like if you're not taking advantage of that I mean I can't tell if that's the only way you build edge. I I think so on what you said, it's something that I've been thinking about quite a bit lately. You know, I advise quite a bit of projects on their go to market and sometimes it's rare these days. Sometimes you come across founders that say, \"Hey, we actually have to have the token like it's it's imperative to to operate with it only.\" Okay, in that situation, then do your TG, launch your product. Hopefully you get some, you know, you get the traction. But if if a project can launch their product before launching a token, uh it seems to me like maybe that might be the better path to market for a couple reasons. One is like people can go try out the product and see if it's useful, if they like it, uh and before they might want to get involved in that ecosystem. Um which is always a good sign, like you said, like your your maker example. Uh two, I think that it enables an interesting user acquisition strategy by offering a point system for people who are actually adding value and really not airdrop farmers and these kind of extractors but you know if you can build a point system where you can actually track real usage and real value to the network then I think that's quite interesting. Uh, and then three, if you have some sort of public offering, then maybe your real users today are going to want to participate and be more optimistic on the long term and not want to dump those tokens the second they can because they know that this is a valuable product. Yeah, 100%. I mean, I think we're moving away from let's airdrop a bunch of tokens to people. The retention is not there. Zero. Look, I'm all for making your shareholders, employees, and users have skin in the game. Mhm. In a perfect world, if you're using Uber, if you're using YouTube, if you're using these services, I think you should be compensate in that upside. If you're generating like user generated content is what builds value for marketplace like or a platform like Tik Tok, you should kind of get more share of that. Yeah, that's going to change. So, I'm I'm all for that. I do think that as an industry we are in stuck like in a you know in a in a rock and a hard place because there's all this precedent where the community says when token and it says you're not giving me enough tokens and it it's all like and so we've been in this dynamic where we haven't we've sort of like pushed away product market fit and just saying I'm gonna launch a token make all these hope to make the community rich and then somehow you know convince people that this is a good product. K to speculate on it or push I come at it with your point around take your time understand who your user is find product market fit I don't care if you have 10 loyal users maniacally like loving your product paying users is better than like 20,000 in a Discord group or your Twitter following that don't care about what you're building so again no amount of financial engineering is going to fix for a broken product and I think unis Swap is a perfect example of this. Like they didn't have a token. It's still the best one of the best projects in crypto out there. They've built foundational platform. Sushi comes along, tries to do a vampire attack, got some liquidity, but then at the end of the day over the long term, Uniswap has had a better team that constantly has been shipping new updates and of course they launched the token, but I think they launched a token at at a right time. My question is if you're a builder right now, c can you get away with that? I think the meta is very much you launch a token reasonably early on unlike like in in the in the real world. Yeah. Companies take 10 20 years to go public. Yes. It's sort of like whatever comes fast as you get to 100 million of recurring revenue or a billion dollars in revenue go public. Um but in crypto it's we sort of like have sidestepped that. Yeah. Tokens are phenomenal for coordination. Can be uh can be really good for customer acquisition. can be I mean at the end of the day like it the token is very powerful mechanism you I am of the mind that unlike the the camp that says blockchain not crypto I'm like you fundamentally just don't understand absolutely that what makes this unlike a traditional database and open- source project crypto is open source but the token serves as that ability to map out contributions yes uh in a token and so there is a place and a need for a token And I will tell you if you talk to most of the founders once you launch that token your life becomes vastly more complicated and difficult as as a founder and so um the other thing is you we've been also in this dynamic where it's been a pretty difficult regulatory environment and so I think a lot of the rationale for launching a token but very quickly giving it away to the community has been to optically say we're decentralized we've given weight 20% of the supply. It's distributed across all these different people. We're not a centralized project. And I'm actually optimistic where we have good like why is it okay that the word security is sort of like uh taboo in the industry? People run away from it. We're scared of it. What's wrong with security? Yeah. And I think with regulatory clarity and guidance, I think I'm hopeful and mindful that that we can actually call these businesses for what they are, which is unis swap is a vastly more efficient uh exchange than Coinbase. It has 100th of the workforce. It is global day one. It's tapping into global pools of liquidity. Uh pound-for-pound is a fantastic business model. Now, does that mean the value is going to acrue to the equity of unis swap or the token? And we've been in this sort of weird um lingo where we haven't been able to just it's a it's a governance token. That's the hard part because it's it's a hard part because of because of this fear of securities and if I actually had a call with SEC 2 days ago. Can you imagine that? Like it was a it was terrifying and and exciting at the same time. It was a it was a pro call to talk about innovation in the United States and like what we're doing and bringing our our business into the United States and offering to United States citizens like um as a launchpad which is you know crowdfunding and being able to offer maybe securities but that that was one of my points is like there in this space people have raised capital on these tokens that clearly have no real idea of how the value of cool will happen and they're just centralized companies And you get a lot of misinformation or misguided information when their ex account says oh we just partnered with so and so and then you think that now like okay this value acrew is going to come to the token when in reality that revenue is going to the centralized end of the business. Look I think uh I'm actually going to give a talk in 20 minutes with um Evani who's the founder of Wintermute one of the largest market makers and the talk is about FUD and market integrity and what's wrong in crypto. I'm like, there is no problem being a security. So, what what is broken in crypto is that there's sort of like a very disconnected uh ways that projects share information. Exactly. Look, the the SEC's role is to create market integrity and there's one way to do that is everyone needs to have access to the same information and disclosures at the same time. Yeah, Edgar SEC, you want to have there's 10Ks, 8Ks, 13Fs, all these different disclosure mechanism. The beauty about crypto is a lot of this is on chain. You just need to kind of package it in the right way. I my my view of the world is that in a not too distant future, projects can uh go and register in a very easy way. Why? Because a lot of this data is onchain. It's open. It's transparent by nature. most of it you're already kind of doing it if you want to get listed on Binance or some of the large exchanges like they'll require you to furnish all this information when there's communications from the team it's in one methodical way so to to create market integrity which is make sure that everyone in the community stakeholders the team all have and are looking at the same information in real time and then they can make their own opinions about buying or selling a particular token. Um, and that's going to happen. One thing that uh that you touched on earlier is something I I always explain when I say if you're if you're creating a token, you're creating a digital economy and you must think of it like that where everything is uh is as a nation state when run. You're you're creating a digital nation like uh just in the cloud. So you should have governance, you should have taxation, you should have monetary and fiscal policy. Uh you should have incentive mechanisms probably you know you should have some sort of uh nomination and voting and you know governance uh in there. People who are governing and supporting the network or securing the network should be paid to do so. And if you're an early supporter of the ecosystem or the the the virtual country, then as that country's GDP and the value increases of it, then you also get wealthy with that country. Earth class way. Uh and and I think that's I'm I'm very hopeful that we kind of move away from the decentralized as quickly as possible. Let's let's actually focus on the business case, which is like I don't think you should ever decentralize product. Does the community need a pine on on the color of the button on your app? Absolutely not. Um, can they vote on key things about having a board? Maybe as shareholders do. Um, and so I think you're absolutely right. We we need to I'm very hopeful that this is going to happen relatively soon. As Craig, we have four years in this administration. I mean, David Sachs and the president's delivered on pretty much every promise he's made on crypto, which is phenomenal. We again I I believe we have a sense of urgency when we go back to what we're talking about earlier which is um I'm very focused on bringing a how do we bring a billion users on chain to this economy because they're going to receive and be able to capture a lot of value. I believe it whether it's Bitcoin whether it's I don't care which chain they go to. I don't think we should that this loyalty to chains is nons nonsensical. Totally. like you don't care if you're if you're accessing a website and whatever the backend infra is you don't care if they're using AWS or Asia you don't care you I mean you just care about is the website you know is the content good is it is it rendered easily and fast is it secure and so I I think like fundamentally um when I go talk to other projects I mean this is I sort of think of ourselves as we're a step a layer on top which is I want to build a better fund I think I can do that by being by buying real businesses we're at the right time to do this. Yeah. From a uh infrastructure development standpoint, from a um regulatory standpoint. And and so now I think that's what's so exciting. I actually think I'm earlier now in crypto than I was in 2012. Yeah. Cuz I don't know, there's something so powerful as saying like, holy [ __ ] like crypto actually now can fit very squarely into a lot of the problems that we have and and really turn a problem into an opportunity, which is AI, the centralization component of it. the data leaks component of it. Fraud online is only continuing to grow. Hey, initially in the in the early days, people are like, we're going to blow up systems. We're going to blow up Wall Street. We'll do all this stuff. I'm like, go talk to and I have go talk to banks. Go talk to funds. Go talk to real business people. They'll all Before it was all private, now they're more public about it like Larry F of the world. They all appreciate that crypto is a cost cutting technology. Mhm. The only department that keeps growing at banks is back office and compliance. You can cut that in a very meaningful way when you have a distributed ledger technology that is atomically settling yeah a swap or a transfer like there's no ambiguity around that and the regulator loves it because you can be more compliant. It's settled in real time. There's no counterparty risk. It's transparent. Uh so I I think like I'm I'm very happy to see more of these people that have been doing a lot of the leg work over the last couple years to understand this technology like entire teams at JP Morgan has like hundreds of people working on crypto. Uh every major bank, every major large institution is thinking about this. You see it very visibly in a place like you know the Emirates, right? Um, and I think like in many ways it's like we're going to probably see that in terms of adoption and we're in a funky state of a market where I think people outside of crypto not crypton natives are more excited about what's going on in crypto than crypton natives because you know price refresh is not going up. Yeah. But I I I do feel it and and and I don't want to come out and the saying this time is different, but in all of my conversations with as I've gone in this journey of understanding which business I want to buy, how do I do it, who do I partner with, I can tell you there's real interest from institutions and these are not small by any stretch of the imagination. So I I think it's one of those things where I'm hopeful that in a year's time where we meet again this won't be hypothetical hypothetically building this or hypothetically converting a business and making it more efficient. I hope it can be a Harvard Business School case study of saying, okay, like we need to make crypto relatable. Yeah. To everyone and it's and it's not the casino. It's way more than the casino. So, Meltum is wrong. I love you, Mel, but is way more than the casino. So, thanks so much, man. You got to go on stage. Really pleasure. Oh, really nice set up here. Yeah. It was great to meet you. Yeah."
}