{
    "channel": "KyleChasseCrypto",
    "date": "2025_05_14",
    "transcript": " Something big just happened in crypto and most people missed it. A publicly traded company has secured 500 million from institutional investors. This capital is being used to buy and stake Salana using a financial structure that comes straight out of Wall Street's playbook. The structure is fully regulated and the strategy is already in motion. The company is constructing validator infrastructure to generate long-term yield directly from the Solana network, something Bitcoin's currently not capable of. Institutional capital is entering altcoins in a manner previously unseen. The playbook is established, funding secured, and Salana is at the forefront. In this video, ladies and gentlemen, we will explore the mechanics of the $500 million deal, the reasons behind investors current interest in Salana, and the potential impact of the strategy on the future of crypto investing. Now, if you're holding soul, this video will likely make your conviction even higher. And if you're not, this video may make you reconsider because this firm has only deployed a fraction so far. 20 million in May. That means nearly 480 million in fresh salon demand could still be coming. And that's just from one player. And this player might just be the first domino to fall. Without further ado, ladies and gentlemen, let's get into it. and you guys know what to do to help the channel and make sure that we keep making these videos. Amazing. Destroy the like button. Subscribe to the channel if you're not already. Here we go. Let's start with the basics, the 101 stuff. What is Soul Strategies and why should anyone care? First of all, the name, it's likely intentional. Sound familiar? Micro Strategy, Soul Strategies. This was intentional to let anyone know the basis of their plan. Both companies issue financial instruments to accumulate either Bitcoin or Soul. That as a base draws a strong correlation between a Trady playbook with a crypto twist. Except Soul Strategies does something strategy, formerly Micro Strategy, can't do. Generate yield. Think of them as a hybrid between a crypto hedge fund and an infrastructure provider, but laser focused on one thing, Salana. They're publicly traded in Canada under the ticker, get this, huddle, and they do two things. First, they accumulate soul, the native token of Solana network, and second, they run what's called validator nodes. These are basically the backbone of a blockchain. validators process transactions, secure the network, and make sure everything runs super smooth. Now, here's where it gets interesting. Salana doesn't use mining like Bitcoin. It runs something called proof of stake, which means instead of burning energy, you lock up tokens to help secure the network. In return, you get yield. kind of like earning interest on your savings but through blockchain self-custody and a whole lot better yield. Leading the charge at Soul Strategies is Le Wald. I hope I pronounced that right. A former World Bank economist who helped launch the first NASDAQ traded Bitcoin futures ETF back in 2021. She's worked across private trusts, SMAs, and public ETFs, and she knows exactly what institutions are looking for in crypto investment partner. Soul Strategies takes the soul they own and stakes it on their own validators. With his latest purchase on May 6th of 122,524 soul worth $20 million, Soul Strategies now holds approximately 348,000 soul, all earning staking rewards from the network. They also let other soul holders delegate to those validators. That means they earn rewards on what they own and they earn commission on what others stake through them. So, for example, if you have some soul and you don't have enough to run a validator or don't know how, you can delegate it to them and you can earn some rewards that way. They take a small commission, but it helps them stack more and of course that's more revenue for them. Lee Wald, I guess we'll call her Lee, uh, mentioned that, I hope I said that right. Forgive me if I didn't, that they've been averaging around 10% APY, a real protocolbased return paid out directly in soul from the network itself. The company isn't just passively holding tokens either. They're scaling infrastructure, acquiring valuator companies, and building new tools like Salana staking apps and compliance dashboards to support future growth. They were just chosen as the official staking partner for 3 IQ's upcoming Salana ETF, which could become the first institutional-grade staking vehicle for Soul. Soul Strategies is operating with the mindset of professional asset manager, structured, strategic, and built for long-term participation. This is crypto infrastructure going prime time. Okay, let's break down what just happened because it's actually kind of brilliant. Soul Strategies didn't just buy a bunch of Salana. They didn't raise money and throw it into crypto like a typical investor. They use something called a convertible note. Now, I know that sounds like finance speak, and it is, but here's the simple version. A convertible note is a loan that gives the investor the option to swap what they're owed for shares in the company instead of getting paid back in cash, usually at a discount if things go well. Soul Strategies is raising up to $500 million through convertible notes. And that's just for now. A structure that lets investors earn staking rewards from the soul being purchased and staked. So imagine this. Let's say you loan a company a million dollars. They use that money to buy Salana, stake it, and earn yield. Let's say 10% a year. Instead of paying you interest from their pocket, they just give you a cut of the yield their stake salana earns. That's exactly what Soul Strategies is doing. This is important because it's a new kind of financial product, one that lives at the intersection of traditional capital markets and blockchain technology. It's not just about borrowing money to buy crypto. It's about building a system where crypto generates its own return. And investors get paid from that ecosystem automatically, programmatically, and without needing to touch an exchange or think really. And what makes this even more clever is that investors still have the option to convert their notes into stock. So if Soul Strategies performs well, they don't just get yield, they get equity upside, too. The model is clean, efficient, and scalable. It gives investors exposure to Salana staking rewards and company equity all in one structure. This approach serves as a blueprint offering a scalable model for raising capital in the crypto space. What Soul Strategies is doing might sound new, but here's the bigger picture. This approach is part of a growing movement. Convertible notes are becoming the preferred way for serious investors to enter the crypto space. These structures are familiar to traditional markets, but now they're being adopted by blockchain based returns. Take 21 Capital. They raised $385 million in convertible notes to form a multi-billion dollar Bitcoin vehicle. Instead of direct exposure to BTC, investors contributed Bitcoin and received equity in the firm. The project is backed by SoftBank, Tether, and Bitfinex, some of the most well-known players in global finance and crypto. GameStop also entered the conversation. They issued $1.3 billion in convertible notes to mature in 2030 with a 0% coupon rate. A 0% coupon rate means the company doesn't pay any interest over time. Instead, investors make their money if the stock price rises and they can trade their notes for shares. Some of that capital was allocated toward Bitcoin purchases. Their stock jumped double digits the day the announcement was made. Fold, the company behind the Bitcoin rewards debit card, raised $20 million with a similar structure. The notes are secured by company assets, including Bitcoin holdings, and include a conversion feature at $1.5 per share. And then there's Soul Strategies. Their $500 million facility focused exclusively on purchasing and staking Solana is the largest of its kind in the altcoin space. These aren't isolated cases. They're part of a trend that blends yield, crypto, and investor protections into a single financial instrument, all using familiar structures that traditional markets already understand. Convertible notes are becoming the preferred vehicle for serious capital entering the space. They offer exposure to crypto equity upside and structured yield all inside a format that investors already understand and the companies using them are setting a new standard for how crypto interacts with traditional finance or as we call it tradi. Now the spotlight shifts to salana because this is the network at the center of it all. Out of every blockchain in the market, why is Salana the one securing a half a billion dollars in institutional funding? Why is this the moment it's earning its place in the portfolios of large investors? Let's take a closer look. Salana is built for speed in everyday use. It processes thousands of transactions per second. Independent tests have shown that it can handle even more when pushed to its limits. fees remain extremely low, usually less than a penny per transaction, which opens up a wide range of use cases in payments, gaming, and real time decentralized finance. Its technology has attracted a growing number of developers and projects, but now it's also capturing the attention of institutions. On March 17th, Salana Futures began trading on the Chicago Merkantile Exchange, a milestone that signals growing credibility. The CME is home to futures contracts for commodities, currencies, and major equity indexes. Adding Salana to that list places it squarely in the spotlight of professional money managers and large investment firms. Another key moment just arrived weeks later. On April 16th, the 3IIQ Salana staking ETF launched in Canada. It trades under the ticker SLQ on the Toronto Stock Exchange. This ETF gives investors a way to gain exposure to Salana while earning staking rewards. It's designed for institutions regulated and backed by a wellestablished digital asset firm. Behind the scenes, Soul Strategies is a staking provider powering that ETF. When capital flows into SOLQ, that soul is deployed into validators operated by Soul Strategies. The result is yield generation, increased network security, and a clear connection between institutional investment and blockchain infrastructure. Staking on Salana currently offers a reward rate of around 5.8 to 11% per year depending on the provider. These rewards are paid directly by the network earned by helping maintain its operation and security. For institutions looking for yield with transparency and onchain accountability, this is a powerful option. Salana is also seeing higher developer activity, growing user adoption and new integrations across crypto applications, not just memes. Combined with regulated investment products like futures and ETFs, these developments are reshaping how Salana is being perceived. There was a time not long ago when Bitcoin was the only digital asset the institutions were willing to consider. It had name recognition, a strong narrative around digital gold, and a clear regulatory pathway. The first wave of institutional capital flowed into Bitcoin through futures, trust products, and eventually the ETFs. That strategy worked and it sets a precedent. Now, a second phase is emerging, and Salana is playing a central role. The structure looks familiar. futures trading on the CME, ETF listings in regulated markets, staking products with real yield, and infrastructure firms stepping in to support it all. Together, they form a full institutional blueprint ready for long-term capital. Salana is following the same blueprint that helped Bitcoin break into mainstream finance. This time, it includes staking rewards with yield generated directly by securing the network. that adds a layer of programmable income that Bitcoin's model doesn't offer, at least not yet. When institutions evaluate assets, they look for frameworks they already understand, bonds, yield curves, structured equity, and cash flow potential. Salana staking mechanism introduces a crypto native version of those models. Instead of relying solely on price movement, it provides consistent protocoldriven returns. Lei W B W B W B W B W B W B W B W B W B W B Wald, CEO of Soul Strategies, has emphasized that institutions are increasingly drawn to crypto assets that can generate measurable returns, especially those that resemble fixed income products. Yield from staking fits that mold. It's steady, transparent, and can be modeled just like traditional debt instruments. With ETF access, CME futures, and validator infrastructure from companies like Soul Strategies and institutional custodians entering the ecosystem, Solana now provides the full stack for long-term capital. This is what scaled institutional participation looks like. built around a larger investment thesis designed for long-term positioning. Let's zoom out and take in what just happened. A publicly traded company just secured $500 million to accumulate and stake Salana. They use a traditional financial structure and applied it directly to a cryptonative strategy. The decision was based on structure, compliance, and long-term yield, aligning with institutional frameworks. What we're seeing here is a new kind of investment model. Convertible notes, institutional ETFs, futures, and staking rewards all coming together in one ecosystem. Each piece supports the next. Each piece signals maturity. Soul Strategies has stepped into a position that opens the door for others. This approach can be replicated. It can evolve and it can apply across chains. Think Ethereum, Sui, Avalanche. Each of them could benefit from this infrastructure. The financial tools are already in place. The demand for yield is already there. Now, if intro I told you that this video may make you want to consider adding Soul to your portfolio. I must give a caveat here. Soul strategies, it's the first domino to fall and $500 million isn't going to move the needle much. But if this becomes a trend, and we will be watching closely on this channel to keep you up to date, then it could be the first of many more to come, creating a chain reaction that could see a wave of institutional demand unlike anything altcoins have ever seen. The shift towards scalable yieldbearing crypto strategies is unfolding in boardrooms, in filings, and invalidator nodes. It's driven by firms that understand how to blend blockchain with balance sheets. This is a story about infrastructure alignment and long-term thinking. So the next time someone says crypto is quiet. Just point to the deal that moved half a billion dollars into Salana, not a marketing stunt, just capital doing what it does best, working. Ladies and gentlemen, thank you for watching. Stay sharp. Stack your stats, your Bitcoin. Do me a favor. If you haven't already liked the video, you got value from it, please do that and subscribe to the channel if you're not already. I will catch you on the next one."
}