{
    "channel": "KyleChasseCrypto",
    "date": "2025_05_15",
    "title": "The Easiest AI Altcoin Play In 2025 (Everyone’s Missing This)",
    "video_id": "41ua2YRl9w8",
    "video_url": "https://www.youtube.com/watch?v=41ua2YRl9w8",
    "transcript": " In just 5 years, AI agents could know everything about you. Your salary, your medical history, your fingerprints, your voice, and your face. What you search, what you prompt, what you spend, who you love, and what you're trying to hide, your IP, everything. These agents will be connected across massive networks. They'll share your most sensitive information in real time with the speed and scale we've never dealt with before. So, you can kind of imagine like a curve that goes like this of data sharing from like 1995 to 2025. It's about to go can be an explosion from here because agents need to know way more about you and they share it way faster. This shift is already underway and it raises a simple but urgent question. Who protects your data when machines need to use it? And you have two options. Either privacy is dead and you just have your public your data is public but you have a lot you could be have a personal assistant that helps you with your job takes care of your house. You've got physical AI with a robot that I mean it would be really easy but privacy is dead or privacy is intact and because of blockchains and smart contracts it's ownable by a decentralized group of people investors around the world and they also can contribute if they know how to develop and it's way better for individual sovereignty. So to me it's that that's the fork. There's no middle ground really. Christian Pusetaryi is the co-founder of Mind Network, a web 3 infrastructure project built to protect your information in this new era of intelligent software. At the center of Mind Network is something that's complicated yet we'll get into it. It's called fully homamorphic encryption or FHE for short. A powerful encryption method that keeps data locked even when it's being used. The problem with ZK is that whoever's operating the ZK sees the raw data. The difference with FH now is that uh it never needs to be decrypted. My network is applying this tech across web 3, including stable coins, which Christian believes could be the most important frontier for private everyday payments. I think you're seeing a lot of effort around this stable coin. Uh especially in the states where policy is going to come. So we need some privacy for stable coins. If you're settling things in stable coins, we don't want that all to be completely public, settled on on blockchains. Some of this needs to be private, for example, payers and vendors. I mean, imagine if everyone even salaries or whatever. Salaries. Yeah. Everything. Exactly. This conversation is about digital trust, personal safety, and the future of value exchange because AI agents will need data. But what happens next depends on how we secure it. And ladies and gentlemen, if you're a fan of Chainlink like I am, you'll be shocked to find out just how critical my network is to their success. Without further ado, here is a very important interview with my good friend Christian. Christian, welcome. Thanks for uh coming here. Good to have you. Thanks, man. Yeah, thanks for having me. So, uh so I know uh really well. they know a lot about my network as an investor, an adviser. Uh but you know, for those who don't, maybe you could just give a brief background about maybe yourself and my network as well. Yeah, cool. So, um so I'm the CEO and co-founder of My Network. My network is an FHE project, which is an advanced encryption method that can process encrypted data without decryting it. So, we'll get into what that means, but that's a big shift from what we've been using for the web for the last 30 years. We always decrypt data to process it and that's what makes it sensitive and we'll go into that later but um some call it the holy grail of encryption. The holy grail. Yes, they do. They do. Yep. Um and so um and so actually it's in theory it's been around for 40 years this encryption method. It just became applicable about 15 years ago and in crypto the last few years we're starting to play around with okay what kinds of data can we use FHE to protect. So we are we're not an L1 on L2. My network is uh is modular. Um we also have an SDK and um the whole idea is be lightweight, be easy to use and just start protecting certain types like cherrypicking the certain kinds of data that we can protect now using FHE. And so we've productized mainly into AI and DeFi. Um but there's there's a lot that we can do. Cool. So, I'll start off by saying uh you know I think I first heard about my network I don't know maybe a couple years ago when we first started chatting and or maybe it was a year and a half ago I don't know but I I know that it was around the same time uh when I took a large position in chain link spot on the open market but you know I've really found out you know looked into chain link quite deep and found out what they were doing uh what really impressed me was a lot of the traction and progress that they made with you know triing the technology with a lot of the traditional financial rails like TTCC and Swift and others banks and uh and so then uh when Juliet who first introduced us told me about it you know she told me that you guys uh you know were part of the chain link build program uh and uh maybe I'll I'll pause there and just ask you to explain what is a chain link build program and uh how was your experience there? Yeah, that that was an early win for us. We made it into Binance um the Binance incubator season 5 which is tough to do. Yeah. Um, and of the 12 projects that got in, we were one of only two two that they invested in, which is also which is even harder. But then Chainlink build was tough at the time as well. They only had maybe a few dozen projects if I if I recall. And it's not they don't want you to call it an accelerator, but it's like an accelerator, but it doesn't have a start and stop point. Like once you're in, you can get you can get asked to leave, you know, if things go wrong, if you don't deliver what you said, but if you're in and you're doing what you said you do, you you can stay in. And then Chainlink just gives you the full breadth of their services. And so, you know, they're a 700 plus 650 something person team and the build program is specifically designed for projects that are either like a perfect use case of the chain link product portfolio or protocols or um apps D apps that they think are just going to be really useful, really pivotal, crucial, critical in the space, right? So, Sergey is a no BS kind of guy. So, the build program is supposed to identify projects that are promising early. So, we got in early and then we kind of got like uh graduated a little bit through the program. So they have also um uh channel partners. So if you develop tech that they end up needing or that's good for them, they'll bring you in as a channel partner. So Space and Time got that invite. Um Theoric got that invite. Um ChainML, now the I think they were Chain MML, another Theoic. Um and then my network, so one of only a few projects to get that invite. And then um and so that that product that we built for them that got us that invitation was for their bridge for CCIP which could could be one of the most important if not the most important bridge in the sector, right? Cuz that's that's where Trafi is going to use to come into the space most likely. They're already doing it. So we built um basically we encrypt the messaging layer on top of that bridge which was critical because banks were used to doing that in Swift anyways. I mean in the Trady ecosystem they encrypt that messaging layer. you can't have that message be public because you don't want people to frontr run your trade, right? And then in crypto, you have to worry about mev as well. So, that needed to be done. We did that for them and we're always looking for ways that we can kind of add FHE to whatever it is they're focused on. So, they're launching a payments product um or they just have and um they're going to continue to work. I think they're seeing a lot of effort around this stable coin um uh especially in the states where policy is going to come. So, we need some privacy for stable coins. If you're settling things in stable coins, we don't want that all to be completely public settled on on blockchains. Some of this needs to be private, for example, payers and vendors. I mean, imagine if everyone even salaries or whatever. Salaries. Yeah. Everything. Exactly. Yeah. Yeah. So, you don't want all that to be public. So, right now, if it's settled in USDC, it's it's all it's all public. So, we have to find a way to add some sort of privacy. So, um hopefully we can uh work with them on a solution there as well. So the the channel partners uh essentially I I believe was another way to describe that like a designated like a a designation tier one or something like that. Yeah. Like a tier one. Yeah. Channel partner. Yeah. And from what I understood too that means that uh that the technology that was built and designated as tier one was essential to chain links technology for adoption. Is that right? Mhm. Mhm. Yeah. Right. And so I think one of the things that uh was really exciting for me being you know and it was CCIP for chain like it wasn't the Oracle thing because I think that like plenty of people competes can compete in that space uh but it was like how much traction they had made with CCIP and there are other competitors but there's no one that has like been doing this for as long as Sergey has and built those kind of relationships to where me it's like it's not necessar we all know that it's not necessarily just the best technology although there's probably maybe is, but that's debatable. But it's the relationships that they have that are so impressive. And when you, you know, when you're working with someone like Swift or DTCC and processing all that volume with all those transactions and then realizing that uh that they have a big problem, right? And because they haven't built any privacy solutions into it and that's where my network comes into it. Mhm. So, uh just explain like uh exactly how that works and then I'm curious, you know, uh one of the interesting things from a speculative perspective on chain link is that kind of idea that they introduced of the universal gas token where, you know, every time that one of these chatfi players or whatever use the chain link protocol, there's going to be some sort of like small uh payment. I don't know if it'll be like a fixed basis point or if it's going to be percentage of value, but anyway, you know, the point is that if they're settling millions of transactions a year and trillions of dollars of or quadrillions of Sergey says quadrillions of dollars of volume, uh it's a big number, right? And that's why for me I've been so bullish on chain link. Then now comes in my network recently launched and uh and is there some sort of similar relationship in the mine token as like kind of the China chain link gas token and that same kind of idea where all transactions that are encrypted with mine uh have to use some sort of fee or payment using the the mine token. Yeah. So so that's how we that's the revenue model, right? So that's how we'll make money. Um but it's not always paid in the mind token per se. Right now we're settling it in the token that initiates the transaction. So the native token we can settle on that. It's usually arbitum in Ethereum, but yeah, you do have to pay gas um in order to access the FH computation and encryption and decryption using my network. But similarly, yeah, so getting back to the bigger where we'd like to go, when we look at where chain link wants to go, like DTTC is clearing like what like 910 trillion dollars a day or something. That's like the clearing house, right? The big the big one. So if chain link is to a point where like they're helping facilitate in that or they're a service provider, that's a ton of volume, right? Um similarly we're kind of chasing chain link. We'd like to be like everyone is using chain links oracles. We kind of want to be someone that the the industry has to use for FE encryption decryption when necessary. In some cases you want to decrypt as well and just basic computation. So we want to be that service provider that modular service provider for Yeah. Yeah. just as someone who has an audience who's largely looking at, you know, where to place bets and this interview is not just about like the price speculation on mine and I don't really want to go there so much, but I do want to understand the value acrruel because it would just be a little bit concerning if I heard that like, oh yeah, people can use my network all they want and they pay, you know, this revenue in this native token or some other token. Uh at the end of the day, does that somehow that value acrruel then could be converted back into like is there a buyback of the mine token or something? Yes. Yes, of course. Yeah, 100%. That makes sense. Yeah. So just from a it's just from a a friction perspective you enable them to do any token but then you guys take that rather yeah so it's two pieces. So what we have is basically the um we kind of set up like a hub architecture. So we want to get into the into how this is built. So our basic hubs we have three basic hubs that are the core hubs which are FHE encryption decryption and then random number generation actually which is not truly random if it's not done with FHE. So that's a cool service that we've built for like singularity net and things like that or that Singularity is using. And then what you have is a number of um our AI partners host a hub kind of like a bitensor type architecture. Yeah. Same way like you know you can host a a subnet with bitensor similar kind of function function. So to go from step one to step if you're going to use one of their hubs in that scenario you're settling the gas in the native token usually arbitrum but then to use our core hubs. So those those hub sponsors that then are consuming our core services that's paid in FHE. So that's where the FHE gas gets paid. Yeah. Okay. So now let's talk a little bit more about uh where the space is going. Uh recently there was some kind of big figures that have talked about the need for privacy in the space. You you told me recently that Vitalic made a blog post. I think you said a couple other people had mentioned it which is kind of shifting the narrative. You know crypto is all about narratives and what's hot right now. It's AI in one minute gaming in the next. And now it seems like for something that people largely have written off as kind of not interesting because uh privacy before was always related to you know delisting of exchanges or you know people just not not wanting to touch it because uh regulatory it had issues right so uh so tell me now about like uh what is happening on a narrative perspective that has you really really excited as someone who's you know building that space so well the trify needs it so what we what we What what actually was really heartbreaking, Kyle, and I think I told you this was like when we started talking about this bridge thing with chain link with CCIP early days, what we found out was like the banks have been saying for a while like this is this is a no a no-go for us. We're not having the the message that initiates a transaction that is eight or nine figures cannot be public and they had actually been experimenting with ZK these banks back to 2016. Like JP Morgan had played around with tornado cash like back in the 2010s. So they knew about this stuff and so back in like two cycles ago when we were hearing uh you know um institutions are coming remember that like it's all coming. We were nowhere close. We were nowhere close back then. So that was kind of heartbreaking to me. But then I I realized um you know when we started this like a year ago that well chainlink's been on it. You know like you said Sergey has been building these relationships for a long time before he's even started chain link. He started these things in his previous job. So these are like decade long relationships. So, you know, A&Z and BNY Melon, BNP Perez, JP Morgan, he's been working these for a long time and they've all been going off doing their own research because they're obviously working with other folks in the space and they've got their own desks. So, privacy is mandatory. It's not an option. They don't come unless they've got some sort of p um privacy. And ZK works in some scenarios. The problem with ZK is that whoever is sorry, whoever is operating the ZK sees the raw data. Yeah. So, now there's a trust assumption of a third party. So if you're the bank or the regulator, you've got this now third party that's running the ZK that you have to be concerned about because they see the raw data, right? Can you just real quick uh explain that a little bit more in depth? Why that this is this is the magic of FHE versus like ZK just at brief moment in time uh where for a lot of people it doesn't seem like a big vulnerability, but it actually really is. Right. So that traditionally how the ZK encrypts decrypts for computation or for for yeah computation and then encrypts back again before sent back versus how FH works. Yeah. Correct. Yeah. So with ZK that process you just described and the proof goes on chain. Yeah. Right. And so the actual computation that was performed doesn't go on chain. The proof goes on chain. So the proof is supposed to prove the computation that happened. The problem is if you've got thousands of entities that want to verify that proof. They might not trust it. They might want to verify it. So there's a separate process for that that all happens on chain offchain. What if we want all that to stay on chain? Well that's the magic of FHE. You can put that on chain with FHE. So the computation be verifiable more of like in a one to many kind of a model. Yeah. Um the problem right now full disclaimer is that FH computation is pretty intensive. So that's why I said we're picking types of data that we can encrypt but it's pretty compute heavy. So we need scaling. So the hardware is scaling the software scaling. We'll get there. But that's the only reason we're not using it completely right now as ZK is faster and for right now there's not so much use case and demand that we have a number of parties upset with the fact that they they can't verify the proof on chain. They're just they're dealing with this proof but they actually want to verify and they have to do that offchain. There's not enough demand yet to for that to be an issue. So it works for now but FHE is the holy grail because it'll be on chain. If you want to talk about this basket of confidential compute there's also TEES, there's also MPC. In a lot of cases these things go hand in hand. They're not exclusive. it's not totally competitive. So, we actually use ZK uh in our solution. We use ZK for input output of our of our data lakeink. We use NPC in certain cases where you want to white label. You know that you have a closed group of people that of entities that want to use that data. It's not going to be one to a thousand. It's like one to four. So, use NPC and just kind of white label that now you have an environment where you get to save on the compute. You don't have to use as much FHE. So, these are complimentary. But, um and so for now, we call this broadly confidential compute, decentralized confidential compute. And this is the other reason that I'm excited for Ray now because we should have a report coming out soon from a major publisher calling it DEECC finally for the first time officially and saying yeah exactly this is the narrative. Here's the the technologies that comprise it. Here are the players and now there's you know three four dozen projects now that are all doing something in this. You know we've had ZK for a while but TE projects FHE projects NPC projects. So Neilian just launched recently which we're really excited about. you know, US-based project, a lot of great backers, raised a ton of money. They launched their token the week before ours, and there's more that we know are trying and and are in the queue. So, it's an exciting time, I think. Yeah. Yeah. Okay. So, just before I move on, I want to just explain for audience the the FH part versus where I said before, you have the the you know, goes from user encrypted usually on device goes to the the compute layer, compute section, whatever that is, needs to be decrypted at that point in time in order for compute to happen. Then once computation happens the machine will encrypt it back send it back to user. Uh and so the the point of vulnerability right there is that part where it becomes readable by machine. And the difference with FH now is that uh it never needs to be decrypted. So the machines can can read and process that information compute while stays encrypted. So you never have that vulnerability leak which for sensitive data can be huge. Right? If you're a multi- if any anyone from a small startup to a large multinational, you know, you get a data breach and your reputation just gets destroyed, right? So there's a lot of people are excited about FHE as you mentioned. Uh it's computationally intensive right now. I do know people are working on a lot of ways to, you know, make them more efficient, but uh time will help with that. Uh so you talk about these other players coming to market who are kind of in the same sector. uh does you know how do you how do you look at that? Do you look at that as comp competition and you're worried about that or I mean because you kind of seem excited. Oh, there's like you know half a dozen Yeah. Yeah. No, no, no. It's it's the the more the merry I think right now. You got L1's, L2s, you got folks focusing on wallet KYC. Yeah. So, is does that make you excited because you think that they will be partners of yours? They have been to date. Yeah, certainly. So, so date we're helping each other out. So, it's not competition. It's it's people that you think that will be using my network uh to to make their services. Yeah. I think frankly we probably FH is probably where ZK was in like 2020. So you really you couldn't have too many players in 2020. Maybe now today you might say well there's like you know I don't know how many ZK projects. Maybe today finally we've hit like s market saturation we have enough but I think we've got a long way to go before we get there. Um and again you know we're not we have we don't we're not an L1 or L2. So there's plenty of room for those. There's plenty of room for you know the uh KY KYC wallet solutions with FHE identity really is the big one, right? So we're not doing anything with that. So we focus mostly on on like I said a agents and DeFi, AI and DeFi, but specifically agents. Okay. So maybe you could just go down that rabbit hole a little bit. How does uh my network work with AI agents? Yeah. So to start from the top, and I know that you're you're into this as well. So data sharing has been a huge issue of of the current web, web one and web two. The last 30 years, we've had to share an overwhelming amount of personal data, user data, stuff about you just to get the products that we have today that we all enjoy and love. Those were built off of our data. Um, so you can kind of imagine like a curve that goes like this of data sharing from like 1995 to 2025. It's about to go Cambrian explosion from here because agents need to know way more about you and they share it way faster. So you interact with an agent or a swarm to trade your portfolio 24/7. It's going to know your net worth, your risk profile, your age. I mean, a whole bunch of kind of data that's really identifying about you, but it needs that in order to trade you and get get you a return that beats the market. Well, it can be called on while it's out doing its work and trading for you. It can be called by thousands of other agents that are all doing whatever tax they're doing to see if maybe that data is helpful for them. Like right now in decentralized AI, we don't have blocks really like substantial blocks to stop that from happening and we don't really have a path by which we can follow um who's make who's calling what what what agent is sharing what data with other agents, right? So this is a huge problem in our eyes. We we listened to Sadi Nutella's um maybe you saw the agentic world speech that he gave at the Microsoft it was back in November and so he it was his vision for an agentic world and it's pretty compelling and we buy into that too like agents are going to be way more helpful, right? I mean, I can just say from a personal testimony right now when you when I'm using ChachiBT 03. I mean, complete game changer. I I I don't even use like the 40 model anymore, not even for simple queries because I just think like I don't want your fast thinking response. I want reasoning and logic. And so the 03 model or 04 mini, they need to go with multi- aents using tools, communicating with each other usually like you know with chain of thought and reasoning. And that's just brilliant. So I mean just that like that that shift from when we all first started using chatbt and the way that we used these large language models up until just a week or two ago when they announced like the the vans reasoning with 03 and O4 mini just changed my life completely changed my life that upgrade just from from that model to that model has changed imagine what agents and not only that but you what you're saying knowing about you so another another big upgrade that happened with that was that you know before you had all these uh fragmented chats, right? Yeah. And now they share between chats and now they share. And that is is is mind-blowing because like before it would store some things if you had the advanced or pro version, it would store some things, you know, oh updating memory, whatever. Um, but it didn't have the full context of every single conversation and have the logic and reason the reasoning and logic to to like build all these connections to know more about you to help you and and now like just just for just just I'll just give an example like you know uh I'm moving uh I'm moving to the states right at least for a while and um and I put in a simple prompt based on what you know about me. Yeah. I'm looking for a house for lease for between 6 to 12 months. Mhm. Uh in Austin and find me the perfect house. And man, it thought for like I don't know 2 minutes or something. And it was just like here's your top five. And the number one that it picked was an out of out of the hundreds that I've looked for for weeks and weeks and weeks and weeks was exact same one. It's like based on your biohacking and this one is a has a sauna. It has an ice bath. It has a perfect yard for your dog rooer. It has a threecar garage with a gym built in. Perfect place for a podcast studio and everything. I was like what? It's amazing. Unbeliev based on what you know about me, find me the perfect house. Yeah. Yeah. Like and if I use the old models Yeah. it would go on VBO or Airbnb and it wouldn't understand that I needed a long-term lease. Right. Right. Right. You know, unbelievable. The nuance is incredible. It's just mind-blowing. So, yeah. I think no, it's a great example. Agentic world is just it's inevitable. Yeah. So, and this is that's not even the agentic world yet, but our concern in with those products is simply that like five companies are getting all that data about you. They know your dog's name, Rupert. They know that you love light therapy, right? But those companies have pretty sufficient um data security protocols. The the problem there as you know is that's a lot of power and this there's going to be a backdoor conversation. There has been for 15 years. There's going to continue continue to be between governments and those companies. So we have a real problem there. But we don't have to worry I think as much about the the data security at least like leaking to anybody that wants it. In decentralized AI that's the issue. decentralized AI when you got crypto projects using these tools making decentralized products anybody can call this stuff it's completely available and it's settled on blockchains and it's publicly there's not even I mean it's just you know so that we need a basic level of like of data security there and that's where FH comes in so what we do is we encrypt the communication between agents we help them to register their tasks so similar to how if you think of what model context protocol just did MCP from anthropic it's kind of like this orchestration layer right for API I calling like a robust API calling. What we wanted to be was a similar an orchestration network where they could encrypt their task so that the task of an agent or the task of a DAO isn't publicly available because what happens if you launch a um an agent or a swarm that gets really good at trading all your portfolios and you guys are getting crazy returns every single week. Yeah. You can invite adversarial swarms that now just take positions counter to you in the market, right? Just to take you down. So if you can encrypt the task with FHE, that's one layer of protection. You want to encrypt the communication between the agents. That's huge and critical. And then the um the memory. So when you tell this agent it's going to harvest all this data from you, we want that to be encrypted with FHE as well. So those are the three critical types of data that we focus on encrypting with FH. I think it's important to give context to the audience uh on the the potential let's call I hate this kind of word for startups and stuff like that but let's call it TAM or total total adjustable market because uh when those who live on crypto Twitter uh when we think about AI agents we're thinking about things like you know like uh Eliza DAO or AI6Z or or Griffin which is like these very rudimentary uh types of things that are doing attempting to do things for us in the crypto space. Maybe they're attempting to do some trading. Uh, but it sounds to me like what you're focused on more and the big picture of what you're going and where you're looking at and why you're excited for this market isn't necessarily the retail market. It sounds like what you're expecting is that every major financial institution in the world will not be using human quants anymore. At least not having an entire basement full of them. They might be having a couple design and help support and build and teach and learn. We we we probably won't even need the quants anymore because we have, you know, coming into that point of super intelligence essentially, but all of these big money managers are going to be using swarms and agents to trade their portfolios. Uh and that that is a much bigger market than what if I was just if you just came up to me and said, \"Hey, yeah, we're going to be doing uh you know, agreed web three agents or something like that.\" Because that market is that's huge. Yeah. Yeah. So, so how how big potentially do you think that any idea what that market is like? No, we just know we have indication from all the major we know that all the major banks were working on this, right? Like so they're looking at predictive analysis and they also by the way they want that protected as well. That's IP. So if they get these agents to do that stuff that's not going to happen in I don't know like in decentralized environments they would have to have real they would have FH FH level security guarantees because they don't want the public. So, so what is so what would uh are there nonweb 3 um competitors uh doing what you're doing right now that that might be you know fighting for the same uh customer base as what you're talking about and then if so like why would these big institutions and stuff like what what what do they need the web 3 aspect for uh if they're just you know encrypting their trades well to be clear where my network has focused this productization is the DeFi solution is different from the AI I solutions. Um, so we have a layer on top of a bridge that gives banks the mandatory level of privacy that they demand that they're used to from web 2 just to just to funnel capital fiat into public chains. So that's separate from the agentic world, right? So um, we I I don't know, you know, we we're not actively marketing to bring, you know, big tech into decentralized AI. What we're trying to do is at least make decentralized AI work properly and have the right data privacy first. So it so that level is there. So more more trading in DeFi than uh and the traditional I think so however these guys trade. Yeah. Look, Eliza was the most visited Gitbook in the month of February in the world, right? They're they're marketing that that's marketing right there. So hopefully they're drawing attention. They'll get builders to do that and they'll get tinkerers from some big companies to play with that. So we just want to support Eliza. That's why we integrated with them. virtuals, swarms, you know, spheron, handful of others, but we want to make sure that they've at least got the the data security in place. Yeah. And I think that uh you know, I think just to give a bit more context like it might see if we put those two those two categories side by side and you look at total size of traders in the trady world versus like people who are trading on chain right now, uh it's probably very small. However, uh you know, capital always goes toward efficiency. And you know, when you look at a Monday through Friday market or a 24/7 market or market that can settle in in seconds or a second or whatever versus markets that can settle over days, it does seem like as these DeFi exchanges, I mean, we see like massive volume coming to Hyperlid, for example, there's a new one called Lighter that's coming. And then you got, you know, one on suite called Bluefin. They're all doing billions of dollars of of, you know, trading volume a day. Uh and I I just think that's going to grow uh as as they but yeah the privacy layer is very essential in that because look at hyperlquid. I mean one of every time that a whale makes a trade over there it's instantly published. The whale just opened a 50x long leverage long for $300 million. Like he probably doesn't want you to know his positions, right? No, he does not. So okay. So the the So where else uh is I know there's some other things that my network is working on too. I think some of things that may be even potentially bigger. Uh you told me something about like HTTP Z or something like this. Yeah, that's the vision we're building into. Um, one other product I'll touch on before we do that is um I'll say that we you know we are we are trying to get web two inboard involved. So like we made an SDK that um DeepSeek integrated and so um if you're if you're a product if you're a project like us and you have the ability to make SDKs it's like why not and go after open source communities right? So why not go after like the hugging faces of the world and so on and so forth. So um we are doing that as well. we are trying to reach across the chasm a little bit into web two and like pull devs over and get some some mind share. Um so we'll continue to do that but yeah so all of all of this I think FHE broadly speaking is building into this new paradigm of the web. Like I said earlier from 95 to 25 we had data sharing go like this in order for to produce all these products that we use every day and it's just going to go like this with the aentic world. So, we really might want to rethink data sharing cuz it looks like if you just pretend, and you're really good at this, too. 5 years from now, where do you think this goes? If 5 years from now, we've got agents helping us all the time. We have two options. Either privacy is dead and you just have your public, your data is public, but you have a lot you could have a personal assistant that helps you with your job, takes care of your house, you've got physical AI with a robot that I mean, it would be really easy, but privacy is dead or privacy is intact. And because of blockchains and smart contracts, it's ownable by a decentralized group of people, investors around the world, and they also can contribute if they know how to develop and it's way better for individual sovereignty. So to me, it's that that's the fork. There's no middle ground really. So FH is pivotal and HTTPZ represents an upgrade to the web that allows that second option to be viable, which is where you're encrypting all most mostly all the data all the time. So in a few years at the hardware level you're looking at about a 1000x acceleration in FHE computation. Okay, which would put us somewhere at 10,000 I think TPS in that range. And you've got chip companies like Optalysis that are figuring out ways to do computation in coherent light like in laser light they're doing. So it's it blows your mind and I can't speak to it intelligently but it'd be a great guy to have on the on the on the pod and then corny as well. But then you've got Can you can you before you move on, can you just uh give us a little bit of of context on insight on uh the time it might take to run one one prompt uh on an AI model using FH right now to get a response? Um and then what do you think that'll be using these new methods in the 3 years? Yeah. So today um well actually we so in September of 20 23 we uh after chatb was going crazy we're like hey you know we can just make an API call and then and set up a userface and basically all the prompts can be stored on the users like locally on the user's device so at least you're not sharing a prompt with chatbt right um or at least you can store the prompt locally right they still see it but so we put that up and it didn't get a lot of use case because no one was thinking about privacy back then but if you know Eric Vorhees that's exactly what Veniceai is so they just launched later and he makes a call, they're not just chap, they're using all the LLMs, but that's essentially what he's doing is he's just protecting the prompt data. So that's like a hybrid solution because the computation that's happening on the centralized server is still seeing the raw data. So if you wanted a fully encrypted with FHE soup to nuts front end back end encrypted with FH solution for LM it would be probably 15 20 minutes to get a response from a prompt right now using FHE and maybe in three or four years I think actually well according to some of the guys that work on this it's it wouldn't take 3 years I think maybe like 2 years and we get to the point where we could have that. So, we've gone to market with Zama with the closest thing to a fully to a fully FHE LLM right now, which is where they have an MLS SDK um that allows you to host a model with FHE. So, some of the training data and then we have basically a validation system that allows you to validate that model using FHE. So, this is a hybrid solution. It's the closest we have right now and that's fast. That's that's performant. It's subsecond. So, you know, one day soon we'll get that computation, the actual inference part being encrypted. That's the the missing piece. How does HTTP how does HTTP HTTPZ how does that uh how does that work look on on the back end? Does that mean all websites are encrypted and everything that we do? So now when you go to a website that's that's what you see and then you know that it's kind of like that little lock where people know that say you know HTTP uh secure whatever. Yeah. The little certificate. Yeah. Exactly. Yeah. So HTTPS allowed for like your banking information when you went to pay a website that wasn't available to anybody else right on the web. So kind of put up walls between websites and servers and everything else. Z would basically say well zero trust which you probably know is a term in in developing which means an environment where all data that comes into your environment is untrustworthy and therefore must be verified. So imagine treating the entire web like that. You wouldn't have to do everything. There's like a bunch of you know all of your responses on social media probably don't all need to be encrypted. Like that's all public. But like when you talk about 70 to 80% of the data that's digitized is private. It's health information. and it's sensitive financial information, it's bio information, that stuff you you really it'd be better if it could just remain in an encrypted state all the time. So the Z that we're adding to HTTPZ and this was Zama's idea. We're just we're just disciples of this vision. We can come up with it, but it's it's a idea much bigger than it's not my network's idea. We think that that makes sense for the next version of the internet where we just need access to data all the time for our agents to work better for us, you know. Yeah. So yeah. So if it's not if it's not my network's idea, are you guys still running with it then or Yeah, we promote it. Yeah, we fall in line. Yeah. I mean, the same way that like, you know, Satoshi said, \"Hey, how about a peer-to-p peer electronic cashbased system?\" Like, we promote that. We believe in that. These guys put forth the idea of HTTPZ. We're pushing it. We're productizing to help build that future product. So, you said somehow it's my network will benefit if that becomes success. 100%. Yeah. Okay. Yeah. We would be a critical player in that. Yeah. And can you explain uh who is Zama and what the relationship is between you guys? Yeah. So, Zama is the largest provider of um cryptographic services in the world and and FHE tooling. And so what they do, I think they're one of the the most I think they've they had the highest raise like in France's history or something. They've raised like $100 million or something which they're one of the best startups to ever come out of France. Um and so if you're building FHE any kind of product or app in the world, you probably use their their services. So they're they're working on abstraction so the devs don't have to actually know FHE in order to use it. Um they have an MLS SDK, they have a a concrete MLS SDK, they have a number of stuff. they they launched this Taurus FHE uh product recently which helps FHE be a little more performant and it's faster for certain kind of use cases. It's doing lattice mathematics in a Taurus which is a really fascinating geometric mathematical figure that um I didn't get the degree to talk about but I can just say we were my network was one of the first ones to use it. So they're doing really great work. Rand um Hindi is this is the co-founder with um Pascal who has some cryptography named after him. So he's he's big in academia, a big deal. And so yeah, they they would be definitely a project to know. Um yeah, and and uh relationship with my network. Yeah. So they're um their adviserss uh we help contribute to their um to one of their libraries. They provide us services. So we're connected three ways to Sunday. Yeah. Yeah. Cool. And uh and and I guess um you know finally say is so where like where do you see my network and uh you know and and everything that happens because of a result of what you guys are doing in like let's say 5 years. Um the developing is really complicated and a lot of folks don't know it and you'd have to be a PhD in cryptography to really understand what it is. But the really nice thing about it is that the messaging is pretty simple. individual sovereignty. I mean really and businesses protecting their IP whether you're a small mediumsized business or a big business we don't care but in order to really I mean if you care about the decentralized world if you really want to see that happen then we need to have data privacy and there's no real standard we have an option with web 2 if we want to just keep that model and you want to trust Gemini Google and Microsoft and open athropic to secure your data and you're cool with that we have that solution but if you believe in the decentralized world we need FHE Um, it's critical. FH, ZK, NPC, we need them all. So, does 5 years does that look like uh everyone who's using decentralized web is maybe benefiting from something my network has done even though maybe they don't directly realize it? Yeah. So, so far we're the only ones doing what we're doing in a in the agentic world. The products that we made for DeFi, we're working on stuff for RWA. So, we're in, you know, we're in this FH sandbox, but we're doing stuff that no one else is really doing and we're ahead of the curve. What DeepC did, uh, this is a good analogy here. what DC did to show that you don't need that you don't need all these GPUs to make a performant model right you can optimize the software that's what my network has done with FHE so we don't have to wait for hardware acceleration we found ways to optimize the model and deal with the bootstrapping to make it faster now so cool thanks Christian thanks yeah that's a lot Cop.",
    "transcript_method": "api"
}