{
    "channel": "KyleChasseCrypto",
    "date": "2025_05_08",
    "transcript": " Bitcoin is on the edge of price discovery, just shy of $100,000 with all-time highs now within striking distance. Right now, the macro landscape is shifting at a speed no one saw coming. Emergency trade talks, quiet state level Bitcoin adoption, liquidity slipping through the cracks, everything is converging and the markets starting to pick up the scent. Trump is gearing up for a fresh wave of aggressive tariffs. He's not hiding it. I like tariffs. He says tariff is the greatest word in the English dictionary. And this time he's going allin. Meanwhile, China's playing a different hand. It's cutting rates, injecting over a trillion yuan into the economy, and stacking gold at a record pace. Back home, Jerome Powell has paused rake heights for a third straight meeting. Inflation still running a bit hot. Growth is slowing. And though the Fed won't admit it, we're entering dangerous territory. Stagflation. It's the worst of both worlds. Sticky inflation and soft or stagnant growth. Now, if we zoom in and you'll see the Bitcoin story playing out in real time. New Hampshire just passed a law. A law, not a proposal, a law allowing his Treasury to hold Bitcoin and gold up to 5% of reserves. Then, right as the US China talks get underway, Trump drops another curveball, a full and comprehensive trade deal with the UK. His words, it will cement the relationship between the United States and the United Kingdom for many years to come. And insiders say this is just the beginning, the first of many deals already in motion. So, what does it all mean for Bitcoin, for markets, and for what's next? Ladies and gentlemen, in today's episode, we're breaking it all down. The US China trade chessboard, Powell's silent pivot, the state level Bitcoin dominoes beginning to fall, and the accumulation already happening in the shadows. Because if you want to know where Bitcoin's headed next, you have to start on the macro battlefield. And that's why we're here, ladies and gentlemen, to get you up to speed. Let's start with the big one. The meeting that could reshape global trade. From May 9th to 12th, Treasury Secretary Scott Bass and US TR Jame Greer will meet China's vice premier in Geneva. It's the first high-level face-to-face since tensions reignited. Trump already fired the opening shot, proposing 145% tariff on China's EVs. Try to hit back 125% tariff on US exports like semiconductors and soybeans. Markets are now weighing three outcomes. First, a breakthrough. Tariffs are paused. A road map is signed. Markets rip higher. The yuan strengthens, risk flows return, and Bitcoin rides the tailwind. Second, status quo, no deal, but no escalation. Stocks chop, gold steadies, and Bitcoin tracks the macro drift. Third, total breakdown. Talks implode. China weaponizes rare earth minerals and rare earths. US retaliates. Risk assets bleed. Treasuries rip. Bitcoin and gold surge in a flight to safety. Right now, markets are leaning toward the second, a frozen standoff. But capital, it's already moving. Zoom out. This goes beyond tariffs and trade. Behind the scenes, liquidity is quietly returning. In just 48 hours, the Fed bought $35 billion in Treasury bonds. No speech, no press release, just tens of billions flowing through the side door. This, my friends, is how pivots start. Not with a headline, but with a buy order. Trade, inflation, liquidity, all converging. And the setup for Bitcoin, it's getting stronger by the day. While the headlines fixate on Geneva, the real revolution is brewing right here at home. New Hampshire just passed a bill allowing its treasury to hold Bitcoin and gold. Up to 5% of state reserves can now move into alternative assets like Bitcoin. Then came Arizona. Hours later, same move, two states backto back. State treasuries oversee billions. 5% allocation isn't symbolic. It's real capital flow legitimized at a government level. It also reframes Bitcoin as conservative regulated finance. No hype, no speculation, just treasury grade deployment. If it works in New Hampshire and Arizona, expect the great state of Texas, Florida, and Wyoming to follow. Wednesday acts, then another. You guys know how this works. The first domino to fall, then the rest. Momentum compound. This is how transformation begins. Now, let's see what Bitcoin itself is signaling because the flows, they never lie, guys. Now, I want to remind you of these trading algorithms that we're running. They're absolutely crushing it. Let me just show you. And remember, if you haven't seen it, I'll put a link in the description below to check out my interview with Ash from Sequence so we can explain how these Bitcoin accumulation and US dollar accumulation strategies work. They're incredibly good. the best trading strategy I've ever used. And uh well, let me just show you. So, currently, guys, as you can see, we're looking, we're on my account, which is the sequence BTC, right? And this is the Bitcoin accumulation strategy. And what's important to note here, as you can see, we started on March 10th. Today, the date of recording is May 8th. And you can see cumulatively I've gotten 20 point almost 21% in profit since we started. That is 10 and a half percent per month or at this rate it's over 120% per year. Now this is measured in dollar terms right if we want to look at the amount of Bitcoin we've accumulated you can see I've started with one Bitcoin and now I've got 1.0 3333 Bitcoin. So we've accumulated 0.3333 Bitcoin in 2 months. Right? And remember, this thing thrives in volatility. But also, if your objective is to gain more Bitcoin in a time when there's never been more demand, as we covered in today's show for Bitcoin, this is absolutely a strategy you want to use. Let me just show you the trading performance. It is up and to the right. And as you can see down here, guys, when we look at wins and losses, 55 wins, zero losses. And if we look at inverse perpetuals, you can see my closed orders. Now you can see if you look at the dates over here, it's not every day that it's making trades. This thing thrives in volatility, but yesterday it made two trades. The day before it made one trade and then it chilled because it was going sideways, right? So we didn't get any trades on the 3 or the fourth or the fifth. It knows when to do trades. It's a very smart algorithm. Now, if we go over here and we go to futures, Bitcoin perpetuals, inverse perpetuals, let's take a look at the trades it's making on my behalf. You can see this thing is trading with volatility. It's trading on my behalf. And as the price of Bitcoin goes down, it accumulates almost in a DCA fashion into Bitcoin. So, it's buying the dips like a madman. It is a brilliant trading algorithm and it always is winning, right? And you can see it's very very little risk right now. So my current position right now is open. It's a small order, right? Very small order. This thing trades small value, high frequency, and it thrives in volatility. But you can see the risk right now for me to get liquidated of my Bitcoin. The price of Bitcoin would need to fall to $38. All right, guys. Now you can see from the sequence USD accumulation account, currently the current profit is about 6 and a half%. So far, we've been doing three three and a half% per month, right? This thing started about two months ago, just shy of it. But the charts are up into the right when you look at profit and loss. And you can see down here, they're making small little trades. Now, why isn't this pumping harder? Kyle, you said that this USD accumulation gets, you know, 55%. Well, as it is right now, we're looking at about 40% on your stable coins. Tell me where else in the world you can look at not having to give up your crypto and earning something like 40%. before people would have said it's a total scam. Here you guys can see this is a conservative trading algorithm. Now the reason why it hasn't done so much more. If you look at we started with $25,000 we're at about 26,665 right now. And the reason is because this thing trades predominantly altcoins XRP, Salana, Doge, coins like that. And as you know from watching the video, right now is Bitcoin's time to shine. So when we get into alt season, this thing is going to absolutely rip. But again, I'll show you just how active this algorithm is. So if we go over here to trading performance, guys, and we look at spot, this is a spot accumulation, whereas the Bitcoin accumulation uses perpetuals, you can see that this thing has placed 1,32 buy orders and sold 420 times in the course of the past two months. This is a highfrequency trading bot that is accumulating in a very strategic and safe way. All right guys, so there you have it. That is the our partnership with Sequence. Again, the instructions on how to sign up are in the link below. Make sure that you use my buy bit link. Uh it's required to make sure that you don't have to pay the setup fee with Sequence and to reduce your commission from Sequence from 33% down to 25%. Well, governments play chess. Bitcoin is quietly making its move. Bitcoin dominance has surged past 65%. The highest level in four years. Yep, the altcoin bags are feeling it, guys. Right. Capital is rotating out of altcoins and flowing back into Bitcoin, just like we've talked about on this show several times before. Guys, this is important. If you're not subscribed, please make sure that you do so now because we talked about this before and you would have seen this coming. Exchange inflows have dropped to get get this a staggering 9-year low. Supply is drying up. Remember how we talk about supply shock all the time? Long-term holders aren't budging. Sellers nothing. Ghost town. Meanwhile, institutions are stepping in. Black Rockck's Eyesshare Bitcoin Trust is pulling in major inflows now outpacing its gold equivalent. Thumbs Up Media, a publicly traded firm, just filed to raise $500 million to expand its Bitcoin position. Does this sound familiar, guys? I told you the dominoes are starting to fall on the corporate level as well. Michael Sailor believes over 700 corporate treasuries will hold Bitcoin within a year. Supply is tightening. Demand is institutional. Bitcoin is being positioned as a macro asset of the cycle. And beyond Bitcoin, something even more strategic is unfolding just beneath the surface. Zoom out even further because beyond Bitcoin, the infrastructure layer is accelerating really fast. Robin Hood is going fully on chain. Let that sink in. And it's starting in Europe. This isn't a limited time beta or a side experiment. It's a fullscale launch of a blockchain native trading platform designed from the ground up for DeFi integration. Robin Hood, ladies and gentlemen, Robin Hood. The platform already supports arbitum and Salana with token swaps live on day one. Users can stake Salana directly through the app and earn yields of up to 5%. Bringing passive income and native cryptorewards into a traditional trading interface. It marks a major shift. A legacy brokerage bridging directly into the decentralized infrastructure. Ethereum's adapting too. The upcoming Pectra upgrade will streamline wallet UX and expand staking. part of Ethereum's broader response to challengers like Salana and Sui, which is fantastic for Ethereum. And yes, I do think Ethereum will eventually pump. Everyone thinks it's dead. That's the best time to usually buy, not financial advice. Ripple is making bold moves, too. It's stable coin, RLUSD, already has surpassed $300 million in circulation, and it's just starting to warm up. The company recently acquired prime brokerage firm Hidden Road in a $1 billion deal, signaling a major expansion into institutional finance. The bigger bet, tokenized real world assets. Ripple and BCG project this market to hit 19 trillion by 2033. And with over 100 billion in XRP reserves, Ripple has something most players don't. Capital and conviction. This isn't just about crypto anymore. The entire digital economy is being restructured and big tech is already feeling the cracks. This, my friends, is what crypto and blockchain was designed to do. Alphabet, the company that owns Google, just lost $150 billion in market cap in a single trading session. The reason? Well, it's Apple. And of course, the way that we search isn't the way that we used to search. During a federal antitrust hearing, Eddie Q, Apple's senior vice president of services, revealed something we haven't seen in over two decades. Safari search traffic declined last month. Now, that's not just a blip. Users aren't searching less, they're searching differently, right? Tools like Chat GBT and Perplexity are becoming the new front door to the internet. I almost never use Google anymore. I use mostly chatbt03 model. Even though it takes longer, it's just incredible. The logic, the reasoning, it's a gamecher. And these AI tools, well, they're bypassing Google entirely. And sure, Google has their own AI tools as well, but they're not the ones that are being used the most. And Apple's not standing still. It's now testing its own AI powered search engines inside Safari. Bye-bye, Google. If that goes live, it could end this $20 billion per year deal that Google is currently engaging with Apple. As the default search engine on iPhones, this isn't just a shift in product. It's a shift in behavior. The way people search, learn, and transact is being rewritten in real time. AI is doing to web 2 what mobile once did to desktop. It's not a question of if. The shift is clearly already underway. So after seeing all of this unfold, one question becomes unavoidable. What does it mean for what's coming next? It's all coming together right now. Trade talks in Geneva, liquidity returning, states adopting Bitcoin, altcoins building utility, big tech being disrupted by AI. Each thread matters, but the power is in the pattern. Bitcoin dominance is rising, institutions are rotating in. Policy winds are shifting, and new infrastructure is quietly being built. The next move won't start with a headline. It'll begin with flows, with code, with capital quietly changing hands. And guys, just a quick reminder to make sure to subscribe to the channel because we'll be covering all the key signals you need to stay ahead of the market as we have been doing. And remember, stay sharp. Stack your SASs, ladies and gentlemen. Stack your Bitcoin. And I'll catch you on the next one."
}