{
    "channel": "CryptoBanterGroup",
    "date": "2025_05_10",
    "transcript": " This project created the most amount of money in crypto ever. They gave zero to VCs and they distributed everything to the community. They gave out $10 billion on average. People who use the platform took home about $28,000. And in this video, I'm going to show you exactly how you can position yourself for their second season. So, if that sounds good to you, please like, please comment, please subscribe, and let's get into the video. Hey guys, I'm Aleandro. Remember, nothing that I say is financial advice. I'm not a financial adviser. It's all for education and entertainment purposes only, and it is not intended for UK audience. All right, cool. So, obviously, we're talking about Hyperlid. Hyperlid was the biggest wealth generation event in crypto ever. They gave out $10 billion to users in the first season of their points campaign. They distributed an enormous portion of their token supply, like 38% to users, but they still have 31%, sorry, but they still have 38% of their tokens yet to be given out to users. Well, it says it's earmarked for community rewards, right? What does that mean? That almost always means airdrop. That's a bunch of money. That's like 10 billion dollars in value to be distributed essentially to the community, right? And you, well, this is what I'm doing. I'm positioning myself to take advantage of that. If you haven't seen my last video in why I think the Hyper EVM are going to be distributing a decent chunk of their future community rewards to the EVM, go check it out. That video also covers lighter. If you've watched that video and you need a lighter code, please click below. There should be a lighter code that's fresh this week. So, you can grab a bunch of those. They gave me a bunch more actually. So, there should there should be enough for you. If you want to get a lighter code in the comments, please in the description, please go ahead. All right. So, the give you a real real brief overview because this video is going to get too long of why I think the Hyper EVM is such a good place to go and farm. But first and foremost, Hyperlquid, right, was the biggest airdrop of all time. Yes, we know that. Oh, my screen's not working. Please, please, please, please, please. Um, and it was so big. It was like 3x higher than the than the second biggest. I think the next airdrop is going to be somewhere in this sort of region here, you know, between sort of 3 billion and 10 billion in terms of dollar value. What is Hyperl? Hyperlid is a very very high performance L1. to give you a brief view of of how high performing it is. This is the this is the um the block scanner like 7 millisecond block times, 200 transactions per block, thousand transactions per block. Ridiculous. Hyperlid are they've only got 105,000 holders right now of the token. So again, something that makes me really bullish on the token is like if this was an ERC20 token, they'd only be 60th in terms of like total holders on Ethereum. That puts them like level with like VRA. If you know what veracity is, then welcome to 2021. And yeah, that's how consensus Hyperlid is right now. um in terms of like they're capturing more and more and more percentage of sex volume, centralized exchange volume. So they're doing, you know, like 8% of Binance's volumes now, 19% of um buy bits. They're just constantly generating more and more revenue. They're doing more and more volume. They're getting more and more users. 600,000 users, I think they got at the moment. Numbers are ridiculous, right? They've recently changed their staking structure. So now they have a basically earn more money now. They were earning a bunch of money before, but now they're earning a little bit more money, maybe like 20 40%. And so they're regularly doing like three million day, $3 million days in terms of revenue at the moment. Of course, almost all of that, like 98% of the revenue that they make is used to go and buy back the token. So you've got this like constant buy pressure on the token. Personally, this is why I'm so like bullish on farming the entire ecosystem is because hype's like my biggest most high conviction play. Well, hype and towel both are actually. Um, you probably know that. Uh, but if I can take that hype and then go and basically earn yield on it, well, you can probably I I think there's a very good chance you can like I'm going to be able to increase my hype stack by 25 to 50% maybe more by being smart on the Hyper EDM. Now 25 50% gains might not be might not sound like it's worth it in crypto but for me 100% absolutely worth going and using the Hyper EVM in a very very well like sophisticated way because I think the rewards are going to be worth them. Now why again do I think the reward is going to be worth it? Well, real quick, the Hyper EVM specifically, $960 million in TVL right now. But, but but but about $250 million worth of that TVL is already tied up in the L1 in their vault, right? They got a vault here. This vault here, the HLP, currently holds $235 million in liquidity. This number here includes that number, right? So actually on the EVM with the borrowing lending per um borrowing lending platforms the the swap plat or the dex platforms there's only like you what's what's that 700 700ish 725 mil in terms of TVL now when we consider that they probably are going to distribute around about between that three and 10 billion range in terms of token supply. They're probably going to give out around five or 10% of their tokens in this next airdrop. So if they give 5% of the tokens in the next airdrop to Hyper EVM users and the TVL remains around 750 mil then probably that's like a dollar value of like 55 cents, right? So for every dollar that you put in TVL on the chain, you're getting around about 55 cents back. So like a 55% return. Now, I'll I'll put this um this spreadsheet in the in the comments so you can make of it what you will. I think this kind of box here with a I think I think I think they're going to distribute a decent chunk. But if we take a low ball estimate, 5% goes to the to farmers on the EVM or to users on the EVM and they basically have like you know $1.5 billion in TVL, then you're getting like a 27% uplift on your dollars in terms of using the Hyper EVM. Again, I think 27% APR essentially in six months on a asset that I think is going to 75 to $100. Very, very, very good rewards at least for me and that's why I'm spending a decent chunk of my time doing this stuff. What made that happen? So, that's why I'm spending my time doing it. Now, let me show you the strategies, right? So, there's three strategies. Three strategies. Strategy number one is hype only lowrisk strategy for using the EVM and interacting with four separate protocols. There's a second strategy which is a hype and Bitcoin or hype and ETH strategy which is a bit more risk requires a bit more work interacts with the same amount of protocols and there's a another even higher risk strategy a third strategy that includes um some borrowing and lending which is aka leverage right so I'm going to briefly touch on the leverage one at the end but we're going to focus on these two here I'm going to go through each one in turn so the first strategy It's just a hype only strategy. So, the first thing we've got to go and do is go and get some hype, right? How do you get hype? Well, you have to go onto this website. Again, I'll put links in the comments. Please, please, please, please, please, please, you do not need to click the links in the comments if you don't want to click referral links. No problem at all. But please don't click on Google. Don't go to Google. Don't search it on Google. Do not do that. It's a terrible idea. go to the official websites or the uh Twitters of these protocols and click through those links. Defy Llama is best. I'm going to show you how to click through Defy Lama in just a minute, but super important you don't go and click random links off Google. Drainers are such a high likelihood. Please don't do that. All right. So, you have to go here and click deposit. Deposit chain. You can deposit from Bitcoin. um shame which is mental. You can deposit directly from ETH or you can deposit from arbitum. If you deposit from Bitcoin, you can only deposit BTC. If you deposit from um ETH or Ethereum, you can only deposit E. If you deposit from Arbitum, you can only deposit USDC or USDT. This is actually a new thing that they've just implemented. I think it's pretty cool to be honest. There's USDT on the platform now as well. Honestly, they're shipping it such a they're doing the team is building like ridiculously well. USDT is like a has been implemented as of I think today to be honest. So more stuff and they've got USD now as well. Anyway, I digress. So get some USDC. I've got to send USDC to the platform first. Then this this remember this this strategy is the hype only strategy. So I'm go to trade here. I did say hype only, but I think it's a very very good idea to get a little bit of volume between BTC or ETH and USDC in this spot token here. Why do I think that? Well, um the the spot tokens listed on Hyperlid are not listed by Hyperlid themselves. They're listed by a separate protocol called unit. Now, unit are planning on launching Fcoin spot on the platform. They've already listed Bitcoin. They've already listed ETH. They're going to list Soul pretty soon, which is obviously why they can then list um FCoin because Fcoin is a SLP token. So, I think it's worth acrewing a little bit of volume just swapping between Bitcoin and USDC or ETH and USDC. So, what have I got here? I've got some USDC. I'm just going to buy some Bitcoin with that. Obviously, not all of it actually because then you need to buy some hype as well. We're going to buy some Bitcoin. Yeah. Place order. Done. Wait for that buy order to hit and then I've got some Bitcoin. Done. Bitcoin done. Bitcoin bought. Once I've got my So, I'm going to acrew a bit of volume between Bitcoin and dollars or ETH and dollars. Specifically, the spot tokens on the platform is is is the key. All right. Now, my next thing that I'm going to do, I need to buy some hype because I want to go and farm the EVM. So, need to buy some hype. Use the rest of my dollars to buy some hype. Done. You can obviously wait for the plat the transaction to go through. Yeah, if you want to buy at market, you obviously can as well. Now, I've got some hype here. The first thing I need to do is The first thing I need to do is go and stake it because I think staking will be a portion of future emissions. Right. So, I'm going to stake with Nanson and Hyper Collectctor because these guys are also issuing an airdrop and they have been distributing airdrops along the way. Okay. So, I'm going to deposit my hype in here. Oh, sorry. First of all, you have to go from spot balance to staking balance. I'm going to take from spot balance to staking balance. Click that link there. Yep. Done. Done. Then I'm going to go and stake that with Nansen stake. Yep. done again. N are distributing their own airdrop have already distributed I think two so far. It's only been like an extra sort of like 500 bucks per stake, but I mean 500 bucks per stake is especially like I mean that was that would have even been on a 10 on a 10 hype stake. So, you know, pretty good really. Um once we've done that, we've now staked our hype. The next thing to do is to go and liquid stake. So this strategy is buy hype, stake it, liquid stake it, LP. So we've done there. Now we need to go back to here. We need to transfer to the EVM. So we've got spot to EVM. Oh, made a mistake actually. I sent all my hype. I should have done that. Um, where's my hat gone? One second. Yep. Yep. Just quickly send this transaction through. All right. Cool. Sorry. Back to here. So now I need to send my hype to the EVM, right? Because it wasn't on the EVM a minute ago. So I'm going to send not all of it. 9.9 of these hype tokens. Not all of it. 9.9 because you want to keep some gas in different places. 9.9 of these hype tokens to the EVM. Great. So I sent them I click this button here. transfer to the EVM. Come to D5 Lama. Go to chains. Go to Hyperlid L1. First thing we're going to do here is we're going to liquid stake. So, we're going to go to Hyperbe. Hyperbe I think is the best place to liquid stake because they haven't TGED yet. Looped Hype have already tged, which I I think probably going here is better. Generally, season one's better than not. What we're going to do here, we're going to take half of our total hype, just under half and stake it. It happens. It's done already. Then we're going to go to Hypers Swap. Now, I think Hypers Swap is the best place to LP because they haven't TGED yet and they're doing the most amount of volume, right, in terms of they're doing like the most amount of the most amount in fees on the platform. So, it's likely their decks is going to be worth the most, which means when they do their air drop as well because these guys are also doing a points campaign, it's likely to be half decent. So, we're going to create a position. See here, create position. This is a hype and hype strategy, right? So, it's lower risk because you haven't got you don't really run the risk of impermanent loss. See this here? It says preset ranges. We're going to click preset ranges. Then, we're going to click aggressive on this one because this is just hype against hype. So, we want to condense our liquidity into a smaller area. Then, deposit it in there. Yep. Done. Done. Click max on the bottom one. Got to approve our stake type. Yep. Yep. And then we can add it. That's done. Now we can add that position. Right. So, strategy number one, very simple. Let's go through it again. Steak hype. Steak hype. What happened here? Steak hype. Oh my gosh. What is going on? Stop. Stop. Stop. Stop. Stop. Steak hype. Liquid stake hype. LP. The liquid stake hype with hype. Done. We interacted with the L1 unit protocol, the spot listing on the L1, the liquid staking protocol, and the per DEX, right? Sorry. And and the decks. So, there's four protocols that we're interacting with. Very, very good strategy. Strategy number two, Hype and Bitcoin or Hype and ETH. Exactly the same thing as before, except now we're going to pair up Hype with ETH or Hype with BTC because they pay more in LP rewards. slightly higher risk and much much higher effort because now you have to actively manage those LP positions. So haven't got much time, lower risk, want to keep hold of your hype, this is the strategy, want a bit more risk, don't mind spending a bit more time, the hype and Bitcoin one can be done as well. So same thing here. I'm going to come here. I'm going to swap between BTC and um I'm going to swap between BTC and dollars and vice versa. I'm going to acrew a bit of volume on the unit plot protocol. Then I'm going to go to staking. I'm going to go here. I'm going to transfer just like we did a minute ago. I'm going to st the same person, the same validator, sorry, Nansen. I'm then going to go to hypers swap. Yes. Yes. Yes. Now I've got to unwind this position quickly because well I'm going to show you something else. Going to unwind 50% of this position. So I'm going to keep half of that in there. And with the remaining 50% I'm gonna swap them for Bitcoin. So I'm going to go here. I'm going to swap this to swap it for BTC because now I'm going to LP Hype and BTC. Perfect. Back to here. Create position. Hype BTC. Done. Yeah. Again. Go to preset ranges. We're going to take a slightly wider range here. So 5% 2 and a half% up and down. You can shorten these. You can make them smaller. What this is doing right, what these LP positions are doing is it's only providing liquidity in this range. So if you see the price of if the price of hype relative to Bitcoin goes up here, no longer an active LP position. Likewise, if it comes down here, it's no longer an active LP position. What does that mean? It means you're only earning fees whilst it's in this range. So the tighter the range becomes, tighter the range becomes, the more likely it is that your position is going to come out of range, which means you have to actively manage it more and more. Again, the tighter your range is, the more likely it is it's going to come out of range. If it comes out of range, you've got to actively manage it. So we're going to go 5%. Going to deposit into there. Yep. Add. Add. Done. Once this is in, that's the entire second strategy. Now remember, if these come out of range, it means you have to actively manage a position. That can be a bit annoying, requires time. That isn't something you haven't got loads of time. You don't want to be doing that. Now, that was strategy two. So, my second strategy that requires a little bit more work is just LP BTC and ETH. The reason that might be of interest is because they pay much more in terms of LP position, right? So, if we were to do ETH for example, 180% in terms of ETH, that's what ETH is paying. People are swapping between hypony a lot. So the people who are providing liquidity on the hype ETH pair are getting good returns. Likewise with Bitcoin 54%. Remember that this is not in the full range. That is the full range. So if you're providing liquidity or a smaller a smaller range like we just did then actually the APR's much higher than that. Okay, cool. So the final strategy is not recommended for most is when you use a borrowing and a lending platform to add a little bit of leverage. Right? So I'm not going to go into too many too much detail with this because if you know how to do this then great. If you don't know how if if you if I go over this fast and it doesn't make sense to you, great. Don't use it. Don't use it. Um but I'm just going to show you what I would use if I was to do a borrowing and lending thing. I would go to D5 Lama again, go to chains, go to hyper liquid L1 and my preference really is like Hyper Lend, but Hyper Lend their deposits get capped really really quickly and you often find that you just like can't deposit there. I also really like Felix for borrowing and lending. issue again with Felix is you need to deposit at least sort of like three $4,000 of collateral to be able to borrow at like a reasonable loan to value ratio. So, I really like Felix, but it's um you need to deposit a lot to be able to actually use a platform. So, I'm going to I'm going to going to I mean, you can't use it, right? Because I'm not going to deposit enough. So, Hyperfi actually could be the best option in a lot of ways because regardless of size, you can deposit in Hyperfi, no problem. It's not that Hyperfi is like more risky or anything. It's just that I think the airdrop from Felix protocol will be much better than Hyperfi. So in order of like my preference, I think Felix is the best borrow lend platform on on Hyperlid right now. Then Hyper Lend, then Hyperfi. The issue is Felix, you need like a decent chunk of capital to be able to borrow against that capital. Hyper lend the deposits fill up really really quickly. And Hyperfi often is like doesn't have any of those problems. probably for good reason because it's the airdrop for Hyperfi isn't going to be anywhere near as strong as it is for Felix Protocol or HyperLend, right? Okay, that covers it. I'm going to briefly briefly outline it again. So, you've got this strategy here. This is what I'm deploying. I'm I'm running this one personally, a hype and um BTC and a hype and ETH strategy. It's mainly focusing on LPing providing liquidity on the platform on the hyper EVM because I think they'll probably do a timew weighted average balance for how they distribute the airdrop. What that means is if you deposit one ETH for 100 days, for example, that's 100 ETH, right? Um 100 ETH worth of liquidity. If you deposit one ETH uh sorry, if you deposit 100 ETH for one day, then that's also a 100 ETH of liquidity. So, they will very likely do a time weighted average balance. Again, I don't know if they're going to do this or not. This is just like I I've farmed a lot of airdrops in the past. I would be surprised if this team rewarded clicking a bunch of buttons. I would be very surprised if this team didn't reward TVL on the chain that was like actually left there. Genuine usage on the chain. So using different protocols is probably a good idea as well. The thing to remember though is like DeFi carries massive risk, right? Loads of risks in DeFi. You have to hold your own wallet. You have to um you can click malicious links. DeFi has a bunch of risks. So you like good DeFi helpers like don't use all your um whatever it is to go and do DeFi. This is why in this in this strategy like the vast majority of the hype is staked. You stake the hype. I'm staking the hype in the um in the standard way and then going to use the D5 platforms with the remainders that I think I think and I feel like I'm going to get it's the riskreward is there based upon the things that I said right based upon dollar return per TVL based upon the fact that you're interacting with four different um interaction starting with four separate protocols along the way. So that's why I think it's worth doing in this high prevm. So this was a highly requested video. I know this stuff's a bit bor is like kind of boring. Thank you so much for watching if you stick stuck with it to the end. Remember that doing this stuff gives you like edge, right? Most people can't be bothered to do to go interact in this in this way which generally provides edge for those that do. So this is why I always think like if I if I'm going to go do something and I think can't be bothered to do that. I always think okay great that means most people are feeling like that so that gives me edge I'm going to go and try and use that to go and get the thing done so that I can stack the cards in my favor. Hopefully that makes sense. If you've got any questions, any requests of things you want me to go through, um please please let me know. I've got a few things coming up. The next next week's project, next week's um video, I think, is on a um a stealth launch project that just looks ridiculous. I'm going to do a video on that next week. Otherwise, thank you ever so much for watching. I hope you have an excellent day and I shall see you in the next one."
}