{
    "channel": "KyleChasseCrypto",
    "date": "2025_05_01",
    "transcript": " What happens when you sit down with Arthur Hayes in the back of a Maybach and dive into the future of Bitcoin, the US trade war, and the Fed? You get this, a raw, unfiltered conversation with one of the sharpest minds in crypto and one of the boldest voices in global macro. Arthur approaches the market like a strategist with clarity, conviction, and zero hesitation. He built BitMX, invented the perpetual futures contract, and he now runs Malstrom, one of the most respected crypto investment funds in the game. But what really sets Arthur apart is his ability to zoom out and call the play before it happens. So when we asked him where the world is heading, he opened with this. People are living in opium. They say, \"Oh, it's not going to be so bad. there's not really going to be a divorce between China and the US and I think you know that's there will be a bifurcation of the world into a US camp and a Chinese camp structurally this is going to happen the American empire cannot handle volatility nor can any other um country around the world bitcoin thrives in that that situation so we don't need to be worried that's the kind of clarity Arthur brings he's not here to sugarcoat it he's here to show you where it's all going and when We asked him where Bitcoin fits into this global mess. We know how Bitcoin responds to this. We now have an ETF. We now have this um this narrative in an institutional investor's mind that oh, Bitcoin is not just NASDAQ high beta. It's actually a hedge against the fall of American exceptism, the fall of the American hedgemonic empire. But this wasn't all theory. We also talked about timing, the exact moment he knew the bottom was in. That is going to be the the bottom moment of this particular cycle when Besson got on Bloomberg and gave that interview saying he's got buybacks and he's going to make sure that the Treasury market is well supported. That was a signal to go long everything. And then just before we wrapped up, he dropped the number that stuck in our head ever since. 2025 target is This is more than just an interview. It's how Arthur Hayes is positioning for what's next. And if you want to understand what's really going on in the markets and where Bitcoin is likely headed, then ladies and gentlemen, come join my conversation with Arthur. Are there so the the tariff ski cuts uh in real time 3 weeks later? Uh are they uh would you say they're pricing right now or still? I think that you know people are living in opium. saying, \"Oh, it's not going to be so bad.\" They're not really serious about sort of changing the global monetary and trade and capital structure. There's not really going to be a divorce between China and the US. And I think, you know, that's there will be a bifurcation of the world into a US camp and a Chinese camp. Countries will try to play both sides or align with one or the other. We don't know how that's all going to play out, but structurally, this is going to happen. Trump is just accelerating a trend that was already present. He started a trade war in 2018. Yeah, Biden continued it. He has intensified it. He's backed off a bit. But if you've looked at how Trump does negotiations, he starts with a maximalist position. He walks it back. He looks more consily. Then he comes back again at you with more maximum pressure, sort of get the best deal that he can given the set of facts. And so I think that's going to happen again. And so we're going to see some more volatility in the financial markets. But the best thing that we have figured out is that 140 on the move index elicits an immediate policy response. So you don't have to worry about it. Say it again. 140 on the move bond volatility index elicits an immediate policy response. The day that move hit 140 went to 172 intraday. Jamie Diamond gets on CNBC and talks about how bad shariffs are and how the bond market is having issues. Trump auto immediately does the 90-day pause and Besson gets on TV talking about Treasury buybacks and the Fed Susan Collins says they're ready to do whatever it takes. So the market, the American empire cannot handle volatility, nor can any other um country around the world. Bitcoin thrives in that that situation. So we don't need to be worried. Yeah. So one of the things that we've seen is like uh is China being pretty pretty like all the other countries seem to kind of like really played into Trump's maximum pressure backing in. Okay, yeah, Trump, whatever you want. Let's make a deal. Okay, rely 10% tariffs. China on the other hand seems to the whole thing to steady and even double downing although we know now that 45% of the the containers have kind of stopped and soon that's going to maybe be grind to a complete halt. Uh so when it comes down to the trade war with China specifically and imports and exports who demands who depends on who more and do you think China can continue to hold really firm and not kind of bend at the knee to Trump's demands or what do you think is happening there? So I think people underappreciate the amount of pain that the Chinese population can take to achieve a particular goal. And so Xiinping destroyed you know what analysts will say 20 to 40% of GDP was in directly indirectly related to the property market and he thought you know there's in the polar bureau that China was too addicted to this type of growth and therefore they were going to curtail it and they popped the property market bubble starting in 2020. Mhm. And you know, it's been really bad for property developers. And they're not stopping. They're they're they're not ruling out the stimulus checks. They're not doing all the financial easing that the the macro analysts say that they should do to arrest this decline in the property market. She is perfectly happy to watch that part of the economy wither and die. If it means that the houses are more affordable for more people and that credit that was going to building apartments goes to high-tech, semiconductors, AI, and all these sorts of things. So this was 30 to 40% of its economy. Of course exports are big are big in China, but they're nowhere near as big as property. And so if they're willing to do that on property and they continue to be able to suffer the consequences of a property market uh bubble bursting, of course he can wait a few months and watch, you know, the US sort of experience this pain. Trump is a popularly elected politician. Everyone who's in his orbit is there to reap gains post Trump leaving office in 2028. They can't sit by and watch the Republican party get completely trounced in 2026 or you know the country swing back to a Democrat in 2028. All these people in Trump's orbit, they have, you know, financial and political careers that extend well beyond that. And so they're very attuned to the pain that the American person is feeling. Whether it's the rich person who owns stocks or it's a small business owner who was importing Chinese goods who could no longer do so or it's somebody who was working at some sort of industry that no longer has a job because they can't make things work without Chinese intermediate goods. And so I don't think America can take the sort of pain that is necessary to do this change quickly. The change is going to happen. It may not happen in 6 months like Trump wants it to. It might take 20 years. And I mean it's interesting too because when Trump came in office obviously one popular vote won all the other votes and uh you I mean my gut instinct would have said that with the elections in Canada coming up and Europe that probably the right the right leading candidate would have won but we just saw the elections happen and you had the left party won. A lot of people are saying that came down to kind of the way that Trump was running things and how you know the economy is kind of suffering and the uncertainty. Do you think that largely led to it? And then how do you think Trump and the administration will look at this as if things don't get much better coming into midterms? I think that this, you know, uh, carney winning in Canada coming from behind was more to do with Trump's 51st state. You know, Canada, you do what we tell you to do, sort of solidarity more so than anything else. And you see it in Europe, right? the Europeans, you know, the elite Europeans were not on board with Trump trying to end the Ukraine war with Russia. And so now they rally behind we are Europe and so we need to do things for Europe and [ __ ] you Trump, we're going to be more Europe. And so, you know, this nationalistic pride for these um nation state entities is rising in opposition to Trump where they just think it's an ugly America, right? So I don't think it has anything to do with, you know, Trump's policies per se. It's just how he goes about enacting them. That makes a lot of sense. Uh you just you just uh like literally just got off stage here at token 249. Uh I didn't get to see the speech. Uh but hopefully we can get some What was like the big takeaway from there? Uh so we could sum up for the audience right now. Yeah. So essentially my main thesis is heard it was great by the way. Uh we'll put a link in the description to it so you guys can watch the full one and all of Arthur's socials and stuff like that too. But uh but I just heard it was awesome. So I mean in 2022 in the third quarter everyone was super bearish on crypto and other risk assets. Why interest rates are rising? Um the bond market was collapsing, stock markets going down, FTX is imploding. Nobody wanted to own crypto. Bitcoin hits 15,000. People think it's going to 10,000. You know that kind of stuff, right? And then out of the blue, Janet Yellen comes back with, you know, not QEQE. this activist treasury issuance issuing more bills and bonds taking $2.5 trillion that are sterilized on the Fed's balance sheet and moving that into the global markets and we saw a risk assets from December of 2022 till early 2025 pump Bitcoin up 6x stocks doubled gold doubles um everything is great but the Fed was not really been that accommodative over over that period of time he just stood by Paul sat in his [ __ ] chair and got [ __ ] by by yelling right and that is the set we have today it's a a little bit different. So we have Besson in charge. We have another uh issue with tariffs, right? Bond markets melting down, stocks cratering. Oh no, inflation is going to rise because China is not going to provide cheap goods. I am I have a very uncertain I don't need to own Bitcoin. I don't need to own these other assets. But what happened? The authorities saw that volatility was increasing and Bessing gets on TV and talks about Treasury buybacks. Yeah. which is essentially a way for them to relieve pressure on balance sheet constraints which allow the banks to lend more money to hedge funds to buy treasuries at auctions in this thing called a basis trade. And so I think that is going to be the the bottom moment of this particular cycle when Besson got on Bloomberg and gave that interview saying he's got buybacks and he's going to make sure that the treasury market is well supported. That was a signal to go long everything. Okay. So that that was a big one is a treasury buyback. Can you explain that to the audience a little bit more simple just why that's bullish and how that is discuss um you know these hedge funds they own bonds they have a trade where they buy a bond they sell a a derivative futures contract and they take that bond to the bank and they say hey bank I I don't have any money to buy the bond can you give me the money okay yeah sure I'll look at the bond it's a treasury bond very liquid collateral here's some money I want you to assert percentage of equity against that now they need a lot of leverage to make this trade work from a profit standpoint and so the less equity the bank requires the more leverage they get, the more they do the trade. Yeah. And these hedge funds show up at the auctions and they say, \"I don't care what this bond is priced at because I'm just trying to trade this differential between a bond and a derivative. So, yeah, the US balance sheet is [ __ ] with this $36 trillion and all these sort of issues, but hey, I'm going to make 10 basis points, leverage it up 100 times. I'm sweet. I don't care what the price of the bond is.\" Is this is kind of like the same basis trade that we saw when the ETFs first launched and then and then when it Well, this is this is in the bond market. There's nothing to do with crypto, right? Okay. So, but so you don't think they're going to go buy Bitcoin ETFs to that basis trade. No, this is all about the how many dollar how do we get dollars into the system. So these hedge funds they show up and they buy the treasury debt that Bessant is issuing. Now the issue is that as a bond matures it becomes less and less liquid as it moves further and further away from the benchmark tenor. So what does what can Bessant do? Well he can do a budget neutral supply neutral thing where he issues a new bond he buys back the old bond. So now the old bond trades a bit expensive, right? The spread narrows between the old bond and the futures contract. The hedge fund makes a profit. Um they now their books are relieved to the old bonds that required a higher equity capital charge. They get these new bonds that they can get more leverage on. They made a profit and now they can do this trade even more. And so best is actually clearing the bank's balance sheet so they can lend more money to these hedge funds who can show up at the auction and buy the data at a very expensive price and buy a lot of it. And I know in my presentation I talked about how I know everyone's talking about Doge and Elon's going to cut the budget and all this kind of stuff, but looking at the numbers so far, fiscal year 2025 is tracking 22% higher than fiscal year 24 in the United States. Now, I know we're only two months into Trump's presidency, maybe there's going to be So what what do you mean tracking higher? What which what is tracking higher? So the amount the size of the deficit so the deficit from 2000 the fiscal year in the US starts October. We're going to have a bigger deficit this year. Correct. We're going to have a bigger deficit this year. Even with Doge, even with Doge, we're going to have less tax receipts because the stock market's down. And so that is the structural way that they just can't cut stuff fast enough, right? And then if they do cut things and they have a recession and then the all these automatic stabilizers come in and the government has to spend more money in unemployment checks and all these sorts of things. So there is only a one-way street for the deficit to expand. Besset needs to find someone to buy these bonds. you can do so by giving more leverage to relative value hedge funds by doing buybacks. And so that's the mechanism for how you know a buyback in and of itself is not liquidity positive leads to more dollars created through higher borrowing um that is led by these relative value hedge funds who buy this stuff. And so what are what else are there because we're we're still in um we're easing off quantitative tightening right now, right? We're not yet in quantive easing, but what are some other kind of like nonQE tools that they have to kind of help the markets? So, there's the supplemental leverage ratio. I know people have been talking about that. And essentially that is if I'm a bank and I buy a bond, these new regulations after the global financial crisis said, \"Hey, you guys didn't have enough capital against these bonds you bought. So, we're going to make you hold more capital.\" Very, you know, that's responsible. And that means is I can only buy so much debt of the US government because it cost me precious equity capital to do so. So what the Fed did during CO was when the bond market melted down, they said, \"Hey, we're going to exempt you from that. You can buy as much Treasury debt as possible with no equity down.\" So infinite leverage. Wow. And then after the fact, they rein reinstated that rule. So you know, Jamie Diamond's calling for it. Um Scott Besson's calling for it. The Fed has been talking about it in their meetings about, okay, to help the market function better, maybe we should exempt again treasuries from the supplemental leverage ratio so banks can go and buy them. So, this is great for bank profitability because they go to the deposit and they say, \"Oh, I'm going to give you 1, 2%, whatever it is. I'm going to go buy this treasury debt at 4% with infinite leverage. I make 2% interest margin. Happy days. I'm making like, you know, lots of [ __ ] money.\" And so, that is going to allow the commercial banks in the US to buy all the debt that Besson is issuing at whatever price Bess wants to issue at. And again, not QE, right? It's a regulatory change, but that's how it impacts how the financial system functions. So, what do you think about about the Fed and you know the the kind of drama that we had with Trump at first calling Jerome too late Jerome and that he was stupid and then he kind of walked that back like you said and then the you know talking about firing him and then not firing him and then uh of course Ray cuts is the goal but you know do you think that we're going to see Ray cuts coming up in May or I don't know I don't think it matters I think it's really it's all about the Treasury and and at the end of the day what's Trump trying to do is try to find out where where is the line okay well I said I'm going to follow Paul bond market yields back up. Okay, not going to file power now. Okay, found there's a fault line there. You know, I wanted to go maximless tariffs and you know, equity markets down 20%, bond market volatility spikes. Okay, there's a line there. So, he's finding out the constraints of what the market can handle in terms of how fast change can happen and then he'll adjust and and go forward. So, super interesting, right? I don't know if we've had can you can you think of the last time we've had a president that has done these kind of uh finding the like like really coming out as a businessman and that kind of feeling you know where's my where's my pressure point you know where is that not really but I but again he's not doing anything different than a Democrat would have done they're all the policy will be the same it's just the rhetoric and the speed that's that's the issue but that's why Bitcoin is great because we don't care you we know you're going to print more money we know that Bitcoin does best when money is printed I I don't know. I can't tell you what stock's going to do well. Like that's hard. But I can tell you Bitcoin's going to go. Yeah. So in your speech you you said uh I think Bitcoin to a million correct 2028. Correct. So what leads us to that? So Biden issued about 7.1 trillion of debt uh net to Treasury issuance over his term, right? And we got we got Bitcoin 6x, right? Trump is already tracking 22% higher in the first few months of uh his tener. Um and again, is that spending this high deficit? This is uh net treasury issuance. Okay. Um Oh, no. Sorry, that's that's a deficit. The deficit have a 7 cumulatively $7.1 trillion deficit. The deficit's already expanding under Trump and he's supposedly doing Doge. Yeah. Yeah. They're cutting stuff. They just it's a drop in the bucket. Not enough, right? And if you think about the US population is getting over structurally. So, Social Security and Medicare payments will rise structurally. They can't they can't stop that. The defense budget is going to only increase, right? you know, they're gonna have to reshore production, you know, build a bunch more missiles and bullets and all that sort of stuff, right? And and so like again, the deficit is only going one way. It's going higher. But what's the path to 1 million? Yeah. So again, expanded deficit, 7.1 trillion cumulative deficit under Biden. Trump is only going to increase. US population is getting older. So healthcare spending will increase. They can't change that. the defense budget will only go up because, you know, we're talking about this global realignment of supply chains and trying to build it all in the United States and not use Chinese intermediate products. That's expensive, right? So, it's going to cost more to buy American stuff. But again, that's not the coin. It's like security and supply chain integrity and that and that kind of stuff. So the things that drive the the budget are only going up and and interest on the Treasury debt again is expanding exponentially because even if Trump is successful on his plan which is 3% deficit by 2028 because of where you started with the size of the debt your interest costs are still expanding exponentially. Yeah. So again there's just no way mathematically unless they decide we're going to shut down the government which is not what he's not what he's talking about that they're going to be able to spend less than Biden. And so, you know, we're already at so we know what was going to happen. We know how Bitcoin responds to this. We now have an ETF. We now have this um this narrative in an institutional investor's mind that oh, Bitcoin is not just NASDAQ high beta. It's actually a hedge against the fall of American exceptism, the fall of the American hegemonic empire. Maybe I should own some of this. This is going to do well because I can't predict what happens with bit, you know, China and Trump and, you know, all the politics. So, I mean, it sounds like in a way what you've said, uh, and it was something I I heard someone else kind of float this idea, you know, they're going to want they're going to need to spend more money. Um, but also what's a really good excuse is like, you know, we want to make America great again, which means we need to bring all manufacturing back on shore. We need to do build all of our nuclear warships that we haven't been building. I mean, all that's going to cost so much money. So, uh, you know, someone else helps floated the idea of the administration coming out and saying, you know, we need some multi- trillion dollar stimulus package essentially to rebuild America and and you know, do all that stuff. Do you and subsidize manufacturing and get everyone to come back. Do you think that's kind of like maybe how it might be packaged and and just another way of saying like we need massive stimulus to kind of Sure. And it it'll be something like the CHIPS act in the US and the Green New Deal under Biden. At the end of the day, these politicians, they need to go back to their district and say, \"Hey, here's some stuff, some goodies I brought you.\" Yeah. Whether it's a a plant or it's some jobs and whatever. And so, if Trump says, \"Okay guys, like I know you guys are deficit is bad, but hey, here's a bill and you can take it back and there's going to be a new for plant. There's going to be, you know, a new chip foundry in your district. Are you going to say no to that? No. You you want to get reelected? You're going to bring back the jobs to your to your constituency and the banks are going to lend. Oh, there's there's a government program that guarantees a buyer for this thing. Sure, here's a loan, right? So, credit expands in the economy and people have jobs and they spend money. Yes, there's inflation, but if everyone's got a job and they have a good income, do they really care? No. Yeah. So, that's I think that's the playbook in a sort of medium to longer term of how you get this expanded government spending and it being accepted by the population. Do you think that we top out in 2025? And if you if you do or where do you think that we top out and what price do you think we top out at this at this cycle? I think well 2025 my end of year target is 250,000 for Bitcoin. I think that we're going to get the maximum sort of bullishness on the amount of money to be created probably in 2026 2027 especially because in the US uh the Fed chair role uh is up. Yeah. in May 26 and Trump maybe they're not going to get a complete political lackey but they're gonna get somebody who is on board with printing the money and doing what they need to do uh to further accelerate this you know make America great again. So I think that we're going to get a much more dovish Fed at the minimum you know at the latest from May 2026. So we could see that 2026 to 2027 is absolute bananas while everyone's just like oh my god they're just like they're gonna do everything we need QE and supplemental leverage ratio and triv buybacks and like yield curve control it's all on because everybody's on side with Trump uh and then we'll extrapolate a change and that's too large and then we correct. Yeah. And that's the time that you guys want to be alive. Yeah. Exactly. For the Milson prize in 2026. Yeah. Yeah. I got to get the VIP for that one. Yeah, for sure. So, so, so assuming that maybe that happens, right? Uh, like that's the wild that's the bananas on the rout, right? So, where where do we go at that point? I mean, that's that's that's pre2028, which you said like a million by then. You think maybe we hit it sooner or is it kind of just like I just think we'll hit the peak of the cycle in 2026 2027 and then uh and then we're going to have to like think about okay we're expecting too much and then it might under you know the Republicans are facing some some election issues right and things have to change whether or what happens with China we don't know right there's so many other variables of how this could change but I think the world is on this money printing track and as that narrative becomes firmly entrenched we're going to extrapolate a future That's really ridiculous. Yeah. And it'll have to be brought back down to reality. So when it comes down, so on your portfolio allocation right now, at least on your liquid asset sites, crypto sides, how much are you allocated to like Bitcoin versus other majors? I think it's probably like 60% Bitcoin, 20% ETH, and the rest is other uh shitcoins. Okay. So what do you then everybody right now like talking [ __ ] about ETH, right? But I mean I for me the way I think about it is just like it's it's the only chain that feels like you could comfortably put a $500 billion you know DeFi position on or something like that and like not really worry about it going down or something like that. I don't know if Salon has been that battle tested and gone long enough with you know without fault or anything like that. What do you what do you think about ETH right now? I think it's the most hated layer one and so on balance it should do better. Yeah. Exactly. Yeah. Uh it's most secure, proof of stake, large number of developers, large amount of value, secure, all those sorts of things, right? Obviously, we were trading the rate of change and the expect expectation. That's why Salana went from 7 to 300, right? The rate of change of adoption of memecoins and transaction was was really rapid. Therefore, the price went really really high. But even at its peak at 300, it still didn't eclipse ETH in terms of total market cap. Right. But again, we're not trading total market cap. We're trading the price. Yeah. So I think that Salana, yes. Will it go up? Absolutely. Could ETH outperform Salana if we get this sort of, you know, money printing bonanza and people shift out of Bitcoin into more altcoins? Yes. And especially if he starts to show us some life, the price creates the narrative. And all these all these things that we Yeah, ETH is great again. Yeah, exactly. Oh, it's got the most developers. That's why I'm buying ETH. Yeah. All these things. Oh, you think anyone's going to build a real DeFi protocol in Salana? Like, no way. Yeah. Yeah. So, it's it's just meme coins are popular. Salana's popular. Uh, and what about any other anything else that you think is like really going to be strong? I mean like you had Sergey in the in the digital asset kind of committee like one of the only tokens. You had I think out of all everyone was chosen to be in that inner circle that first one that happened at the White House. You had Sergey with chain link. You had Brad Garlinghouse with XRP but that was it. Everyone else was Brian no token know like other guys no token. Um was there any other kind of assets you think I mean so we own Pendle and we're investor and advisor of Ether. So I think there will be a narrative fundamental season which is do you have do you have the users do the users pay real money for a product or service and if you take do you take that revenue and profit and pass it back from the protocol to the token holders very few projects do all those things for sure right and so I think after doing this for after doing 10 years of altcoin trading maybe we finally like done so many of the [ __ ] that finally okay well I want to see some [ __ ] money in my pocket staking my backs whatever it is right I'm tired of this like VC game that we've been playing or these shitty ICOs that that I've been buying. I want to see a project that actually has real traction. Yeah. Especially if it's already launched, right? If it's not launched, fine, cool. If there's a new narrative, I don't know what that's going to be. New SP shiny thing. We'll trade it. Yeah. It'll be fugazy. Whatever. It'll be fun. I'm talking about a token already listed. Am I going to buy the like down only high FTV lowflat token on Binance? No. I'm going to go I want the hyperlquids, right? So, we're super bullish on Pendle, largest fixed income trading platform. It's profitable. It's handing back rewards uh to Pendle holders. We're very bullish on EtherFi. They're building this Neo Bank. I, you know, I was on Twitter showing my my EtherFi card. You know, I've been around for a long time. I've seen a lot of these cards. Um the fees are reasonable. It works. You can use your Apple Pay. I think they're going to build a very sticky client base spending good money. It's like the American Express of of crypto. Cool. Right. So, and they're committed to taking revenue and buying back their token and passing it on to EE5 stakers. So, again, that's the type of stuff that we're very interested in if it's a token that's already launched. Okay. And for for people who are watching, you know, that maybe are new to crypto or even veterans because like everyone wants to know like maybe what is your advice for people on if they're even if they're either starting starting out and looking to allocate capital or they want to maybe rebalance uh or maybe what kind of strategies would you suggest to to people who are kind of just getting in the space? Well, I think you always have to define your hurdle rate. So what's what are you benchmarking against? So in Maelstrom I benchmark Oshot and the rest of the guys against Bitcoin. I could go buy Bitcoin and not pay all of your salaries. So justify to me with your performance why why you should have a job, right? And so that's our hurdle rate is invest in shitcoins and early stage projects and do all this advisory stuff to earn a better return than if I just bought Bitcoin or ETH, right? But it might be different for, you know, another person. Oh, I borrow this money. It cost me 5%, right? Okay, so I need to make more than 5% of my dollars. Okay, how do I how do I go about doing that? Or, you know, I have a long time horizon and I've seen that Bitcoin's done really really well. I believe in this money printing thing. So, I'm going to buy some Bitcoin, hold it for 10 years, and you know, I think I should be, you know, outperforming the fiat the basement. So, again, really depends on like your life situation. What's your goal? Define it before you invest. So, then you can always check yourself. Okay, well, I've got this investment. Is it actually doing the thing I want it to do? If not, then you adjust. But it's you don't want to define that strategy and justify a bad position. Oh, I was doing it for that. That's why I'm going to keep holding it. Well, maybe not. Yeah. Yeah, I mean you and I I both I think we we play around in the casino sometimes and buy some [ __ ] coins and like it's fun. It's like dopamine hit when they pump 50x or something like that, you know? But uh do you think that people watching like should like what what do you think they if they want to play around at that casino, how much percent of their portfolio would they be allocating to these like high risk, high reward types of beta plays? Uh I think if you are concerned about the price when you go to sleep at night, then you have too large of a position. Yeah, 100%. I've been there myself especially in especially in leverage and borrow borrowing and like on a time to borrow and I've been there everywhere like Bitcoin comes down a bit you're like [ __ ] you can't sleep you know that's not a good place to be so bitcoin goes back to I don't know let's call it alltime highs so what what kind of defines your checklist on when we see altcoin season coming real quick guys I just want to tell you about my Bitcoin accumulation bot it has been absolutely crushing it and in just 45 days guys I've turned one Bitcoin into 1.0 033 bitcoin. If this pace continues guys, I will have turned one bitcoin into 1.27 or 1.28 bitcoin. Now, just to give you an example of how powerful compounding gains can be if you keep this strategy going and you don't take any profits out, if you start with 0.1 bitcoin, after 10 years it turns into 1.16 bitcoin. If Bitcoin goes to a million dollars after 10 years, then you're talking about turning $95,000 today for 0.1 Bitcoin into over a million. If you want to find out more and you haven't seen my video interviewing Ash from Sequence, there's a link in the description below. I made a whole video on exactly how this strategy works. And I'll also leave a tile at the end of the video. You can just click that once you're done watching this one. It's one of the most powerful strategies and one of the best ways to secure your financial future. All right, now back into the interview. Uh, I think bit I personally think Bitcoin dominance is going back to where it was before sort of the 2021 altcoin season which is like 70%. Yeah, it's that sort of area and then you know you just start people start rotating, right? Oh, it's back above all time highs. Oh, the bull market's back. Okay, well coins should outperform. See if that should is a key word there. Depends on what you buy. And and that'll give back the animal spirits. people start going back in the ecosystem like okay the bull market's confirmed we went down we're from 70 to 110 down to 70 back above 110 maybe at 150 or 200 or some level like on on rising volume very good looking technical chart okay now it's time to go into the [ __ ] and like try to find some gems do you think that there's a scenario cuz I I I wonder about this sometimes uh I mean I've been here for all the cycles before they all play out almost identically but in my mind there seems to be this one scenario where you you know, the strategic reserve like starts aggressively accumulating and then the other countries are like, \"Oh, this is really happening.\" And then they start aggressively accumulating and then the Bitcoin supply shock really kicks in and now Bitcoin's going up 10 $20,000 a day and it's just sucking liquidity from because when you when that thing starts skyrocketing like what we seen when we see one coin that just you know we get them once every two months or something like that, right? Some some Trump coin comes out and just every all alts go down 80% cuz everyone's rotating into that sucking all the capital. Do you think this is a scenario where Bitcoin goes on this crazy adoption cycle and supply shock kicks in and it just dominance just keeps going up and people now are like all coins are worthless. They're shitty memecoin stocks. Like let's go into Bitcoin because that's what everyone's adopting. And so we go into I mean I think eventually probably at some point people will start rotating back into alts. But do you think there's a period of time where people start question like like Bitcoin really takes off and altcoins don't for a while? I mean, we've kind of had that already, but I don't I'm not really into the whole strategic reserve situation because the countries that have that people really talk about United States, right? Okay, they're a deficit country. So, the only way they're able to do strategic reserve is, okay, well, we we we're not going to sell the Bitcoin we took from people, okay, fine, that's 200,000 Bitcoin. But I just don't see how a politician who's popularly elected goes and says, \"We're going to print some money to buy Bitcoin.\" Especially when like the popular narrative is a bunch of like Bitcoin bros going to the club buying bottles. Like, is that really what you want people to think about your your policy? I just don't see that happening. I see people doing the China play, which is, okay, I've got excess electricity that's stranded. I'm going to mine some Bitcoin and I'll hold on the stakes coffers, but I'm not buying it in the market or like in do in the UAE, right? I've got excess hydrocarbons. Fine, I'm going to save those hydrocarbons. I'm not going to pump the oil, but I'll electricity create some Bitcoin. I'm not going to print money and buy Bitcoin. I might print money and hand out a check to everybody because at least I get more voters that way. Yeah. Right. I just don't see that's right strategic reserve happening in the way in which people fantasize about it. And so therefore this situation where like America's printing trillions of dollars to buy Bitcoin. I mean why what's the point? It doesn't buy you any votes, right? Okay cool. You made the rich people are going to vote for you anyways richer. That's not that's not a valuable strategy to you know counter sort of a resurgence of the other party in the next election. Yeah I agree. I think we talked about this a little bit last time too, but like now we start to see even more corporates doing the kind of micro strategy uh method. Do do you think there's going to be so maybe not the Bitcoin like uh reserve strategy, but I think what we've seen now, actually I know what we've seen now, we talked about it yesterday's show is we've seen corporations acquiring more Bitcoin than the ETFs themselves. So do you think that maybe this might continue? And so we I mean there's a lot of different forces other than just the Bitcoin strategic reserve that could drive this like supply shock. Um especially the And then also uh who is it? Um is it Howard Lutnik's son I think starting the this 21 or whatever. Yes, that one. Yeah. So like we have a lot of these kind of things are being buy up a bunch of Bitcoin. Yeah. I mean we we participated in the UPXI uh deal where that company is going to put some on its balance sheet. I think at the end of the day there's a portion of the world that cannot even invest in a Bitcoin ETF that wants some sort of crypto exposure. Yeah. Right. The rules say they can't do it. But they can invest in public market equities. Uh especially the United States. This so this is the the people that sailor is targeting. Hey, due to some rules that I didn't create, you can't buy what you want to buy. Yeah. So I'm going to give you a proxy for that. Uh and I'm going to load up my balance sheet with Bitcoin or ETH or SW whatever it is. And then you're going to pump my stock and it's going to trade at a premium to what the asset value. That's the trade. And so, yes, they'll continue as long as there's a lot of this money on the sidelines says I want to own crypto. I'm not alone. I'm not allowed to buy the Bitcoin ETF. I'm not allowed to buy uh Bitcoin spot or don't wor I won't want to. And therefore, the only option are these like corporate stocks that I'm already approved to buy. And so then they do this like treasury strategy. So, I think it will continue for a while. I think obviously Sailor is in the best position because he's, you know, now on the S&P 500 or NASDAQ, whatever the the index is, and has this ability to just tap the ATM and continue crazy. Um, and then, you know, the music may stop when volatility declines on on Bitcoin and these stocks are no longer, you know, rising and falling on a big degree and then the interest waines. Yeah. We've seen bit Bitcoin kind of tracking gold and kind of decoupling from the stock market and we've seen traditionally always super high correlation between Bitcoin and the stock market. You think that we're finally decoupled or you think it's just a short-term kind of uh decoupling? I think we've only half decoupled. I still think there's going to be another big selloff when Trump goes back to saying, \"Oh, we're really going hard at China or something something like that, right? To reestablish his credentials as like maximalist position on tariffs. Oh [ __ ] he's they're not going to provide the the money that we want. stock market goes down, Bitcoin might wobble a bit, but I think we're finally people are starting to finally understand it's about bond market volatility. They always act and always print the money when the bond market volatility rises and therefore Bitcoin should do well. So, I think we need one more demonstration of that uh for to really just sink into people's minds. So, yeah, do I think it's going to be another like early April situation where Bitcoin and NASDAQ are tracking pretty much, you know, exactly? No. I think Bitcoin is going to, you know, perform. It might not go up um but it will be steady if sort of stock market create a bit which has been kind of unheard of for its whole history almost. Yeah. I mean we see seen it being treated as a tech stock right. Yeah. Well good. All right. Thanks. Very very good. Bear."
}