{
    "channel": "KyleChasseCrypto",
    "date": "2025_05_09",
    "transcript": " I've watched entire generations of Ethereum killers come and go. White papers stacked like encyclopedias, conferences packed to the wall and then silence. Because in crypto, promises don't build ecosystems. Execution does. Every cycle, one chain quietly starts pulling ahead. It doesn't beg for attention. It earns momentum. In 2021, that was Salana, and it made Ethereum feel like a dialup in a 5G world. Now, in 2025, and the signals are louder than ever, something is happening. Something big. User numbers exploding, hardware shipping, capital rotating in billions at a time, and the name on the front of it all. Sweet. Now, fun fact. All right, guys. Fun fact. Here you go. You might pronounce this sooie, but it's sweet. Sweet. Sweet. Sweet. Sweet. I don't know. I think it's like Japanese for water or something like that. This is more than hype just fueled by influencers. This is traction you can measure. We love data, right? A coordinated buildout across hardware, payments, gaming, and yes, even Bitcoin. And while the rest of the market stays distracted, a new kind of infrastructure is quietly locking into place. So in this video, we're pulling back the curtain. The tech, the timelines, the capital flows, all of it. You're about to see why is setting the pace, not just following the cycle. And if you understand what that means, you still have a shot at positioning before the crowd wakes up. First, if you really want to understand where SUI is headed, you've got to rewind where it all began. The story doesn't start in a Discord channel or a pitch deck. It all started inside Meta, where Zuckerberg, armed with more capital than any crypto fund could dream of, handpicked an elite team to build DM, a global financial protocol meant to serve billions of users. That project never made it out the door, but the team did. And when they walked away, they took something extremely powerful with them. A radically new framework for digital ownership. They stripped away the corporate weight, open-sourced the core ideas, and rewrote the entire chain from the ground up. What they built was way more than just another smart contract platform. It was a system where every onchain asset behaves like a real world object. Something you can hold, transfer, combine, or destroy with rules baked directly into the data. It's called object ccentric architecture and it flips the execution model on its head. Instead of waiting in line like Ethereum, SU processes transactions in parallel. Every action flows independently. No collisions, no bottlenecks, no global locks. That design breakthrough is powered by SWU's consensus layer, Mississippi. Finality now locks in at around 250 to 500 milliseconds. That's like that. Depending on the transaction type, the throughput has already hit over 100,000 transactions per second, meaning transactions happen faster than the time it takes you to blink. SU's already delivering in production at scale. And here's the results. User growth is skyrocketing. In just 2 months, SU's adoption quadrupled. 10 million active wallets became 40 million. That's without a viral moment or celebrity campaigns. Just real users interacting with real apps and sticking around. Suite is shaping the infrastructure layer for digital property. Fast, fluid, and ready for adoption. a system designed for the world that's coming, not the one that already exists, and the deeper you go, the more obvious it becomes. Suite was built for scale, but speed is more than benchmarks and transaction charts. When it's done right, the blockchain aspects seemingly disappear. And that's what we all want, right? We want to use blockchain without feeling like blockchain. And that's where SUI quietly changes everything. And the best technology is the kind that you stop noticing, right? You don't think about Wi-Fi when your video loads. You don't think about the cloud when your files show up across your devices. You just expect it to work instantly and reliably. That's the level SUI is operating on. Let's start with payments. SU's rails are already powering live consumer transactions like Mastercard's integration inside XPortal, a leading cross-chain wallet and payments app. Tap to pay, blink, and it's done. That's real world DeFi. That doesn't feel like DeFi. But it's in gaming where it gets really impressive. Most chains buckle the moment gameplay gets real. Sweet doesn't flinch because it was designed from day one to process everything simultaneously. Parallel execution has become more than just a roadmap promise. It's working right here, right now. spells, attacks, item drops, all processed in real time without waiting in line. Just fluid gameplay powered by the same architecture, securing billions in value. And here's where it really breaks through. Thanks to something called ZK login, developers don't have to compromise between vision and usability. No seed phrases, no browser extensions, no awkward wallet popups. Just sign in with Google, Facebook or Discord, and under the hood, a fully non-custodial wallet is created. Blockchain magic, ladies and gentlemen. It feels like web 2, but behaves like crypto. And that's the unlock. Because when you remove friction, not just in speed, but in identity, adoption accelerates. Investors stop asking if the tech works and start asking how much it can scale. This is the tipping point, ladies and gentlemen, when the blockchain doesn't feel like a blockchain anymore. And once that happens, it goes from slightly better tech to setting an entirely new benchmark. When performance disappears into the background, capital starts asking better questions. What's the next yield? Where is a real infrastructure being built? And in 2025, that answer started pointing at sui. Let's talk signals. In just 90 days, USDC on SUI nearly doubled from half a billion to almost a billion quietly without a single viral tweet. That kind of move doesn't come from DGEN's chasing momentum. That's real institutional flow from investors with long-term mandates and conviction. We're talking Panta Capital, Franklin Templeton, Vanek. These firms that don't get out of bed unless the pipes are secure. The latency is low and the risk minimized. And now that list is growing. Just this month, 21 shares, one of the world's biggest crypto ETF providers, entered a strategic partnership with SUI. They're studying and building with it, pushing toward US ETF markets, publishing research, and giving SUI one of the strongest institutional endorsements we've seen in years. And it's not just institutions making moves. Some of the sharpest minds in the space are going allin too. So why sweet? Because under the hood, it's built like a professional-grade stack, fully audited, horizontally scalable, and now with the regulated custodians like Bitco stepping in. The compliance layer is finally catching up, clearing the path for institutions to manage risk assets on chain. But even that doesn't tell the full story. What matters is how that infrastructure is being used. And right now the protocols on suite are maturing. Guys, I almost forgot. Uh let me know in the comments below what are your favorite ecosystem picks in the sweet ecosystem. We'll be making a video next week covering our favorite picks in the sweet ecosystem. So, you're going to want to make sure you're subscribed and stay tuned for that because as you can see, the ecosystem is absolutely exploding and I expect altcoins to follow soon. We're seeing lending apps that are safer and more efficient with smarter ways to manage risks. New financial assets are being built to hold steady through market swings instead of collapsing the moment that things get volatile. And rather than chasing quick gains with risky yield farms, developers are building more structured, sustainable strategies, the kind that could actually support real world financial products. It might look like DeFi with a fresh coat of paint, but in reality, it's crypto growing up. Even Panta pointed this out at Base Camp. I was there. The new generation of financial rails won't come from retrofitting old chains. They'll come from platforms that were designed to carry real volume from day one. And as capital moves in, liquidity compounds, products evolve, and momentum accelerates, which brings us to the next layer of the stack. Because stable coins might be the smoke, but Bitcoin, that's where the fire starts. Bitcoin has always been the heavyweight, the trillion dollar reserve asset, the final boss in the store value narrative. But for all its dominance, it's been strangely disconnected from the rest of crypto. No native yields, no clean DeFi integrations, no real composability, too secure to risk, too rigid to move. And so it just sat all while the rest of the space experimented, iterated, and yield formed itself into oblivion. That's what made the Babylon announcement such a gamecher because for the first time, Bitcoin holders can now stake real BTC directly to secure a chain that's fast, flexible, and built for real apps. That means no more relying on risky rappers, bridges, or synthetic assets. Just cryptographic finality routed straight into sooie validators. It's not just another workaround or Bitcoin derivative like you see on ETH, for example, like graph Bitcoin. It's native Bitcoin staked for yield. That yield doesn't depend on memecoin inflation. It's driven by real fees from real user activity that can't be faked, sustainable, transparent, and secured by Bitcoin itself. Now guys, while this is impressive to be able to stake native Bitcoin on suite, if you are not using the sequence trading algorithm that I'm using right now, you're missing out on a lot of Bitcoin yields. For more information about that, make sure that you guys check out my video interview I did with Ash. I'll link it in the description below. And make sure that you guys use the buy bit link and the sequence link to sign up to start using this Bitcoin accumulation strategy. It is the real way to get real yield and accumulate more Bitcoin. All right, let's go back to the story. And just as the door opened, another project stepped through. It's called STAX, and it's building a layer that brings smart contracts directly onto Bitcoin. Their SBTC layer connects that logic to SU's lightning fast engine, settling transactions in real time without breaking a sweat. That unlocks a powerful connection between the most secure asset in crypto and one of the fastest, most flexible platforms it's ever been plugged into. The momentum is already visible. Over 10% of the TVL on SU is now Bitcoin denominated. And that's before retail has even caught on. Zoom out. Even if 1% of Bitcoin's market cap inflows into SU's native DeFi, that's tens of billions of dollars of deployable capital with Rails execution and primitives already in place. And what that creates is a first real bridge between Bitcoin's liquidity and the programmable layer it's never had access to until now. But capital isn't the only thing SU is unlocking. Because what's coming next isn't just financial infrastructure. It's physical and consumerf facing a plug-and-play device that's arriving with a familiar screen and buttons, a Trojan horse, if you will, baked right into the operating system. Let's talk about the console. Some products change markets, others change behavior. The one that might do both, it's called SW Play 0x1. A portable gaming console designed from the ground up to connect web 3 natively. Designed to speak with the blockchain without plugins, wallet extensions, or clunky onboarding. Under the hood, every interaction is powered by Suite. Every in-game asset, your gear, gold, character skins, all exist directly on chain. You tap, you play, you upgrade. Behind the scenes, a full crypto engine is humming along, executing everything with subsecond finality without interrupting the flow of the game. And the center of the system is G dollar, short for game dollar. Think of it like in-game money but smarter. Goll is a stable coin baked into the operating system issued by Playron. The team is building the OS layer for play and beyond. This is more than game credits. G dollar is modular money. Earn it in one game, spend it in another, trade with it, tip with it, send it directly to a friend instantly without ever leaving the console. And because Goll is the stable coin, it holds value backed by short-term US treasuries. That means players can build wealth not just from scoreboards, they can move value across games or even offplatform without losing purchasing power or needing a centralized exchange. And here's the best part, the user never even notices the crypto. The entire financial stack, identity, payment, settlement is invisible. And it's all made possible by the same invisible infrastructure we touched on earlier, including ZK login, which handles authentication in the background without relying on seed phrases or Chrome extensions. Just sign in and go. Developers get an embedded financial layer without building their own tokconomics from scratch. Players get an asset they can trust and SUI handles the settlement infrastructure without friction. All of this runs on Playron's modular OS built to make web 3 invisible. The device manages key storage, transactions, and app switching in the background. So, what users actually see is just a polish, intuitive interface like a gaming iPad with economic superpower. From what we've seen at Base Camp last week, the direction is clear. This is more than a console. It's a cryptonnative entertainment operating system. One that feels like a traditional device but unlocks an entirely new design space. Imagine booting up a game where the leaderboard rewards where the leaderboard rewards real value or building a reputation across titles with approvable onchain profile or earning digital items that hold up outside the game as real assets, collateral or even identity layers in new apps. Sweet Play and G Dollar are already reshaping how games and economies connect and where hardware, stable payments, and liquidity ready blockchains come together like this. You don't just get better games, you get an entirely new app ecosystem native to crypto, portable across experiences and ready for global scale. And for once, the end user doesn't have to know anything about private keys, gas fees, or token standards. They just play. And that's the unlock. Because once crypto feels fun, fluid, and invisible, mainstream adoption becomes a feature, not a milestone. And this is only the surface layer. A couple other things to mention why this device is so powerful. I was there. I saw the presentation myself. I touched it. I held it. I played with it. Is right now there's a lot of friction with the Google Android store and the iOS store. They wanted to take 20 30% from all the revenue derived from all the apps and games on its stores. This eliminates that, allowing game developers to have a another distribution method and put web 3 games with revenue systems directly onto a console, bypassing the centralized incumbents. Another thing that I thought was pretty impressive, too, is that Nintendo Switch 2 is set to come out later this year. And from what they've told me at Sui Base Camp is that this device, the Sweet Play, is supposed to be more performance out the gate than the Nintendo Switch 2. If you've made it this far, you're probably starting to see the picture. This is more than just a fast chain, more than just a GameFi bet, more than a narrative trade. Sui is building a new internet stack from the ground up. Let me explain. Every app you use today, from Netflix to Instagram, relies on invisible infrastructure, cloud storage, compute, messaging layers, identity systems, all of it controlled by a massive middleman, Amazon, Google, and Apple. But sweet, they're replacing those rails with something entirely different. Something crypto native, decentralized, composable, and built for scale without middlemen. Take Walrus for example. Think of it like Dropbox rebuilt for crypto. It stores files, yes, but it also stores logic. You can upload a document and attach a smart rule to it. Who can see it, move it, update it, all enforced by code without any servers required. Now look at Seal. This is where things get wild. Seal lets apps talk to each other. Think Discord but on chain. Think app coordination without APIs. agents, contracts, and programs passing tasks between each other live and permissionlessly. Then there's Nautilus, a marketplace for raw GPU power. Imagine if you could rent compute instantly from another in the world. No data center, no cloud bills, no AWS accounts, just plug in, spin up, and go. And powering all of this, ZK Tunnels, a bleeding edge protocol that lets devices communicate peer-to-peer. Not just wallet to wallet, but phone to console, console to drone, drone to satellite with zero gas or internet dependency. Literally a literal mesh network secured by zero knowledge proofs. When you add all this up, it's more than a blockchain infrastructure. It's the beginning of a new digital fabric, a full stack runtime for everything, apps, games, agents, assets that doesn't just mimic the internet, it upgrades it. And yes, AI plays a role here, too. Because when you combine memory from Walrus, compute from Nautilus, and coordination from Seal, you don't just get automation, you get onchain intelligence. Agents that hold assets, allocate capital, and make decisions, rebalance portfolios all by themselves. But the key here, Suite didn't build these tools as hype driven side quests. They built them to stack. Each layer unlocks an X. Gaming demands fast identity. ZK login delivers. ZK login opens the door for real payments. G Dollars handles it. Payments bring users. Walrus stores their data. Seal coordinates their activity. And soon agents evolve from users acting across all layers without friction. This is how you know it's different. Other chains are racing for short-term attention. Suite is building infrastructure for a world that hasn't fully arrived yet, but it's coming. And when it gets here, sweet is already live, already scaling, already shipping. And for the first time, crypto might actually feel better than the internet it's replacing. But even when the tech is this strong, code won't always move markets. Sometimes all it takes is a whisper. While the foundation gets laid brick by digital brick, markets are already chasing something else, a story. In crypto, the real gravitational force isn't always tech, it's narrative. Because capital doesn't just respond to benchmarks, it responds to belief. And earlier last month, a single sentence sparked one of the loudest whispers in the industry. Buried deep inside the privacy policy of Pokémon. Yes, that's Pokémon. With a curious line, Parasol Technologies was listed as development partner. No tweet, no big announcement, just a quiet footnote in the sea of legal text. But for those who were paying attention, it said everything because Parasol is owned by Mist and Labs, the core builders behind Sui. And within 48 hours of that sentence surfacing, SU's price spiked. Markets didn't wait for a product drop or a Pikachu NFT meant. The smartest people in the room could read between the lines. It meant the groundwork was there. that if a brand as massive, as obsessed with seamless gameplay, and as global as Pokemon were even exploring blockchain rails, Sweet might already be in the room. The idea was enough to ignite a narrative on its own. Because what if, just what if, the most beloved gaming IP of all, this time made its blockchain debut. And what if it happened to be on suite? You don't need a road map for that to move markets. You just need plausibility, infrastructure, that's performance, execution that's proven, and a signal that the door might be open. Because in crypto, people don't wait for confirmation. They price in possibility. And when that possibility intersects with global nostalgia and the dream of true digital ownership, that's more than opium. It's rocket fuel. But here's what really makes this moment powerful. Even if Pokemon NFTts never materialize this year, it barely matters. What matters is that the groundwork exists, that major IP holders are experimenting behind the scenes, and that SUI quietly, methodically has made itself the only L1 ready to catch them all. Not because of one deal, but because of everything that's come before it. Most chains are still pitching slide decks. Sui has already built the stage. And when the world's biggest IP start looking for a blockchain partner, they won't be looking for promises. They'll be looking for production. That's what Sui has right now. And just in case you thought this was all speculation, here is SU's own team making the vision crystal clear. Amazing games like Pokémon, Yuiio, you name it being possible directly on chain with SUI. Parasol is working with a number of partners to bring that to the home um in the hands of users. Very excited about this transformation that's going to happen. We believe this is the most gamechanging um piece of tech to come onto the Sweet Network and ultimately we believe it's going to shift focus onto bringing on the next billion users. You heard it yourself. Pokemon level IPs onchain with a billion users in sight. This isn't just narrative. It's in motion. Let's zoom out and look at what happens when all of these pieces come together. Most people think of crypto as financial plumbing. New coins, faster payments, maybe a game or two. But what SU is building goes deeper. It's not just a blockchain. It's an attempt to rebuild the invisible internet. The part no one sees, but everyone depends on. In web 2, that layer is dominated by a handful of gatekeepers. Your files live on someone else's server. Your data flows through someone else's pipes. Your identity, your content, your logic, all siloed, surveiled, and monetized without you. Su is designing a world where those assumptions don't hold. A world where memory is persistent, not centralized. Where coordination happens peer-to-peer, not behind APIs. Where compute isn't rented for monopolies, but composed from markets. It's not about making blockchains faster. It's about making the internet trustless by default, a complete paradigm shift. And for a venture investor who's lived through multiple cycles, that's the kind of ambition you don't fade. You follow it. And if the team can pull it off, you bet big. But even the best foundations come with fault lines. And before conviction turns into capital, the risk have to be named. Now, let's talk about risk. Because if you're only looking at upside, you're not investing. You're gambling. Sweet is early. That's part of the appeal, but it also means there are gaps and some you can see now and others will only discover under pressure. The chain did experience an outage. It wasn't catastrophic or prolonged, but enough to remind us that even the fastest engines stall under peak load. It hasn't faced a black swan liquidity shock. It hasn't survived a hostile fork war or full-blown governance crisis. And while it's onboarding capital at warp speed, it still needs to prove that velocity can hold when markets turn volatile. Now, let's talk supply. This one makes headlines and for good reason. Look at FTV than market cap. The spread is big, big enough to spook retail. And for those of you wondering what that means, well, FTV is fully diluted valuation where you look at the total coins that are available locked and unlocked multiplied by the price. And circulating market cap is just the tokens that are currently unlocked and circulating. And that's a big disparity because people expect that the inflation from those unlocks later are going to create a lot of sell pressure. And in a market that's still licking its wounds from past tokconomics disasters and bare market optics matter. But here's what matters more. SW's unlock schedule is long game by design. More than 52% of the total supply doesn't even begin unlocking until after 2030. So yeah, the FTV might look high on paper, but most of those tokens aren't entering circulation anytime soon. And for the portion that are unlocking, they've been trending smaller over time, not bigger. tightly controlled pacing guided by actual network growth, not quarterly token dumps. That kind of supply discipline is rare, especially in a space where most projects still treat emissions like marketing budgets. And that same discipline shows up on the regulatory front. This isn't a chain pretending policy doesn't matter. Miss Labs has been proactive both defending its turf and helping shape the battlefield. They've opened dialogues with US and European regulators. They're not just attending forums. They're helping traditional finance go on chain. The Athens stock exchange isn't experimenting with blockchain in theory. It's actively building a fundraising platform on SUI, bringing regulated capital markets directly onto decentralized rails. And with World Liberty Financial, a Trump aligned DeFi protocol, SUI is now part of a strategic reserve and co-developing tools aimed at scaling DeFi access across the US. It's a clear signal when politically connected players are choosing where to build their choosing suite. It's the kind of alignment that sets projects apart because if there's one thing I've learned through cycles, it's this. Great tech isn't enough. The team has to know how to navigate timing, distribution, and policy. I've watched world-class protocols die because the builders never stepped outside the codebase, never picked up the phone, never mapped the markets. But this time, they're showing up in the right rooms, moving early, shipping intentionally. And when I see that level of awareness, the ability to build and anticipate, that's when my conviction deepens. Because asymmetric bets don't just come from early entries. They come from teams who know exactly what they're walking into and building anyway. That's what separates the noise from the signal. Every cycle starts with noise. Copy paste chains chasing trends, white papers stacked with buzzwords, and ecosystems built on borrowed hype. But the market doesn't crown winners based on noise. It remembers the ones that changed the game. In 2021, that was Salana. Not because it launched the first NFTts, but because it made them feel instant. It wasn't about tech specs, it was about experience. Now in 2025, the spotlight is shifting again. And the signals are pointing to Sui. And behind it all, a team of executing like operators, mapping five moves ahead, sequencing each product like it's part of a master plan. Because it is. From the roots inside Meta to a global developer pipeline to a token unlock schedule designed for endurance, not exit liquidity. SU is not here for the spotlight. It's building for the long haul and positioning to run the next era. This is what infrastructure feels like when it's working. No noise or flashiness, just quietly and undeniably. And if you're seeing it now before the headlines catch up, then you're early. Ladies and gentlemen, if this gave you clarity, smash that like button. Do me a favor. And if you want to stay ahead of narratives before they go mainstream, make sure to hit that subscribe button. And guys, do me a favor. I'm curious to hear your thoughts. Drop your Sooie price targets for this bull run in the comments below. And what's going to unlock the next leg up? Is it Bitcoin staking, AI agents running on chain, or a gamefi console landing in millions of homes? The cycle's just getting started. Stay sharp. stack stats and I'll see you guys on the next"
}